TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:34 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Spi.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SpiaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SpiaRegs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$256)

     176                      .dwcfi  save_reg_to_mem, 26, 0
     177                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 98,column 4,is_stmt,isa 0
     178 0000001e 7622   EALLOW
     179                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 107,column 5,is_stmt,isa 0
     180 0000001f 761F!         MOVW      DP,#_GpioCtrlRegs+13  ; [CPU_ARAU] 
         00000020 0000 
     181 00000021 180D!         AND       @_GpioCtrlRegs+13,#0xfffe ; [CPU_ALU] |107| 
         00000022 FFFE 
     182                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 109,column 5,is_stmt,isa 0
     183 00000023 180D!         AND       @_GpioCtrlRegs+13,#0xfffd ; [CPU_ALU] |109| 
         00000024 FFFD 
     184                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 111,column 5,is_stmt,isa 0
     185 00000025 180D!         AND       @_GpioCtrlRegs+13,#0xfffb ; [CPU_ALU] |111| 
         00000026 FFFB 
     186                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 112,column 5,is_stmt,isa 0
     187 00000027 180D!         AND       @_GpioCtrlRegs+13,#0xfff7 ; [CPU_ALU] |112| 
         00000028 FFF7 
     188                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 120,column 5,is_stmt,isa 0
     189 00000029 1A04!         OR        @_GpioCtrlRegs+4,#0x0003 ; [CPU_ALU] |120| 
         0000002a 0003 
     190                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 122,column 5,is_stmt,isa 0
     191 0000002b 1A04!         OR        @_GpioCtrlRegs+4,#0x000c ; [CPU_ALU] |122| 
         0000002c 000C 
     192                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 124,column 5,is_stmt,isa 0
     193 0000002d 1A04!         OR        @_GpioCtrlRegs+4,#0x0030 ; [CPU_ALU] |124| 
         0000002e 0030 
     194                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 125,column 5,is_stmt,isa 0
     195 0000002f 1A04!         OR        @_GpioCtrlRegs+4,#0x00c0 ; [CPU_ALU] |125| 
         00000030 00C0 
     196                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 134,column 5,is_stmt,isa 0
     197 00000031 CC08!         AND       AL,@_GpioCtrlRegs+8,#0xfffc ; [CPU_ALU] |134| 
         00000032 FFFC 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    5

     198 00000033 5001          ORB       AL,#0x01              ; [CPU_ALU] |134| 
     199 00000034 9608!         MOV       @_GpioCtrlRegs+8,AL   ; [CPU_ALU] |134| 
     200                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 136,column 5,is_stmt,isa 0
     201 00000035 CC08!         AND       AL,@_GpioCtrlRegs+8,#0xfff3 ; [CPU_ALU] |136| 
         00000036 FFF3 
     202 00000037 5004          ORB       AL,#0x04              ; [CPU_ALU] |136| 
     203 00000038 9608!         MOV       @_GpioCtrlRegs+8,AL   ; [CPU_ALU] |136| 
     204                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 138,column 5,is_stmt,isa 0
     205 00000039 CC08!         AND       AL,@_GpioCtrlRegs+8,#0xffcf ; [CPU_ALU] |138| 
         0000003a FFCF 
     206 0000003b 5010          ORB       AL,#0x10              ; [CPU_ALU] |138| 
     207 0000003c 9608!         MOV       @_GpioCtrlRegs+8,AL   ; [CPU_ALU] |138| 
     208                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 139,column 5,is_stmt,isa 0
     209 0000003d CC08!         AND       AL,@_GpioCtrlRegs+8,#0xff3f ; [CPU_ALU] |139| 
         0000003e FF3F 
     210 0000003f 5040          ORB       AL,#0x40              ; [CPU_ALU] |139| 
     211 00000040 9608!         MOV       @_GpioCtrlRegs+8,AL   ; [CPU_ALU] |139| 
     212                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 141,column 5,is_stmt,isa 0
     213 00000041 761A   EDIS
     214                      .dwpsn  file "../F2837xD/F2837xD_Spi.c",line 142,column 1,is_stmt,isa 0
     215 00000042 FF69          SPM       #0                    ; [CPU_ALU] 
     216              $C$DW$9 .dwtag  DW_TAG_TI_branch
     217                      .dwattr $C$DW$9, DW_AT_low_pc(0x00)
     218                      .dwattr $C$DW$9, DW_AT_TI_return
     219              
     220 00000043 0006          LRETR     ; [CPU_ALU] 
     221                      ; return occurs ; [] 
     222                      .dwattr $C$DW$8, DW_AT_TI_end_file("../F2837xD/F2837xD_Spi.c")
     223                      .dwattr $C$DW$8, DW_AT_TI_end_line(0x8e)
     224                      .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     225                      .dwendentry
     226                      .dwendtag $C$DW$8
     227              
     228              ;**************************************************************
     229              ;* UNDEFINED EXTERNAL REFERENCES                              *
     230              ;**************************************************************
     231                      .global _SpiaRegs
     232                      .global _GpioCtrlRegs
     233              
     234              ;***************************************************************
     235              ;* TYPE INFORMATION                                            *
     236              ;***************************************************************
     237              
     238              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     239                      .dwattr $C$DW$T$20, DW_AT_name("GPACR_BITS")
     240                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     241              $C$DW$10        .dwtag  DW_TAG_member
     242                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     243                      .dwattr $C$DW$10, DW_AT_name("GPIO0")
     244                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_GPIO0")
     245                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0f)
     246                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     247                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     248                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     249              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    6

     250              $C$DW$11        .dwtag  DW_TAG_member
     251                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     252                      .dwattr $C$DW$11, DW_AT_name("GPIO1")
     253                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_GPIO1")
     254                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0e)
     255                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     256                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     257                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     258              
     259              $C$DW$12        .dwtag  DW_TAG_member
     260                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     261                      .dwattr $C$DW$12, DW_AT_name("GPIO2")
     262                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_GPIO2")
     263                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0d)
     264                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     265                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     267              
     268              $C$DW$13        .dwtag  DW_TAG_member
     269                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     270                      .dwattr $C$DW$13, DW_AT_name("GPIO3")
     271                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_GPIO3")
     272                      .dwattr $C$DW$13, DW_AT_bit_offset(0x0c)
     273                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     274                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     275                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     276              
     277              $C$DW$14        .dwtag  DW_TAG_member
     278                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     279                      .dwattr $C$DW$14, DW_AT_name("GPIO4")
     280                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_GPIO4")
     281                      .dwattr $C$DW$14, DW_AT_bit_offset(0x0b)
     282                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     283                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     284                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     285              
     286              $C$DW$15        .dwtag  DW_TAG_member
     287                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     288                      .dwattr $C$DW$15, DW_AT_name("GPIO5")
     289                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_GPIO5")
     290                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0a)
     291                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     292                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     293                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     294              
     295              $C$DW$16        .dwtag  DW_TAG_member
     296                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     297                      .dwattr $C$DW$16, DW_AT_name("GPIO6")
     298                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_GPIO6")
     299                      .dwattr $C$DW$16, DW_AT_bit_offset(0x09)
     300                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     301                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     303              
     304              $C$DW$17        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    7

     305                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$17, DW_AT_name("GPIO7")
     307                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_GPIO7")
     308                      .dwattr $C$DW$17, DW_AT_bit_offset(0x08)
     309                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     310                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     311                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     312              
     313              $C$DW$18        .dwtag  DW_TAG_member
     314                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     315                      .dwattr $C$DW$18, DW_AT_name("GPIO8")
     316                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_GPIO8")
     317                      .dwattr $C$DW$18, DW_AT_bit_offset(0x07)
     318                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     319                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     320                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     321              
     322              $C$DW$19        .dwtag  DW_TAG_member
     323                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     324                      .dwattr $C$DW$19, DW_AT_name("GPIO9")
     325                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_GPIO9")
     326                      .dwattr $C$DW$19, DW_AT_bit_offset(0x06)
     327                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     328                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     329                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     330              
     331              $C$DW$20        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     333                      .dwattr $C$DW$20, DW_AT_name("GPIO10")
     334                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_GPIO10")
     335                      .dwattr $C$DW$20, DW_AT_bit_offset(0x05)
     336                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     337                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     338                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     339              
     340              $C$DW$21        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     342                      .dwattr $C$DW$21, DW_AT_name("GPIO11")
     343                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_GPIO11")
     344                      .dwattr $C$DW$21, DW_AT_bit_offset(0x04)
     345                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     346                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     348              
     349              $C$DW$22        .dwtag  DW_TAG_member
     350                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     351                      .dwattr $C$DW$22, DW_AT_name("GPIO12")
     352                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_GPIO12")
     353                      .dwattr $C$DW$22, DW_AT_bit_offset(0x03)
     354                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     355                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     356                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     357              
     358              $C$DW$23        .dwtag  DW_TAG_member
     359                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    8

     360                      .dwattr $C$DW$23, DW_AT_name("GPIO13")
     361                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_GPIO13")
     362                      .dwattr $C$DW$23, DW_AT_bit_offset(0x02)
     363                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     364                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     365                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     366              
     367              $C$DW$24        .dwtag  DW_TAG_member
     368                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     369                      .dwattr $C$DW$24, DW_AT_name("GPIO14")
     370                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GPIO14")
     371                      .dwattr $C$DW$24, DW_AT_bit_offset(0x01)
     372                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     373                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     374                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     375              
     376              $C$DW$25        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$25, DW_AT_name("GPIO15")
     379                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GPIO15")
     380                      .dwattr $C$DW$25, DW_AT_bit_offset(0x00)
     381                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     382                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     384              
     385              $C$DW$26        .dwtag  DW_TAG_member
     386                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     387                      .dwattr $C$DW$26, DW_AT_name("GPIO16")
     388                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_GPIO16")
     389                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0f)
     390                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     391                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     392                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     393              
     394              $C$DW$27        .dwtag  DW_TAG_member
     395                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     396                      .dwattr $C$DW$27, DW_AT_name("GPIO17")
     397                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIO17")
     398                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0e)
     399                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     400                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     401                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403              $C$DW$28        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     405                      .dwattr $C$DW$28, DW_AT_name("GPIO18")
     406                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIO18")
     407                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d)
     408                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     409                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     410                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     411              
     412              $C$DW$29        .dwtag  DW_TAG_member
     413                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     414                      .dwattr $C$DW$29, DW_AT_name("GPIO19")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE    9

     415                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO19")
     416                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     417                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     418                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     419                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     420              
     421              $C$DW$30        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     423                      .dwattr $C$DW$30, DW_AT_name("GPIO20")
     424                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO20")
     425                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     426                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     427                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     428                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$31        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     432                      .dwattr $C$DW$31, DW_AT_name("GPIO21")
     433                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO21")
     434                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a)
     435                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     436                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     437                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     438              
     439              $C$DW$32        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$32, DW_AT_name("GPIO22")
     442                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO22")
     443                      .dwattr $C$DW$32, DW_AT_bit_offset(0x09)
     444                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     445                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     446                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     447              
     448              $C$DW$33        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     450                      .dwattr $C$DW$33, DW_AT_name("GPIO23")
     451                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO23")
     452                      .dwattr $C$DW$33, DW_AT_bit_offset(0x08)
     453                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     454                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     455                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     456              
     457              $C$DW$34        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$34, DW_AT_name("GPIO24")
     460                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO24")
     461                      .dwattr $C$DW$34, DW_AT_bit_offset(0x07)
     462                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     463                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     464                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     465              
     466              $C$DW$35        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$35, DW_AT_name("GPIO25")
     469                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO25")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   10

     470                      .dwattr $C$DW$35, DW_AT_bit_offset(0x06)
     471                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     472                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     473                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475              $C$DW$36        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     477                      .dwattr $C$DW$36, DW_AT_name("GPIO26")
     478                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO26")
     479                      .dwattr $C$DW$36, DW_AT_bit_offset(0x05)
     480                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     481                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     482                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     483              
     484              $C$DW$37        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     486                      .dwattr $C$DW$37, DW_AT_name("GPIO27")
     487                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO27")
     488                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04)
     489                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     490                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     491                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     492              
     493              $C$DW$38        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$38, DW_AT_name("GPIO28")
     496                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO28")
     497                      .dwattr $C$DW$38, DW_AT_bit_offset(0x03)
     498                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     499                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     500                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$39        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$39, DW_AT_name("GPIO29")
     505                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO29")
     506                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     507                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     508                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     509                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$40        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$40, DW_AT_name("GPIO30")
     514                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO30")
     515                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     516                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     517                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     518                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$41        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$41, DW_AT_name("GPIO31")
     523                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO31")
     524                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   11

     525                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     526                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     527                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529                      .dwendtag $C$DW$T$20
     530              
     531              
     532              $C$DW$T$22      .dwtag  DW_TAG_union_type
     533                      .dwattr $C$DW$T$22, DW_AT_name("GPACR_REG")
     534                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     535              $C$DW$42        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
     537                      .dwattr $C$DW$42, DW_AT_name("all")
     538                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     539                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     541              
     542              $C$DW$43        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     544                      .dwattr $C$DW$43, DW_AT_name("bit")
     545                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     546                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549                      .dwendtag $C$DW$T$22
     550              
     551              
     552              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     553                      .dwattr $C$DW$T$23, DW_AT_name("GPACSEL1_BITS")
     554                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     555              $C$DW$44        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$44, DW_AT_name("GPIO0")
     558                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO0")
     559                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     560                      .dwattr $C$DW$44, DW_AT_bit_size(0x04)
     561                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     563              
     564              $C$DW$45        .dwtag  DW_TAG_member
     565                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     566                      .dwattr $C$DW$45, DW_AT_name("GPIO1")
     567                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO1")
     568                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08)
     569                      .dwattr $C$DW$45, DW_AT_bit_size(0x04)
     570                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     572              
     573              $C$DW$46        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     575                      .dwattr $C$DW$46, DW_AT_name("GPIO2")
     576                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO2")
     577                      .dwattr $C$DW$46, DW_AT_bit_offset(0x04)
     578                      .dwattr $C$DW$46, DW_AT_bit_size(0x04)
     579                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   12

     580                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582              $C$DW$47        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$47, DW_AT_name("GPIO3")
     585                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO3")
     586                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     587                      .dwattr $C$DW$47, DW_AT_bit_size(0x04)
     588                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     590              
     591              $C$DW$48        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$48, DW_AT_name("GPIO4")
     594                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO4")
     595                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c)
     596                      .dwattr $C$DW$48, DW_AT_bit_size(0x04)
     597                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     598                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600              $C$DW$49        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$49, DW_AT_name("GPIO5")
     603                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO5")
     604                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     605                      .dwattr $C$DW$49, DW_AT_bit_size(0x04)
     606                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     607                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     608              
     609              $C$DW$50        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$50, DW_AT_name("GPIO6")
     612                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO6")
     613                      .dwattr $C$DW$50, DW_AT_bit_offset(0x04)
     614                      .dwattr $C$DW$50, DW_AT_bit_size(0x04)
     615                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     616                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$51        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$51, DW_AT_name("GPIO7")
     621                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO7")
     622                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     623                      .dwattr $C$DW$51, DW_AT_bit_size(0x04)
     624                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     625                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627                      .dwendtag $C$DW$T$23
     628              
     629              
     630              $C$DW$T$24      .dwtag  DW_TAG_union_type
     631                      .dwattr $C$DW$T$24, DW_AT_name("GPACSEL1_REG")
     632                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     633              $C$DW$52        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   13

     635                      .dwattr $C$DW$52, DW_AT_name("all")
     636                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     637                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$53        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
     642                      .dwattr $C$DW$53, DW_AT_name("bit")
     643                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     644                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647                      .dwendtag $C$DW$T$24
     648              
     649              
     650              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     651                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL2_BITS")
     652                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     653              $C$DW$54        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$54, DW_AT_name("GPIO8")
     656                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO8")
     657                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c)
     658                      .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     659                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$55        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$55, DW_AT_name("GPIO9")
     665                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO9")
     666                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08)
     667                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     668                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$56        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$56, DW_AT_name("GPIO10")
     674                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO10")
     675                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     676                      .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     677                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$57        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$57, DW_AT_name("GPIO11")
     683                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO11")
     684                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     685                      .dwattr $C$DW$57, DW_AT_bit_size(0x04)
     686                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     688              
     689              $C$DW$58        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   14

     690                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$58, DW_AT_name("GPIO12")
     692                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO12")
     693                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     694                      .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     695                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     696                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698              $C$DW$59        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$59, DW_AT_name("GPIO13")
     701                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO13")
     702                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     703                      .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     704                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     705                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$60        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$60, DW_AT_name("GPIO14")
     710                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO14")
     711                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     712                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     713                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     714                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     715              
     716              $C$DW$61        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$61, DW_AT_name("GPIO15")
     719                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO15")
     720                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     721                      .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     722                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     723                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     724              
     725                      .dwendtag $C$DW$T$25
     726              
     727              
     728              $C$DW$T$26      .dwtag  DW_TAG_union_type
     729                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL2_REG")
     730                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     731              $C$DW$62        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     733                      .dwattr $C$DW$62, DW_AT_name("all")
     734                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     735                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$63        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
     740                      .dwattr $C$DW$63, DW_AT_name("bit")
     741                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     742                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     744              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   15

     745                      .dwendtag $C$DW$T$26
     746              
     747              
     748              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     749                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL3_BITS")
     750                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     751              $C$DW$64        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$64, DW_AT_name("GPIO16")
     754                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO16")
     755                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     756                      .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     757                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760              $C$DW$65        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$65, DW_AT_name("GPIO17")
     763                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO17")
     764                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     765                      .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     766                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     768              
     769              $C$DW$66        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     771                      .dwattr $C$DW$66, DW_AT_name("GPIO18")
     772                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO18")
     773                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
     774                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     775                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     777              
     778              $C$DW$67        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$67, DW_AT_name("GPIO19")
     781                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO19")
     782                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     783                      .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     784                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$68        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$68, DW_AT_name("GPIO20")
     790                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO20")
     791                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
     792                      .dwattr $C$DW$68, DW_AT_bit_size(0x04)
     793                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     794                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     795              
     796              $C$DW$69        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$69, DW_AT_name("GPIO21")
     799                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO21")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   16

     800                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08)
     801                      .dwattr $C$DW$69, DW_AT_bit_size(0x04)
     802                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     803                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     804              
     805              $C$DW$70        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$70, DW_AT_name("GPIO22")
     808                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO22")
     809                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04)
     810                      .dwattr $C$DW$70, DW_AT_bit_size(0x04)
     811                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     812                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     813              
     814              $C$DW$71        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     816                      .dwattr $C$DW$71, DW_AT_name("GPIO23")
     817                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO23")
     818                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00)
     819                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
     820                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     821                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     822              
     823                      .dwendtag $C$DW$T$27
     824              
     825              
     826              $C$DW$T$28      .dwtag  DW_TAG_union_type
     827                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL3_REG")
     828                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     829              $C$DW$72        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     831                      .dwattr $C$DW$72, DW_AT_name("all")
     832                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     833                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     835              
     836              $C$DW$73        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$27)
     838                      .dwattr $C$DW$73, DW_AT_name("bit")
     839                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     840                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843                      .dwendtag $C$DW$T$28
     844              
     845              
     846              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     847                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL4_BITS")
     848                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     849              $C$DW$74        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$74, DW_AT_name("GPIO24")
     852                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO24")
     853                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
     854                      .dwattr $C$DW$74, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   17

     855                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$75        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$75, DW_AT_name("GPIO25")
     861                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO25")
     862                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
     863                      .dwattr $C$DW$75, DW_AT_bit_size(0x04)
     864                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$76        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$76, DW_AT_name("GPIO26")
     870                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO26")
     871                      .dwattr $C$DW$76, DW_AT_bit_offset(0x04)
     872                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
     873                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$77        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$77, DW_AT_name("GPIO27")
     879                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO27")
     880                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
     881                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
     882                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$78        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$78, DW_AT_name("GPIO28")
     888                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO28")
     889                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c)
     890                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
     891                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     892                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894              $C$DW$79        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$79, DW_AT_name("GPIO29")
     897                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO29")
     898                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
     899                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
     900                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     901                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$80        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$80, DW_AT_name("GPIO30")
     906                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO30")
     907                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
     908                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
     909                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   18

     910                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$81        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$81, DW_AT_name("GPIO31")
     915                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO31")
     916                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
     917                      .dwattr $C$DW$81, DW_AT_bit_size(0x04)
     918                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     919                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921                      .dwendtag $C$DW$T$29
     922              
     923              
     924              $C$DW$T$30      .dwtag  DW_TAG_union_type
     925                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL4_REG")
     926                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     927              $C$DW$82        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     929                      .dwattr $C$DW$82, DW_AT_name("all")
     930                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
     931                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934              $C$DW$83        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
     936                      .dwattr $C$DW$83, DW_AT_name("bit")
     937                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
     938                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941                      .dwendtag $C$DW$T$30
     942              
     943              
     944              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     945                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
     946                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     947              $C$DW$84        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$84, DW_AT_name("QUALPRD0")
     950                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_QUALPRD0")
     951                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
     952                      .dwattr $C$DW$84, DW_AT_bit_size(0x08)
     953                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$85        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$85, DW_AT_name("QUALPRD1")
     959                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_QUALPRD1")
     960                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
     961                      .dwattr $C$DW$85, DW_AT_bit_size(0x08)
     962                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     964              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   19

     965              $C$DW$86        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$86, DW_AT_name("QUALPRD2")
     968                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_QUALPRD2")
     969                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
     970                      .dwattr $C$DW$86, DW_AT_bit_size(0x08)
     971                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     972                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$87        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$87, DW_AT_name("QUALPRD3")
     977                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_QUALPRD3")
     978                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
     979                      .dwattr $C$DW$87, DW_AT_bit_size(0x08)
     980                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     981                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983                      .dwendtag $C$DW$T$31
     984              
     985              
     986              $C$DW$T$32      .dwtag  DW_TAG_union_type
     987                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
     988                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     989              $C$DW$88        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     991                      .dwattr $C$DW$88, DW_AT_name("all")
     992                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
     993                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     995              
     996              $C$DW$89        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$31)
     998                      .dwattr $C$DW$89, DW_AT_name("bit")
     999                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1000                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003                      .dwendtag $C$DW$T$32
    1004              
    1005              
    1006              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1007                      .dwattr $C$DW$T$33, DW_AT_name("GPADIR_BITS")
    1008                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1009              $C$DW$90        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$90, DW_AT_name("GPIO0")
    1012                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO0")
    1013                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
    1014                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1015                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1017              
    1018              $C$DW$91        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   20

    1020                      .dwattr $C$DW$91, DW_AT_name("GPIO1")
    1021                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO1")
    1022                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
    1023                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1024                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1026              
    1027              $C$DW$92        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1029                      .dwattr $C$DW$92, DW_AT_name("GPIO2")
    1030                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO2")
    1031                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
    1032                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1033                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1035              
    1036              $C$DW$93        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$93, DW_AT_name("GPIO3")
    1039                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO3")
    1040                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1041                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1042                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045              $C$DW$94        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$94, DW_AT_name("GPIO4")
    1048                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO4")
    1049                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b)
    1050                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1051                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$95        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$95, DW_AT_name("GPIO5")
    1057                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO5")
    1058                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1059                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1060                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1062              
    1063              $C$DW$96        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$96, DW_AT_name("GPIO6")
    1066                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO6")
    1067                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09)
    1068                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$97        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$97, DW_AT_name("GPIO7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   21

    1075                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO7")
    1076                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    1077                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$98        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$98, DW_AT_name("GPIO8")
    1084                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO8")
    1085                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
    1086                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$99        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$99, DW_AT_name("GPIO9")
    1093                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO9")
    1094                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06)
    1095                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$100       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$100, DW_AT_name("GPIO10")
    1102                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO10")
    1103                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05)
    1104                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$101       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$101, DW_AT_name("GPIO11")
    1111                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO11")
    1112                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1113                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$102       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$102, DW_AT_name("GPIO12")
    1120                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO12")
    1121                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1122                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$103       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$103, DW_AT_name("GPIO13")
    1129                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO13")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   22

    1130                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
    1131                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$104       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$104, DW_AT_name("GPIO14")
    1138                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO14")
    1139                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    1140                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$105       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$105, DW_AT_name("GPIO15")
    1147                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO15")
    1148                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1149                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$106       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$106, DW_AT_name("GPIO16")
    1156                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO16")
    1157                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1158                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1160                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$107       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$107, DW_AT_name("GPIO17")
    1165                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO17")
    1166                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1167                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1169                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$108       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$108, DW_AT_name("GPIO18")
    1174                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO18")
    1175                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1176                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1178                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$109       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$109, DW_AT_name("GPIO19")
    1183                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO19")
    1184                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   23

    1185                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1187                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$110       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$110, DW_AT_name("GPIO20")
    1192                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO20")
    1193                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1194                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1196                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$111       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$111, DW_AT_name("GPIO21")
    1201                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO21")
    1202                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1203                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1204                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1205                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$112       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$112, DW_AT_name("GPIO22")
    1210                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO22")
    1211                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1212                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1214                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$113       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$113, DW_AT_name("GPIO23")
    1219                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO23")
    1220                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1221                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1223                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$114       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$114, DW_AT_name("GPIO24")
    1228                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO24")
    1229                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1230                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1232                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$115       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$115, DW_AT_name("GPIO25")
    1237                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO25")
    1238                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1239                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   24

    1240                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1241                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$116       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$116, DW_AT_name("GPIO26")
    1246                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO26")
    1247                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1248                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1250                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$117       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$117, DW_AT_name("GPIO27")
    1255                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO27")
    1256                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1257                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1259                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$118       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$118, DW_AT_name("GPIO28")
    1264                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO28")
    1265                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1266                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1268                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$119       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$119, DW_AT_name("GPIO29")
    1273                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO29")
    1274                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1275                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1277                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$120       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$120, DW_AT_name("GPIO30")
    1282                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO30")
    1283                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    1284                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1286                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$121       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$121, DW_AT_name("GPIO31")
    1291                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO31")
    1292                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1293                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   25

    1295                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297                      .dwendtag $C$DW$T$33
    1298              
    1299              
    1300              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1301                      .dwattr $C$DW$T$34, DW_AT_name("GPADIR_REG")
    1302                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1303              $C$DW$122       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1305                      .dwattr $C$DW$122, DW_AT_name("all")
    1306                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1307                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$123       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$33)
    1312                      .dwattr $C$DW$123, DW_AT_name("bit")
    1313                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1314                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317                      .dwendtag $C$DW$T$34
    1318              
    1319              
    1320              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1321                      .dwattr $C$DW$T$35, DW_AT_name("GPAGMUX1_BITS")
    1322                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1323              $C$DW$124       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$124, DW_AT_name("GPIO0")
    1326                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO0")
    1327                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1328                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1329                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$125       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$125, DW_AT_name("GPIO1")
    1335                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO1")
    1336                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c)
    1337                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    1338                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$126       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$126, DW_AT_name("GPIO2")
    1344                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO2")
    1345                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1346                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1347                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1349              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   26

    1350              $C$DW$127       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$127, DW_AT_name("GPIO3")
    1353                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO3")
    1354                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1355                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1356                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$128       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$128, DW_AT_name("GPIO4")
    1362                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO4")
    1363                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06)
    1364                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1365                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$129       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$129, DW_AT_name("GPIO5")
    1371                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO5")
    1372                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    1373                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1374                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$130       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$130, DW_AT_name("GPIO6")
    1380                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO6")
    1381                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02)
    1382                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$131       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$131, DW_AT_name("GPIO7")
    1389                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO7")
    1390                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1391                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1392                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$132       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$132, DW_AT_name("GPIO8")
    1398                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO8")
    1399                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1400                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1401                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1402                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$133       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   27

    1405                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$133, DW_AT_name("GPIO9")
    1407                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO9")
    1408                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    1409                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1410                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1411                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$134       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$134, DW_AT_name("GPIO10")
    1416                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO10")
    1417                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0a)
    1418                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1419                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1420                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$135       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$135, DW_AT_name("GPIO11")
    1425                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO11")
    1426                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08)
    1427                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1428                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1429                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$136       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$136, DW_AT_name("GPIO12")
    1434                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO12")
    1435                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06)
    1436                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1437                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1438                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$137       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$137, DW_AT_name("GPIO13")
    1443                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO13")
    1444                      .dwattr $C$DW$137, DW_AT_bit_offset(0x04)
    1445                      .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    1446                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1447                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449              $C$DW$138       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$138, DW_AT_name("GPIO14")
    1452                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO14")
    1453                      .dwattr $C$DW$138, DW_AT_bit_offset(0x02)
    1454                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    1455                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1456                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$139       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   28

    1460                      .dwattr $C$DW$139, DW_AT_name("GPIO15")
    1461                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO15")
    1462                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1463                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    1464                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1465                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467                      .dwendtag $C$DW$T$35
    1468              
    1469              
    1470              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1471                      .dwattr $C$DW$T$36, DW_AT_name("GPAGMUX1_REG")
    1472                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1473              $C$DW$140       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1475                      .dwattr $C$DW$140, DW_AT_name("all")
    1476                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1477                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1479              
    1480              $C$DW$141       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$35)
    1482                      .dwattr $C$DW$141, DW_AT_name("bit")
    1483                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1484                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1486              
    1487                      .dwendtag $C$DW$T$36
    1488              
    1489              
    1490              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1491                      .dwattr $C$DW$T$37, DW_AT_name("GPAGMUX2_BITS")
    1492                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1493              $C$DW$142       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$142, DW_AT_name("GPIO16")
    1496                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO16")
    1497                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    1498                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    1499                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$143       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$143, DW_AT_name("GPIO17")
    1505                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO17")
    1506                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c)
    1507                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    1508                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$144       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$144, DW_AT_name("GPIO18")
    1514                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO18")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Spi.asm                                                      PAGE   29

    1515                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a)
    1516                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1517                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$145       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$145, DW_AT_name("GPIO19")
    1523                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO19")
    1524                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08)
    1525                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
