TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:35 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_SysCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_EnableUnbondedIOPullups")

    2298 00000321 1A36!         OR        @_CpuSysRegs+118,#0x0003 ; [CPU_ALU] |1007| 
         00000322 0003 
    2299                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1008,column 5,is_stmt,isa 0
    2300 00000323 761A   EDIS
    2301                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1010,column 5,is_stmt,isa 0
    2302 00000324       $C$L35:    
    2303                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1010,column 11,is_stmt,isa 0
    2304 00000324 761F!         MOVW      DP,#_DevCfgRegs+293   ; [CPU_ARAU] 
         00000325 0004 
    2305 00000326 9225!         MOV       AL,@_DevCfgRegs+293   ; [CPU_ALU] |1010| 
    2306 00000327 9003          ANDB      AL,#0x03              ; [CPU_ALU] |1010| 
    2307 00000328 6005          B         $C$L36,NEQ            ; [CPU_ALU] |1010| 
    2308                      ; branchcc occurs ; [] |1010| 
    2309 00000329 9224!         MOV       AL,@_DevCfgRegs+292   ; [CPU_ALU] |1010| 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   47

    2310 0000032a 9001          ANDB      AL,#0x01              ; [CPU_ALU] |1010| 
    2311 0000032b 5201          CMPB      AL,#1                 ; [CPU_ALU] |1010| 
    2312 0000032c 61F8          B         $C$L35,EQ             ; [CPU_ALU] |1010| 
    2313                      ; branchcc occurs ; [] |1010| 
    2314 0000032d       $C$L36:    
    2315                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1013,column 5,is_stmt,isa 0
    2316 0000032d FF69          SPM       #0                    ; [CPU_ALU] 
    2317              $C$DW$98        .dwtag  DW_TAG_TI_branch
    2318                      .dwattr $C$DW$98, DW_AT_low_pc(0x00)
    2319                      .dwattr $C$DW$98, DW_AT_name("_DisablePeripheralClocks")
    2320                      .dwattr $C$DW$98, DW_AT_TI_call
    2321              
    2322 0000032e 7640'         LCR       #_DisablePeripheralClocks ; [CPU_ALU] |1013| 
         0000032f 00B5 
    2323                      ; call occurs [#_DisablePeripheralClocks] ; [] |1013| 
    2324                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1014,column 5,is_stmt,isa 0
    2325 00000330 7622   EALLOW
    2326                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1015,column 5,is_stmt,isa 0
    2327 00000331 761F!         MOVW      DP,#_ClkCfgRegs+14    ; [CPU_ARAU] 
         00000332 0000 
    2328 00000333 180E!         AND       @_ClkCfgRegs+14,#0xfffd ; [CPU_ALU] |1015| 
         00000334 FFFD 
    2329                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1016,column 5,is_stmt,isa 0
    2330 00000335 180E!         AND       @_ClkCfgRegs+14,#0xfffe ; [CPU_ALU] |1016| 
         00000336 FFFE 
    2331                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1017,column 5,is_stmt,isa 0
    2332 00000337 761A   EDIS
    2333                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1018,column 5,is_stmt,isa 0
    2334 00000338 7621   IDLE
    2335                      .dwpsn  file "../F2837xD/F2837xD_SysCtrl.c",line 1020,column 1,is_stmt,isa 0
    2336 00000339 FF69          SPM       #0                    ; [CPU_ALU] 
    2337              $C$DW$99        .dwtag  DW_TAG_TI_branch
    2338                      .dwattr $C$DW$99, DW_AT_low_pc(0x00)
    2339                      .dwattr $C$DW$99, DW_AT_TI_return
    2340              
    2341 0000033a 0006          LRETR     ; [CPU_ALU] 
    2342                      ; return occurs ; [] 
    2343                      .dwattr $C$DW$97, DW_AT_TI_end_file("../F2837xD/F2837xD_SysCtrl.c")
    2344                      .dwattr $C$DW$97, DW_AT_TI_end_line(0x3fc)
    2345                      .dwattr $C$DW$97, DW_AT_TI_end_column(0x01)
    2346                      .dwendentry
    2347                      .dwendtag $C$DW$97
    2348              
    2349              ;**************************************************************
    2350              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2351              ;**************************************************************
    2352                      .global _GPIO_EnableUnbondedIOPullups
    2353                      .global _FlashPumpSemaphoreRegs
    2354                      .global _CpuTimer2Regs
    2355                      .global _DcsmZ1Regs
    2356                      .global _DcsmZ2Regs
    2357                      .global _Flash0EccRegs
    2358                      .global _WdRegs
    2359                      .global _ClkCfgRegs
    2360                      .global _AnalogSubsysRegs
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   48

    2361                      .global _CpuSysRegs
    2362                      .global _DevCfgRegs
    2363                      .global _Flash0CtrlRegs
    2364              
    2365              ;***************************************************************
    2366              ;* TYPE INFORMATION                                            *
    2367              ;***************************************************************
    2368              
    2369              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2370                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2371                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2372              $C$DW$100       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2374                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    2375                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    2376                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2378              
    2379              $C$DW$101       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$186)
    2381                      .dwattr $C$DW$101, DW_AT_name("INTOSC1TRIM")
    2382                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2383                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2384                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2385              
    2386              $C$DW$102       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$188)
    2388                      .dwattr $C$DW$102, DW_AT_name("INTOSC2TRIM")
    2389                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2390                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2391                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2392              
    2393              $C$DW$103       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    2395                      .dwattr $C$DW$103, DW_AT_name("rsvd2")
    2396                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd2")
    2397                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2398                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2399              
    2400              $C$DW$104       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$300)
    2402                      .dwattr $C$DW$104, DW_AT_name("TSNSCTL")
    2403                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_TSNSCTL")
    2404                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2405                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2406              
    2407              $C$DW$105       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    2409                      .dwattr $C$DW$105, DW_AT_name("rsvd3")
    2410                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd3")
    2411                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2412                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$106       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$192)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2416                      .dwattr $C$DW$106, DW_AT_name("LOCK")
    2417                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_LOCK")
    2418                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2419                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421              $C$DW$107       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$23)
    2423                      .dwattr $C$DW$107, DW_AT_name("rsvd4")
    2424                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd4")
    2425                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2426                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$108       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    2430                      .dwattr $C$DW$108, DW_AT_name("ANAREFTRIMA")
    2431                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2432                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2433                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2434              
    2435              $C$DW$109       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$30)
    2437                      .dwattr $C$DW$109, DW_AT_name("ANAREFTRIMB")
    2438                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2439                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2440                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2441              
    2442              $C$DW$110       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$32)
    2444                      .dwattr $C$DW$110, DW_AT_name("ANAREFTRIMC")
    2445                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2446                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2447                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2448              
    2449              $C$DW$111       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$34)
    2451                      .dwattr $C$DW$111, DW_AT_name("ANAREFTRIMD")
    2452                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2453                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2454                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456              $C$DW$112       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$24)
    2458                      .dwattr $C$DW$112, DW_AT_name("rsvd5")
    2459                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd5")
    2460                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2461                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463                      .dwendtag $C$DW$T$25
    2464              
    2465              $C$DW$113       .dwtag  DW_TAG_TI_far_type
    2466                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    2467              
    2468              $C$DW$T$348     .dwtag  DW_TAG_volatile_type
    2469                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$113)
    2470              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2471              
    2472              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2473                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2474                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2475              $C$DW$114       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$114, DW_AT_name("BGVALTRIM")
    2478                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_BGVALTRIM")
    2479                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    2480                      .dwattr $C$DW$114, DW_AT_bit_size(0x06)
    2481                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484              $C$DW$115       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$115, DW_AT_name("BGSLOPETRIM")
    2487                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2488                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    2489                      .dwattr $C$DW$115, DW_AT_bit_size(0x05)
    2490                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2492              
    2493              $C$DW$116       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2495                      .dwattr $C$DW$116, DW_AT_name("IREFTRIM")
    2496                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IREFTRIM")
    2497                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2498                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2499                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2501              
    2502              $C$DW$117       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2504                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    2505                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    2506                      .dwattr $C$DW$117, DW_AT_bit_offset(0x08)
    2507                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    2508                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2509                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2510              
    2511              $C$DW$118       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2513                      .dwattr $C$DW$118, DW_AT_name("rsvd2")
    2514                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd2")
    2515                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2516                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
    2517                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2518                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520                      .dwendtag $C$DW$T$26
    2521              
    2522              
    2523              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2524                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2525                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2526              $C$DW$119       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    2528                      .dwattr $C$DW$119, DW_AT_name("all")
    2529                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    2530                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2532              
    2533              $C$DW$120       .dwtag  DW_TAG_member
    2534                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$26)
    2535                      .dwattr $C$DW$120, DW_AT_name("bit")
    2536                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    2537                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2538                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2539              
    2540                      .dwendtag $C$DW$T$28
    2541              
    2542              
    2543              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2544                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2545                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2546              $C$DW$121       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$121, DW_AT_name("BGVALTRIM")
    2549                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_BGVALTRIM")
    2550                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a)
    2551                      .dwattr $C$DW$121, DW_AT_bit_size(0x06)
    2552                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$122       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$122, DW_AT_name("BGSLOPETRIM")
    2558                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2559                      .dwattr $C$DW$122, DW_AT_bit_offset(0x05)
    2560                      .dwattr $C$DW$122, DW_AT_bit_size(0x05)
    2561                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$123       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$123, DW_AT_name("IREFTRIM")
    2567                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IREFTRIM")
    2568                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2569                      .dwattr $C$DW$123, DW_AT_bit_size(0x05)
    2570                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2572              
    2573              $C$DW$124       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    2576                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    2577                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    2578                      .dwattr $C$DW$124, DW_AT_bit_size(0x08)
    2579                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2580                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2581              
    2582              $C$DW$125       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$125, DW_AT_name("rsvd2")
    2585                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd2")
    2586                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    2587                      .dwattr $C$DW$125, DW_AT_bit_size(0x08)
    2588                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2589                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591                      .dwendtag $C$DW$T$29
    2592              
    2593              
    2594              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2595                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2596                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2597              $C$DW$126       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    2599                      .dwattr $C$DW$126, DW_AT_name("all")
    2600                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    2601                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604              $C$DW$127       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
    2606                      .dwattr $C$DW$127, DW_AT_name("bit")
    2607                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    2608                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2610              
    2611                      .dwendtag $C$DW$T$30
    2612              
    2613              
    2614              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2615                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2616                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2617              $C$DW$128       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$128, DW_AT_name("BGVALTRIM")
    2620                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_BGVALTRIM")
    2621                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    2622                      .dwattr $C$DW$128, DW_AT_bit_size(0x06)
    2623                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$129       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$129, DW_AT_name("BGSLOPETRIM")
    2629                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2630                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05)
    2631                      .dwattr $C$DW$129, DW_AT_bit_size(0x05)
    2632                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$130       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2636                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$130, DW_AT_name("IREFTRIM")
    2638                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IREFTRIM")
    2639                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2640                      .dwattr $C$DW$130, DW_AT_bit_size(0x05)
    2641                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644              $C$DW$131       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2647                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    2648                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    2649                      .dwattr $C$DW$131, DW_AT_bit_size(0x08)
    2650                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2651                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2652              
    2653              $C$DW$132       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2656                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    2657                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2658                      .dwattr $C$DW$132, DW_AT_bit_size(0x08)
    2659                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2660                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662                      .dwendtag $C$DW$T$31
    2663              
    2664              
    2665              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2666                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2667                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2668              $C$DW$133       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2670                      .dwattr $C$DW$133, DW_AT_name("all")
    2671                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    2672                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675              $C$DW$134       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    2677                      .dwattr $C$DW$134, DW_AT_name("bit")
    2678                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    2679                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2681              
    2682                      .dwendtag $C$DW$T$32
    2683              
    2684              
    2685              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2686                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2687                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2688              $C$DW$135       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$135, DW_AT_name("BGVALTRIM")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2691                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_BGVALTRIM")
    2692                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0a)
    2693                      .dwattr $C$DW$135, DW_AT_bit_size(0x06)
    2694                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$136       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$136, DW_AT_name("BGSLOPETRIM")
    2700                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2701                      .dwattr $C$DW$136, DW_AT_bit_offset(0x05)
    2702                      .dwattr $C$DW$136, DW_AT_bit_size(0x05)
    2703                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$137       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$137, DW_AT_name("IREFTRIM")
    2709                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IREFTRIM")
    2710                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2711                      .dwattr $C$DW$137, DW_AT_bit_size(0x05)
    2712                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$138       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    2718                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    2719                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    2720                      .dwattr $C$DW$138, DW_AT_bit_size(0x08)
    2721                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2722                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$139       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2727                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    2728                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2729                      .dwattr $C$DW$139, DW_AT_bit_size(0x08)
    2730                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2731                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733                      .dwendtag $C$DW$T$33
    2734              
    2735              
    2736              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2737                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2738                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2739              $C$DW$140       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2741                      .dwattr $C$DW$140, DW_AT_name("all")
    2742                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    2743                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2745              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2746              $C$DW$141       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$33)
    2748                      .dwattr $C$DW$141, DW_AT_name("bit")
    2749                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    2750                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2751                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2752              
    2753                      .dwendtag $C$DW$T$34
    2754              
    2755              
    2756              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2757                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2758                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2759              $C$DW$142       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$142, DW_AT_name("AUXPLLDIV")
    2762                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2763                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    2764                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    2765                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$143       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    2771                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
    2772                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2773                      .dwattr $C$DW$143, DW_AT_bit_size(0x0e)
    2774                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777              $C$DW$144       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2780                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2781                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2782                      .dwattr $C$DW$144, DW_AT_bit_size(0x10)
    2783                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2784                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786                      .dwendtag $C$DW$T$35
    2787              
    2788              
    2789              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2790                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2791                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2792              $C$DW$145       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2794                      .dwattr $C$DW$145, DW_AT_name("all")
    2795                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    2796                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2797                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2798              
    2799              $C$DW$146       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2801                      .dwattr $C$DW$146, DW_AT_name("bit")
    2802                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    2803                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806                      .dwendtag $C$DW$T$36
    2807              
    2808              
    2809              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2810                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2811                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2812              $C$DW$147       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2814                      .dwattr $C$DW$147, DW_AT_name("PLLEN")
    2815                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PLLEN")
    2816                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f)
    2817                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2818                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821              $C$DW$148       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2823                      .dwattr $C$DW$148, DW_AT_name("PLLCLKEN")
    2824                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PLLCLKEN")
    2825                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e)
    2826                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2827                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$149       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2832                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2833                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2834                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2835                      .dwattr $C$DW$149, DW_AT_bit_size(0x0e)
    2836                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839              $C$DW$150       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2841                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    2842                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    2843                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    2844                      .dwattr $C$DW$150, DW_AT_bit_size(0x10)
    2845                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2846                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848                      .dwendtag $C$DW$T$37
    2849              
    2850              
    2851              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2852                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2853                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2854              $C$DW$151       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2856                      .dwattr $C$DW$151, DW_AT_name("all")
    2857                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    2858                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2859                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2860              
    2861              $C$DW$152       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$37)
    2863                      .dwattr $C$DW$152, DW_AT_name("bit")
    2864                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    2865                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868                      .dwendtag $C$DW$T$38
    2869              
    2870              
    2871              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2872                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2873                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2874              $C$DW$153       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2876                      .dwattr $C$DW$153, DW_AT_name("IMULT")
    2877                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_IMULT")
    2878                      .dwattr $C$DW$153, DW_AT_bit_offset(0x09)
    2879                      .dwattr $C$DW$153, DW_AT_bit_size(0x07)
    2880                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883              $C$DW$154       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2885                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2886                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    2887                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08)
    2888                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2889                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2891              
    2892              $C$DW$155       .dwtag  DW_TAG_member
    2893                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2894                      .dwattr $C$DW$155, DW_AT_name("FMULT")
    2895                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_FMULT")
    2896                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    2897                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2898                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2899                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2900              
    2901              $C$DW$156       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2903                      .dwattr $C$DW$156, DW_AT_name("rsvd2")
    2904                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd2")
    2905                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2906                      .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2907                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2908                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2909              
    2910              $C$DW$157       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2911                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2912                      .dwattr $C$DW$157, DW_AT_name("rsvd3")
    2913                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd3")
    2914                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    2915                      .dwattr $C$DW$157, DW_AT_bit_size(0x10)
    2916                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2917                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2918              
    2919                      .dwendtag $C$DW$T$39
    2920              
    2921              
    2922              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2923                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2924                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2925              $C$DW$158       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2927                      .dwattr $C$DW$158, DW_AT_name("all")
    2928                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    2929                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2930                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2931              
    2932              $C$DW$159       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$39)
    2934                      .dwattr $C$DW$159, DW_AT_name("bit")
    2935                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    2936                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2937                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2938              
    2939                      .dwendtag $C$DW$T$40
    2940              
    2941              
    2942              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2943                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2944                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2945              $C$DW$160       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2947                      .dwattr $C$DW$160, DW_AT_name("LOCKS")
    2948                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_LOCKS")
    2949                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    2950                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2951                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2953              
    2954              $C$DW$161       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2956                      .dwattr $C$DW$161, DW_AT_name("SLIPS")
    2957                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SLIPS")
    2958                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    2959                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2960                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2961                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2962              
    2963              $C$DW$162       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2965                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    2966                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    2967                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2968                      .dwattr $C$DW$162, DW_AT_bit_size(0x0e)
    2969                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2970                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2971              
    2972              $C$DW$163       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2974                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    2975                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    2976                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2977                      .dwattr $C$DW$163, DW_AT_bit_size(0x10)
    2978                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2979                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2980              
    2981                      .dwendtag $C$DW$T$41
    2982              
    2983              
    2984              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2985                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2986                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2987              $C$DW$164       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    2989                      .dwattr $C$DW$164, DW_AT_name("all")
    2990                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    2991                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2992                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2993              
    2994              $C$DW$165       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$41)
    2996                      .dwattr $C$DW$165, DW_AT_name("bit")
    2997                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    2998                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2999                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3000              
    3001                      .dwendtag $C$DW$T$42
    3002              
    3003              
    3004              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3005                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    3006                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3007              $C$DW$166       .dwtag  DW_TAG_member
    3008                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    3009                      .dwattr $C$DW$166, DW_AT_name("CLKSRCCTL1")
    3010                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3011                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f)
    3012                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3013                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3014                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3015              
    3016              $C$DW$167       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3018                      .dwattr $C$DW$167, DW_AT_name("CLKSRCCTL2")
    3019                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3020                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3021                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3022                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3023                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3024              
    3025              $C$DW$168       .dwtag  DW_TAG_member
    3026                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    3027                      .dwattr $C$DW$168, DW_AT_name("CLKSRCCTL3")
    3028                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3029                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d)
    3030                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3031                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3033              
    3034              $C$DW$169       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    3036                      .dwattr $C$DW$169, DW_AT_name("SYSPLLCTL1")
    3037                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3038                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    3039                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3040                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3042              
    3043              $C$DW$170       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$170, DW_AT_name("SYSPLLCTL2")
    3046                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3047                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b)
    3048                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3049                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3050                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052              $C$DW$171       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3054                      .dwattr $C$DW$171, DW_AT_name("SYSPLLCTL3")
    3055                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3056                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a)
    3057                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3058                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3059                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061              $C$DW$172       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3063                      .dwattr $C$DW$172, DW_AT_name("SYSPLLMULT")
    3064                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3065                      .dwattr $C$DW$172, DW_AT_bit_offset(0x09)
    3066                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3067                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3068                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3069              
    3070              $C$DW$173       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3072                      .dwattr $C$DW$173, DW_AT_name("AUXPLLCTL1")
    3073                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3074                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08)
    3075                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3076                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3077                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3078              
    3079              $C$DW$174       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3081                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    3082                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    3083                      .dwattr $C$DW$174, DW_AT_bit_offset(0x07)
    3084                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    3085                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3086                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3087              
    3088              $C$DW$175       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3090                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    3091                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    3092                      .dwattr $C$DW$175, DW_AT_bit_offset(0x06)
    3093                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    3094                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3095                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3096              
    3097              $C$DW$176       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3099                      .dwattr $C$DW$176, DW_AT_name("AUXPLLMULT")
    3100                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3101                      .dwattr $C$DW$176, DW_AT_bit_offset(0x05)
    3102                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    3103                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3104                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106              $C$DW$177       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$177, DW_AT_name("SYSCLKDIVSEL")
    3109                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3110                      .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    3111                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    3112                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3113                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3114              
    3115              $C$DW$178       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3117                      .dwattr $C$DW$178, DW_AT_name("AUXCLKDIVSEL")
    3118                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3119                      .dwattr $C$DW$178, DW_AT_bit_offset(0x03)
    3120                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3121                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3123              
    3124              $C$DW$179       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3126                      .dwattr $C$DW$179, DW_AT_name("PERCLKDIVSEL")
    3127                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3128                      .dwattr $C$DW$179, DW_AT_bit_offset(0x02)
    3129                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    3130                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3131                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133              $C$DW$180       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3135                      .dwattr $C$DW$180, DW_AT_name("rsvd3")
    3136                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd3")
    3137                      .dwattr $C$DW$180, DW_AT_bit_offset(0x01)
    3138                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    3139                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3140                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3141              
    3142              $C$DW$181       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3144                      .dwattr $C$DW$181, DW_AT_name("LOSPCP")
    3145                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LOSPCP")
    3146                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    3147                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    3148                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3149                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3150              
    3151              $C$DW$182       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$182, DW_AT_name("rsvd4")
    3154                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd4")
    3155                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    3156                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    3157                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3158                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160                      .dwendtag $C$DW$T$43
    3161              
    3162              
    3163              $C$DW$T$44      .dwtag  DW_TAG_union_type
    3164                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    3165                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3166              $C$DW$183       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    3168                      .dwattr $C$DW$183, DW_AT_name("all")
    3169                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    3170                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3171                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3172              
    3173              $C$DW$184       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$43)
    3175                      .dwattr $C$DW$184, DW_AT_name("bit")
    3176                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    3177                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3178                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3179              
    3180                      .dwendtag $C$DW$T$44
    3181              
    3182              
    3183              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3184                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    3185                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3186              $C$DW$185       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3188                      .dwattr $C$DW$185, DW_AT_name("SEM")
    3189                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SEM")
    3190                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e)
    3191                      .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    3192                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3193                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$186       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3197                      .dwattr $C$DW$186, DW_AT_name("rsvd1")
    3198                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd1")
    3199                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    3200                      .dwattr $C$DW$186, DW_AT_bit_size(0x0e)
    3201                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3203              
    3204              $C$DW$187       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3206                      .dwattr $C$DW$187, DW_AT_name("KEY")
    3207                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_KEY")
    3208                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3209                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    3210                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3211                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3212              
    3213                      .dwendtag $C$DW$T$45
    3214              
    3215              
    3216              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3217                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    3218                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3219              $C$DW$188       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3221                      .dwattr $C$DW$188, DW_AT_name("all")
    3222                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    3223                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3224                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3225              
    3226              $C$DW$189       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$45)
    3228                      .dwattr $C$DW$189, DW_AT_name("bit")
    3229                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    3230                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3231                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3232              
    3233                      .dwendtag $C$DW$T$46
    3234              
    3235              
    3236              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3237                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    3238                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3239              $C$DW$190       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3241                      .dwattr $C$DW$190, DW_AT_name("OSCCLKSRCSEL")
    3242                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    3243                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    3244                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    3245                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3247              
    3248              $C$DW$191       .dwtag  DW_TAG_member
    3249                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3250                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    3251                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    3252                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    3253                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3254                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3255                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3256              
    3257              $C$DW$192       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3259                      .dwattr $C$DW$192, DW_AT_name("INTOSC2OFF")
    3260                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3261                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
    3262                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3263                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3264                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266              $C$DW$193       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3268                      .dwattr $C$DW$193, DW_AT_name("XTALOFF")
    3269                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_XTALOFF")
    3270                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0b)
    3271                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3272                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3273                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3274              
    3275              $C$DW$194       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3277                      .dwattr $C$DW$194, DW_AT_name("WDHALTI")
    3278                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_WDHALTI")
    3279                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0a)
    3280                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3281                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284              $C$DW$195       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3286                      .dwattr $C$DW$195, DW_AT_name("rsvd2")
    3287                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd2")
    3288                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    3289                      .dwattr $C$DW$195, DW_AT_bit_size(0x0a)
    3290                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3292              
    3293              $C$DW$196       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3295                      .dwattr $C$DW$196, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   65

    3296                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd3")
    3297                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    3298                      .dwattr $C$DW$196, DW_AT_bit_size(0x10)
    3299                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3300                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3301              
    3302                      .dwendtag $C$DW$T$47
    3303              
    3304              
    3305              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3306                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    3307                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3308              $C$DW$197       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3310                      .dwattr $C$DW$197, DW_AT_name("all")
    3311                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    3312                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3313                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3314              
    3315              $C$DW$198       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$47)
    3317                      .dwattr $C$DW$198, DW_AT_name("bit")
    3318                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    3319                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3320                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3321              
    3322                      .dwendtag $C$DW$T$48
    3323              
    3324              
    3325              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3326                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    3327                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3328              $C$DW$199       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3330                      .dwattr $C$DW$199, DW_AT_name("AUXOSCCLKSRCSEL")
    3331                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3332                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
    3333                      .dwattr $C$DW$199, DW_AT_bit_size(0x02)
    3334                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3336              
    3337              $C$DW$200       .dwtag  DW_TAG_member
    3338                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3339                      .dwattr $C$DW$200, DW_AT_name("CANABCLKSEL")
    3340                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3341                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0c)
    3342                      .dwattr $C$DW$200, DW_AT_bit_size(0x02)
    3343                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3344                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3345              
    3346              $C$DW$201       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3348                      .dwattr $C$DW$201, DW_AT_name("CANBBCLKSEL")
    3349                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3350                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   66

    3351                      .dwattr $C$DW$201, DW_AT_bit_size(0x02)
    3352                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3354              
    3355              $C$DW$202       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3357                      .dwattr $C$DW$202, DW_AT_name("rsvd1")
    3358                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd1")
    3359                      .dwattr $C$DW$202, DW_AT_bit_offset(0x08)
    3360                      .dwattr $C$DW$202, DW_AT_bit_size(0x02)
    3361                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3362                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3363              
    3364              $C$DW$203       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3366                      .dwattr $C$DW$203, DW_AT_name("rsvd2")
    3367                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd2")
    3368                      .dwattr $C$DW$203, DW_AT_bit_offset(0x06)
    3369                      .dwattr $C$DW$203, DW_AT_bit_size(0x02)
    3370                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373              $C$DW$204       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3375                      .dwattr $C$DW$204, DW_AT_name("rsvd3")
    3376                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3")
    3377                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    3378                      .dwattr $C$DW$204, DW_AT_bit_size(0x06)
    3379                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3380                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3381              
    3382              $C$DW$205       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3384                      .dwattr $C$DW$205, DW_AT_name("rsvd4")
    3385                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd4")
    3386                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00)
    3387                      .dwattr $C$DW$205, DW_AT_bit_size(0x10)
    3388                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3389                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3390              
    3391                      .dwendtag $C$DW$T$49
    3392              
    3393              
    3394              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3395                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3396                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3397              $C$DW$206       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3399                      .dwattr $C$DW$206, DW_AT_name("all")
    3400                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_all")
    3401                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3403              
    3404              $C$DW$207       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$49)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   67

    3406                      .dwattr $C$DW$207, DW_AT_name("bit")
    3407                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_bit")
    3408                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3409                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3410              
    3411                      .dwendtag $C$DW$T$50
    3412              
    3413              
    3414              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3415                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3416                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3417              $C$DW$208       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3419                      .dwattr $C$DW$208, DW_AT_name("XCLKOUTSEL")
    3420                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3421                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d)
    3422                      .dwattr $C$DW$208, DW_AT_bit_size(0x03)
    3423                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3425              
    3426              $C$DW$209       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3428                      .dwattr $C$DW$209, DW_AT_name("rsvd1")
    3429                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd1")
    3430                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00)
    3431                      .dwattr $C$DW$209, DW_AT_bit_size(0x0d)
    3432                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3434              
    3435              $C$DW$210       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3437                      .dwattr $C$DW$210, DW_AT_name("rsvd2")
    3438                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd2")
    3439                      .dwattr $C$DW$210, DW_AT_bit_offset(0x00)
    3440                      .dwattr $C$DW$210, DW_AT_bit_size(0x10)
    3441                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3442                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3443              
    3444                      .dwendtag $C$DW$T$51
    3445              
    3446              
    3447              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3448                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3449                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3450              $C$DW$211       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3452                      .dwattr $C$DW$211, DW_AT_name("all")
    3453                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_all")
    3454                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$212       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$51)
    3459                      .dwattr $C$DW$212, DW_AT_name("bit")
    3460                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   68

    3461                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3462                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464                      .dwendtag $C$DW$T$52
    3465              
    3466              
    3467              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3468                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3469                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3470              $C$DW$213       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$46)
    3472                      .dwattr $C$DW$213, DW_AT_name("CLKSEM")
    3473                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CLKSEM")
    3474                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3476              
    3477              $C$DW$214       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
    3479                      .dwattr $C$DW$214, DW_AT_name("CLKCFGLOCK1")
    3480                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3481                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3482                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3483              
    3484              $C$DW$215       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$53)
    3486                      .dwattr $C$DW$215, DW_AT_name("rsvd1")
    3487                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd1")
    3488                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3489                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3490              
    3491              $C$DW$216       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$48)
    3493                      .dwattr $C$DW$216, DW_AT_name("CLKSRCCTL1")
    3494                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3495                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3496                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3497              
    3498              $C$DW$217       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$50)
    3500                      .dwattr $C$DW$217, DW_AT_name("CLKSRCCTL2")
    3501                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3502                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3503                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3504              
    3505              $C$DW$218       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$52)
    3507                      .dwattr $C$DW$218, DW_AT_name("CLKSRCCTL3")
    3508                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3509                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3510                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3511              
    3512              $C$DW$219       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$284)
    3514                      .dwattr $C$DW$219, DW_AT_name("SYSPLLCTL1")
    3515                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SYSPLLCTL1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   69

    3516                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3517                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3518              
    3519              $C$DW$220       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$53)
    3521                      .dwattr $C$DW$220, DW_AT_name("rsvd2")
    3522                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd2")
    3523                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3524                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3525              
    3526              $C$DW$221       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$286)
    3528                      .dwattr $C$DW$221, DW_AT_name("SYSPLLMULT")
    3529                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3530                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3531                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3532              
    3533              $C$DW$222       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$288)
    3535                      .dwattr $C$DW$222, DW_AT_name("SYSPLLSTS")
    3536                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3537                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3538                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3539              
    3540              $C$DW$223       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$38)
    3542                      .dwattr $C$DW$223, DW_AT_name("AUXPLLCTL1")
    3543                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3544                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3545                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3546              
    3547              $C$DW$224       .dwtag  DW_TAG_member
    3548                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$53)
    3549                      .dwattr $C$DW$224, DW_AT_name("rsvd3")
    3550                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd3")
    3551                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3552                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3553              
    3554              $C$DW$225       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    3556                      .dwattr $C$DW$225, DW_AT_name("AUXPLLMULT")
    3557                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3558                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3559                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3560              
    3561              $C$DW$226       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$42)
    3563                      .dwattr $C$DW$226, DW_AT_name("AUXPLLSTS")
    3564                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3565                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3566                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3567              
    3568              $C$DW$227       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$280)
    3570                      .dwattr $C$DW$227, DW_AT_name("SYSCLKDIVSEL")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   70

    3571                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3572                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3573                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3574              
    3575              $C$DW$228       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$36)
    3577                      .dwattr $C$DW$228, DW_AT_name("AUXCLKDIVSEL")
    3578                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3579                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3580                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3581              
    3582              $C$DW$229       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$236)
    3584                      .dwattr $C$DW$229, DW_AT_name("PERCLKDIVSEL")
    3585                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3586                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3587                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3588              
    3589              $C$DW$230       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$315)
    3591                      .dwattr $C$DW$230, DW_AT_name("XCLKOUTDIVSEL")
    3592                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3593                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3594                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3595              
    3596              $C$DW$231       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    3598                      .dwattr $C$DW$231, DW_AT_name("rsvd4")
    3599                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd4")
    3600                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3601                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3602              
    3603              $C$DW$232       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$194)
    3605                      .dwattr $C$DW$232, DW_AT_name("LOSPCP")
    3606                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_LOSPCP")
    3607                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3608                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3609              
    3610              $C$DW$233       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$200)
    3612                      .dwattr $C$DW$233, DW_AT_name("MCDCR")
    3613                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_MCDCR")
    3614                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3615                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3616              
    3617              $C$DW$234       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$313)
    3619                      .dwattr $C$DW$234, DW_AT_name("X1CNT")
    3620                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_X1CNT")
    3621                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3622                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3623              
    3624                      .dwendtag $C$DW$T$54
    3625              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   71

    3626              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    3627                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$54)
    3628              
    3629              $C$DW$T$365     .dwtag  DW_TAG_volatile_type
    3630                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$235)
    3631              
    3632              
    3633              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3634                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3635                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3636              $C$DW$236       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3638                      .dwattr $C$DW$236, DW_AT_name("RESET")
    3639                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RESET")
    3640                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0f)
    3641                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3642                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3643                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3644              
    3645              $C$DW$237       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3647                      .dwattr $C$DW$237, DW_AT_name("rsvd1")
    3648                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd1")
    3649                      .dwattr $C$DW$237, DW_AT_bit_offset(0x00)
    3650                      .dwattr $C$DW$237, DW_AT_bit_size(0x0f)
    3651                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3652                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3653              
    3654              $C$DW$238       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3656                      .dwattr $C$DW$238, DW_AT_name("KEY")
    3657                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_KEY")
    3658                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    3659                      .dwattr $C$DW$238, DW_AT_bit_size(0x10)
    3660                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3661                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3662              
    3663                      .dwendtag $C$DW$T$55
    3664              
    3665              
    3666              $C$DW$T$56      .dwtag  DW_TAG_union_type
