TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:30 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_PieCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$100)

     104                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 67,column 1,is_stmt,isa 0
     105 0000001d FF69          SPM       #0                    ; [CPU_ALU] 
     106              $C$DW$3 .dwtag  DW_TAG_TI_branch
     107                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
     108                      .dwattr $C$DW$3, DW_AT_TI_return
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    3

     109              
     110 0000001e 0006          LRETR     ; [CPU_ALU] 
     111                      ; return occurs ; [] 
     112                      .dwattr $C$DW$2, DW_AT_TI_end_file("../F2837xD/F2837xD_PieCtrl.c")
     113                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x43)
     114                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     115                      .dwendentry
     116                      .dwendtag $C$DW$2
     117              
     118 0000001f               .sect   ".text"
     119                      .clink
     120                      .global _EnableInterrupts
     121              
     122              $C$DW$4 .dwtag  DW_TAG_subprogram
     123                      .dwattr $C$DW$4, DW_AT_name("EnableInterrupts")
     124                      .dwattr $C$DW$4, DW_AT_low_pc(_EnableInterrupts)
     125                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
     126                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_EnableInterrupts")
     127                      .dwattr $C$DW$4, DW_AT_external
     128                      .dwattr $C$DW$4, DW_AT_TI_begin_file("../F2837xD/F2837xD_PieCtrl.c")
     129                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x48)
     130                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
     131                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
     132                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 73,column 1,is_stmt,address _EnableInterrupts,isa 0
     133              
     134                      .dwfde $C$DW$CIE, _EnableInterrupts
     135              
     136              ;***************************************************************
     137              ;* FNAME: _EnableInterrupts             FR SIZE:   0           *
     138              ;*                                                             *
     139              ;* FUNCTION ENVIRONMENT                                        *
     140              ;*                                                             *
     141              ;* FUNCTION PROPERTIES                                         *
     142              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     143              ;***************************************************************
     144              
     145 0000001f       _EnableInterrupts:
     146                      .dwcfi  cfa_offset, -2
     147                      .dwcfi  save_reg_to_mem, 26, 0
     148                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 77,column 5,is_stmt,isa 0
     149 0000001f 761F!         MOVW      DP,#_PieCtrlRegs      ; [CPU_ARAU] 
         00000020 0000 
     150 00000021 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_ALU] |77| 
         00000022 0001 
     151                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 82,column 2,is_stmt,isa 0
     152 00000023 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_ALU] |82| 
         00000024 FFFF 
     153                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 87,column 5,is_stmt,isa 0
     154 00000025 2910   clrc INTM
     155                      .dwpsn  file "../F2837xD/F2837xD_PieCtrl.c",line 88,column 1,is_stmt,isa 0
     156 00000026 FF69          SPM       #0                    ; [CPU_ALU] 
     157              $C$DW$5 .dwtag  DW_TAG_TI_branch
     158                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     159                      .dwattr $C$DW$5, DW_AT_TI_return
     160              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    4

     161 00000027 0006          LRETR     ; [CPU_ALU] 
     162                      ; return occurs ; [] 
     163                      .dwattr $C$DW$4, DW_AT_TI_end_file("../F2837xD/F2837xD_PieCtrl.c")
     164                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x58)
     165                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     166                      .dwendentry
     167                      .dwendtag $C$DW$4
     168              
     169              ;**************************************************************
     170              ;* UNDEFINED EXTERNAL REFERENCES                              *
     171              ;**************************************************************
     172                      .global _PieCtrlRegs
     173              
     174              ;***************************************************************
     175              ;* TYPE INFORMATION                                            *
     176              ;***************************************************************
     177              
     178              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     179                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     180                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     181              $C$DW$6 .dwtag  DW_TAG_member
     182                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     183                      .dwattr $C$DW$6, DW_AT_name("ACK1")
     184                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_ACK1")
     185                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     186                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     187                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     188                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     189              
     190              $C$DW$7 .dwtag  DW_TAG_member
     191                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     192                      .dwattr $C$DW$7, DW_AT_name("ACK2")
     193                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_ACK2")
     194                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     195                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     196                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     197                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     198              
     199              $C$DW$8 .dwtag  DW_TAG_member
     200                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     201                      .dwattr $C$DW$8, DW_AT_name("ACK3")
     202                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_ACK3")
     203                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     204                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     205                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     206                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     207              
     208              $C$DW$9 .dwtag  DW_TAG_member
     209                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     210                      .dwattr $C$DW$9, DW_AT_name("ACK4")
     211                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_ACK4")
     212                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c)
     213                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     214                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     215                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    5

     216              
     217              $C$DW$10        .dwtag  DW_TAG_member
     218                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     219                      .dwattr $C$DW$10, DW_AT_name("ACK5")
     220                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ACK5")
     221                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     222                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     223                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     224                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     225              
     226              $C$DW$11        .dwtag  DW_TAG_member
     227                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     228                      .dwattr $C$DW$11, DW_AT_name("ACK6")
     229                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_ACK6")
     230                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a)
     231                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     232                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     233                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     234              
     235              $C$DW$12        .dwtag  DW_TAG_member
     236                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     237                      .dwattr $C$DW$12, DW_AT_name("ACK7")
     238                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ACK7")
     239                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09)
     240                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     241                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     242                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     243              
     244              $C$DW$13        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$13, DW_AT_name("ACK8")
     247                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_ACK8")
     248                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     249                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     250                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     252              
     253              $C$DW$14        .dwtag  DW_TAG_member
     254                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     255                      .dwattr $C$DW$14, DW_AT_name("ACK9")
     256                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ACK9")
     257                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
     258                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     259                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     261              
     262              $C$DW$15        .dwtag  DW_TAG_member
     263                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     264                      .dwattr $C$DW$15, DW_AT_name("ACK10")
     265                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ACK10")
     266                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     267                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     268                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     269                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     270              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    6

     271              $C$DW$16        .dwtag  DW_TAG_member
     272                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     273                      .dwattr $C$DW$16, DW_AT_name("ACK11")
     274                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_ACK11")
     275                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     276                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     277                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     279              
     280              $C$DW$17        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     282                      .dwattr $C$DW$17, DW_AT_name("ACK12")
     283                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_ACK12")
     284                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     285                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     286                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     288              
     289              $C$DW$18        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$18, DW_AT_name("rsvd1")
     292                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd1")
     293                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00)
     294                      .dwattr $C$DW$18, DW_AT_bit_size(0x04)
     295                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     297              
     298                      .dwendtag $C$DW$T$20
     299              
     300              
     301              $C$DW$T$21      .dwtag  DW_TAG_union_type
     302                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
     303                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     304              $C$DW$19        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$19, DW_AT_name("all")
     307                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     308                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$20        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     313                      .dwattr $C$DW$20, DW_AT_name("bit")
     314                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     315                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     317              
     318                      .dwendtag $C$DW$T$21
     319              
     320              
     321              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     322                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     323                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     324              $C$DW$21        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    7

     326                      .dwattr $C$DW$21, DW_AT_name("ENPIE")
     327                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ENPIE")
     328                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f)
     329                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     330                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     331                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     332              
     333              $C$DW$22        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$22, DW_AT_name("PIEVECT")
     336                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_PIEVECT")
     337                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     338                      .dwattr $C$DW$22, DW_AT_bit_size(0x0f)
     339                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342                      .dwendtag $C$DW$T$22
     343              
     344              
     345              $C$DW$T$23      .dwtag  DW_TAG_union_type
     346                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     347                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     348              $C$DW$23        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$23, DW_AT_name("all")
     351                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     352                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$24        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     357                      .dwattr $C$DW$24, DW_AT_name("bit")
     358                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     359                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362                      .dwendtag $C$DW$T$23
     363              
     364              
     365              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     366                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
     367                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     368              $C$DW$25        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     370                      .dwattr $C$DW$25, DW_AT_name("INTx1")
     371                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_INTx1")
     372                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     373                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     374                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     376              
     377              $C$DW$26        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$26, DW_AT_name("INTx2")
     380                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_INTx2")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    8

     381                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     382                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     383                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     385              
     386              $C$DW$27        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     388                      .dwattr $C$DW$27, DW_AT_name("INTx3")
     389                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTx3")
     390                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     391                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     392                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     393                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$28        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$28, DW_AT_name("INTx4")
     398                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INTx4")
     399                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     400                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     401                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$29        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$29, DW_AT_name("INTx5")
     407                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_INTx5")
     408                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b)
     409                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     410                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     412              
     413              $C$DW$30        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     415                      .dwattr $C$DW$30, DW_AT_name("INTx6")
     416                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_INTx6")
     417                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a)
     418                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     419                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     421              
     422              $C$DW$31        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$31, DW_AT_name("INTx7")
     425                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_INTx7")
     426                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09)
     427                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     428                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$32        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$32, DW_AT_name("INTx8")
     434                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTx8")
     435                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE    9

     436                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     437                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$33        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$33, DW_AT_name("INTx9")
     443                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_INTx9")
     444                      .dwattr $C$DW$33, DW_AT_bit_offset(0x07)
     445                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     446                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     448              
     449              $C$DW$34        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$34, DW_AT_name("INTx10")
     452                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_INTx10")
     453                      .dwattr $C$DW$34, DW_AT_bit_offset(0x06)
     454                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     455                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$35        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$35, DW_AT_name("INTx11")
     461                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTx11")
     462                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05)
     463                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     464                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$36        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$36, DW_AT_name("INTx12")
     470                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTx12")
     471                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04)
     472                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     473                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476              $C$DW$37        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$37, DW_AT_name("INTx13")
     479                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTx13")
     480                      .dwattr $C$DW$37, DW_AT_bit_offset(0x03)
     481                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     482                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$38        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$38, DW_AT_name("INTx14")
     488                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_INTx14")
     489                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02)
     490                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   10

     491                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$39        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$39, DW_AT_name("INTx15")
     497                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_INTx15")
     498                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01)
     499                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     500                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503              $C$DW$40        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     505                      .dwattr $C$DW$40, DW_AT_name("INTx16")
     506                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_INTx16")
     507                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     508                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     509                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     511              
     512                      .dwendtag $C$DW$T$24
     513              
     514              
     515              $C$DW$T$25      .dwtag  DW_TAG_union_type
     516                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
     517                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     518              $C$DW$41        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$41, DW_AT_name("all")
     521                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     522                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$42        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     527                      .dwattr $C$DW$42, DW_AT_name("bit")
     528                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     529                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532                      .dwendtag $C$DW$T$25
     533              
     534              
     535              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     536                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
     537                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     538              $C$DW$43        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$43, DW_AT_name("INTx1")
     541                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_INTx1")
     542                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
     543                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     544                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   11

     546              
     547              $C$DW$44        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$44, DW_AT_name("INTx2")
     550                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_INTx2")
     551                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
     552                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     553                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556              $C$DW$45        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$45, DW_AT_name("INTx3")
     559                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_INTx3")
     560                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d)
     561                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     562                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$46        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$46, DW_AT_name("INTx4")
     568                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_INTx4")
     569                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c)
     570                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     571                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$47        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$47, DW_AT_name("INTx5")
     577                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_INTx5")
     578                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0b)
     579                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     580                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583              $C$DW$48        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$48, DW_AT_name("INTx6")
     586                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_INTx6")
     587                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0a)
     588                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     589                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     591              
     592              $C$DW$49        .dwtag  DW_TAG_member
     593                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     594                      .dwattr $C$DW$49, DW_AT_name("INTx7")
     595                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_INTx7")
     596                      .dwattr $C$DW$49, DW_AT_bit_offset(0x09)
     597                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     598                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     600              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   12

     601              $C$DW$50        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$50, DW_AT_name("INTx8")
     604                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_INTx8")
     605                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
     606                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     607                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$51        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$51, DW_AT_name("INTx9")
     613                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_INTx9")
     614                      .dwattr $C$DW$51, DW_AT_bit_offset(0x07)
     615                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     616                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     617                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     618              
     619              $C$DW$52        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$52, DW_AT_name("INTx10")
     622                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_INTx10")
     623                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06)
     624                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     625                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     627              
     628              $C$DW$53        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$53, DW_AT_name("INTx11")
     631                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_INTx11")
     632                      .dwattr $C$DW$53, DW_AT_bit_offset(0x05)
     633                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     634                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     635                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     636              
     637              $C$DW$54        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     639                      .dwattr $C$DW$54, DW_AT_name("INTx12")
     640                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_INTx12")
     641                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     642                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     643                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     645              
     646              $C$DW$55        .dwtag  DW_TAG_member
     647                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     648                      .dwattr $C$DW$55, DW_AT_name("INTx13")
     649                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_INTx13")
     650                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03)
     651                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     652                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     654              
     655              $C$DW$56        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   13

     656                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$56, DW_AT_name("INTx14")
     658                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_INTx14")
     659                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
     660                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     661                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     663              
     664              $C$DW$57        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     666                      .dwattr $C$DW$57, DW_AT_name("INTx15")
     667                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_INTx15")
     668                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01)
     669                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     670                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     672              
     673              $C$DW$58        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     675                      .dwattr $C$DW$58, DW_AT_name("INTx16")
     676                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_INTx16")
     677                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
     678                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     679                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     681              
     682                      .dwendtag $C$DW$T$26
     683              
     684              
     685              $C$DW$T$27      .dwtag  DW_TAG_union_type
     686                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
     687                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     688              $C$DW$59        .dwtag  DW_TAG_member
     689                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     690                      .dwattr $C$DW$59, DW_AT_name("all")
     691                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     692                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     693                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     694              
     695              $C$DW$60        .dwtag  DW_TAG_member
     696                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$26)
     697                      .dwattr $C$DW$60, DW_AT_name("bit")
     698                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     699                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     701              
     702                      .dwendtag $C$DW$T$27
     703              
     704              
     705              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     706                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
     707                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     708              $C$DW$61        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$61, DW_AT_name("INTx1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   14

     711                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_INTx1")
     712                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f)
     713                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     714                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     716              
     717              $C$DW$62        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$62, DW_AT_name("INTx2")
     720                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_INTx2")
     721                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e)
     722                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     723                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726              $C$DW$63        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$63, DW_AT_name("INTx3")
     729                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_INTx3")
     730                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d)
     731                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     732                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$64        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$64, DW_AT_name("INTx4")
     738                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_INTx4")
     739                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     740                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     741                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     743              
     744              $C$DW$65        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$65, DW_AT_name("INTx5")
     747                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_INTx5")
     748                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b)
     749                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     752              
     753              $C$DW$66        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     755                      .dwattr $C$DW$66, DW_AT_name("INTx6")
     756                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INTx6")
     757                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a)
     758                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     759                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     761              
     762              $C$DW$67        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$67, DW_AT_name("INTx7")
     765                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_INTx7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   15

     766                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09)
     767                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     768                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     770              
     771              $C$DW$68        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$68, DW_AT_name("INTx8")
     774                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_INTx8")
     775                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08)
     776                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     777                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$69        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$69, DW_AT_name("INTx9")
     783                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_INTx9")
     784                      .dwattr $C$DW$69, DW_AT_bit_offset(0x07)
     785                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     786                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     788              
     789              $C$DW$70        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$70, DW_AT_name("INTx10")
     792                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_INTx10")
     793                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06)
     794                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     795                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     797              
     798              $C$DW$71        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$71, DW_AT_name("INTx11")
     801                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_INTx11")
     802                      .dwattr $C$DW$71, DW_AT_bit_offset(0x05)
     803                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     804                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807              $C$DW$72        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$72, DW_AT_name("INTx12")
     810                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_INTx12")
     811                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
     812                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     813                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$73        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$73, DW_AT_name("INTx13")
     819                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INTx13")
     820                      .dwattr $C$DW$73, DW_AT_bit_offset(0x03)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   16

     821                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$74        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$74, DW_AT_name("INTx14")
     828                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTx14")
     829                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
     830                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$75        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$75, DW_AT_name("INTx15")
     837                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INTx15")
     838                      .dwattr $C$DW$75, DW_AT_bit_offset(0x01)
     839                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     840                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843              $C$DW$76        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$76, DW_AT_name("INTx16")
     846                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_INTx16")
     847                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     848                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     849                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852                      .dwendtag $C$DW$T$28
     853              
     854              
     855              $C$DW$T$29      .dwtag  DW_TAG_union_type
     856                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
     857                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     858              $C$DW$77        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$77, DW_AT_name("all")
     861                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     862                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$78        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$28)
     867                      .dwattr $C$DW$78, DW_AT_name("bit")
     868                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     869                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     871              
     872                      .dwendtag $C$DW$T$29
     873              
     874              
     875              $C$DW$T$30      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   17

     876                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
     877                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     878              $C$DW$79        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$79, DW_AT_name("INTx1")
     881                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTx1")
     882                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f)
     883                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     886              
     887              $C$DW$80        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$80, DW_AT_name("INTx2")
     890                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INTx2")
     891                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e)
     892                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     893                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896              $C$DW$81        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$81, DW_AT_name("INTx3")
     899                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTx3")
     900                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d)
     901                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     902                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     904              
     905              $C$DW$82        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$82, DW_AT_name("INTx4")
     908                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTx4")
     909                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c)
     910                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     911                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     913              
     914              $C$DW$83        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$83, DW_AT_name("INTx5")
     917                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_INTx5")
     918                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b)
     919                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$84        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$84, DW_AT_name("INTx6")
     926                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INTx6")
     927                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a)
     928                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     929                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   18

     931              
     932              $C$DW$85        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     934                      .dwattr $C$DW$85, DW_AT_name("INTx7")
     935                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTx7")
     936                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09)
     937                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     938                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$86        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$86, DW_AT_name("INTx8")
     944                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTx8")
     945                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
     946                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$87        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$87, DW_AT_name("INTx9")
     953                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_INTx9")
     954                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
     955                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     956                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     958              
     959              $C$DW$88        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$88, DW_AT_name("INTx10")
     962                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_INTx10")
     963                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
     964                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     965                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$89        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$89, DW_AT_name("INTx11")
     971                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTx11")
     972                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05)
     973                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$90        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$90, DW_AT_name("INTx12")
     980                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTx12")
     981                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
     982                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     983                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     985              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   19

     986              $C$DW$91        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$91, DW_AT_name("INTx13")
     989                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_INTx13")
     990                      .dwattr $C$DW$91, DW_AT_bit_offset(0x03)
     991                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$92        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$92, DW_AT_name("INTx14")
     998                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_INTx14")
     999                      .dwattr $C$DW$92, DW_AT_bit_offset(0x02)
    1000                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$93        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$93, DW_AT_name("INTx15")
    1007                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_INTx15")
    1008                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    1009                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$94        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$94, DW_AT_name("INTx16")
    1016                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_INTx16")
    1017                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1018                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1019                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022                      .dwendtag $C$DW$T$30
    1023              
    1024              
    1025              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1026                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    1027                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1028              $C$DW$95        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$95, DW_AT_name("all")
    1031                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1032                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$96        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$30)
    1037                      .dwattr $C$DW$96, DW_AT_name("bit")
    1038                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1039                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   20

    1041              
    1042                      .dwendtag $C$DW$T$31
    1043              
    1044              
    1045              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1046                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    1047                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1048              $C$DW$97        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$97, DW_AT_name("INTx1")
    1051                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_INTx1")
    1052                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f)
    1053                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$98        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$98, DW_AT_name("INTx2")
    1060                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx2")
    1061                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e)
    1062                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$99        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$99, DW_AT_name("INTx3")
    1069                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx3")
    1070                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d)
    1071                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1072                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$100       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$100, DW_AT_name("INTx4")
    1078                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx4")
    1079                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c)
    1080                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084              $C$DW$101       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$101, DW_AT_name("INTx5")
    1087                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx5")
    1088                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b)
    1089                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$102       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$102, DW_AT_name("INTx6")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   21

    1096                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx6")
    1097                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a)
    1098                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1099                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$103       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$103, DW_AT_name("INTx7")
    1105                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx7")
    1106                      .dwattr $C$DW$103, DW_AT_bit_offset(0x09)
    1107                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1108                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$104       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$104, DW_AT_name("INTx8")
    1114                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx8")
    1115                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    1116                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$105       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$105, DW_AT_name("INTx9")
    1123                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx9")
    1124                      .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1125                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$106       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$106, DW_AT_name("INTx10")
    1132                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx10")
    1133                      .dwattr $C$DW$106, DW_AT_bit_offset(0x06)
    1134                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1135                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$107       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$107, DW_AT_name("INTx11")
    1141                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx11")
    1142                      .dwattr $C$DW$107, DW_AT_bit_offset(0x05)
    1143                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1144                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147              $C$DW$108       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$108, DW_AT_name("INTx12")
    1150                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx12")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   22

    1151                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04)
    1152                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156              $C$DW$109       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$109, DW_AT_name("INTx13")
    1159                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx13")
    1160                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03)
    1161                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1162                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$110       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$110, DW_AT_name("INTx14")
    1168                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx14")
    1169                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02)
    1170                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1173              
    1174              $C$DW$111       .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$111, DW_AT_name("INTx15")
    1177                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx15")
    1178                      .dwattr $C$DW$111, DW_AT_bit_offset(0x01)
    1179                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1182              
    1183              $C$DW$112       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$112, DW_AT_name("INTx16")
    1186                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx16")
    1187                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1188                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192                      .dwendtag $C$DW$T$32
    1193              
    1194              
    1195              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1196                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    1197                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1198              $C$DW$113       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$113, DW_AT_name("all")
    1201                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1202                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$114       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   23

    1206                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$32)
    1207                      .dwattr $C$DW$114, DW_AT_name("bit")
    1208                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1209                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212                      .dwendtag $C$DW$T$33
    1213              
    1214              
    1215              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1216                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    1217                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1218              $C$DW$115       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$115, DW_AT_name("INTx1")
    1221                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx1")
    1222                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0f)
    1223                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$116       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$116, DW_AT_name("INTx2")
    1230                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx2")
    1231                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e)
    1232                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$117       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$117, DW_AT_name("INTx3")
    1239                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx3")
    1240                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0d)
    1241                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1242                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245              $C$DW$118       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$118, DW_AT_name("INTx4")
    1248                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx4")
    1249                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c)
    1250                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1251                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254              $C$DW$119       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$119, DW_AT_name("INTx5")
    1257                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx5")
    1258                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b)
    1259                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   24

    1261                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$120       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$120, DW_AT_name("INTx6")
    1266                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTx6")
    1267                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a)
    1268                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$121       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$121, DW_AT_name("INTx7")
    1275                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx7")
    1276                      .dwattr $C$DW$121, DW_AT_bit_offset(0x09)
    1277                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1278                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$122       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$122, DW_AT_name("INTx8")
    1284                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx8")
    1285                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08)
    1286                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$123       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$123, DW_AT_name("INTx9")
    1293                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx9")
    1294                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07)
    1295                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1296                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$124       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$124, DW_AT_name("INTx10")
    1302                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx10")
    1303                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06)
    1304                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1305                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$125       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$125, DW_AT_name("INTx11")
    1311                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx11")
    1312                      .dwattr $C$DW$125, DW_AT_bit_offset(0x05)
    1313                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1314                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   25

    1316              
    1317              $C$DW$126       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$126, DW_AT_name("INTx12")
    1320                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_INTx12")
    1321                      .dwattr $C$DW$126, DW_AT_bit_offset(0x04)
    1322                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$127       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$127, DW_AT_name("INTx13")
    1329                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INTx13")
    1330                      .dwattr $C$DW$127, DW_AT_bit_offset(0x03)
    1331                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$128       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$128, DW_AT_name("INTx14")
    1338                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx14")
    1339                      .dwattr $C$DW$128, DW_AT_bit_offset(0x02)
    1340                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1341                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1343              
    1344              $C$DW$129       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$129, DW_AT_name("INTx15")
    1347                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx15")
    1348                      .dwattr $C$DW$129, DW_AT_bit_offset(0x01)
    1349                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$130       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$130, DW_AT_name("INTx16")
    1356                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx16")
    1357                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1358                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362                      .dwendtag $C$DW$T$34
    1363              
    1364              
    1365              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1366                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    1367                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1368              $C$DW$131       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$131, DW_AT_name("all")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   26

    1371                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1372                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$132       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$34)
    1377                      .dwattr $C$DW$132, DW_AT_name("bit")
    1378                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1379                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382                      .dwendtag $C$DW$T$35
    1383              
    1384              
    1385              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1386                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    1387                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1388              $C$DW$133       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$133, DW_AT_name("INTx1")
    1391                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_INTx1")
    1392                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f)
    1393                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1394                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$134       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$134, DW_AT_name("INTx2")
    1400                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx2")
    1401                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e)
    1402                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1403                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$135       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$135, DW_AT_name("INTx3")
    1409                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx3")
    1410                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d)
    1411                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1412                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415              $C$DW$136       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1417                      .dwattr $C$DW$136, DW_AT_name("INTx4")
    1418                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INTx4")
    1419                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c)
    1420                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1421                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1423              
    1424              $C$DW$137       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieCtrl.asm                                                  PAGE   27

    1426                      .dwattr $C$DW$137, DW_AT_name("INTx5")
    1427                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_INTx5")
    1428                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b)
    1429                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1430                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$138       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$138, DW_AT_name("INTx6")
    1436                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_INTx6")
    1437                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a)
    1438                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1439                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$139       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$139, DW_AT_name("INTx7")
    1445                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTx7")
    1446                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09)
    1447                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1448                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$140       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$140, DW_AT_name("INTx8")
    1454                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTx8")
    1455                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1456                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1457                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$141       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$141, DW_AT_name("INTx9")
    1463                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTx9")
    1464                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07)
    1465                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1466                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$142       .dwtag  DW_TAG_member
