TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:31 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_PieVect.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("ADCB4_ISR")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ADCB4_ISR")

    1542                      .global _ADCD4_ISR
    1543                      .global _FLASH_CORRECTABLE_ERROR_ISR
    1544                      .global _RAM_CORRECTABLE_ERROR_ISR
    1545                      .global _CLA_UNDERFLOW_ISR
    1546                      .global _IPC3_ISR
    1547                      .global _IPC2_ISR
    1548                      .global _EPWM10_TZ_ISR
    1549                      .global _EPWM9_TZ_ISR
    1550                      .global _FPU_UNDERFLOW_ISR
    1551                      .global _FPU_OVERFLOW_ISR
    1552                      .global _IPC1_ISR
    1553                      .global _IPC0_ISR
    1554                      .global _EPWM11_TZ_ISR
    1555                      .global _SD1_ISR
    1556                      .global _EPWM12_ISR
    1557                      .global _SPIC_RX_ISR
    1558                      .global _SD2_ISR
    1559                      .global _EPWM9_ISR
    1560                      .global _EPWM12_TZ_ISR
    1561                      .global _EPWM11_ISR
    1562                      .global _EPWM10_ISR
    1563                      .global _ADCB1_ISR
    1564                      .global _ADCA1_ISR
    1565                      .global _XINT1_ISR
    1566                      .global _ADCC1_ISR
    1567                      .global _USER10_ISR
    1568                      .global _USER9_ISR
    1569                      .global _USER12_ISR
    1570                      .global _USER11_ISR
    1571                      .global _XINT2_ISR
    1572                      .global _EPWM3_TZ_ISR
    1573                      .global _EPWM2_TZ_ISR
    1574                      .global _EPWM5_TZ_ISR
    1575                      .global _EPWM4_TZ_ISR
    1576                      .global _TIMER0_ISR
    1577                      .global _ADCD1_ISR
    1578                      .global _EPWM1_TZ_ISR
    1579                      .global _WAKE_ISR
    1580                      .global _RTOS_ISR
    1581                      .global _DATALOG_ISR
    1582                      .global _NMI_ISR
    1583                      .global _EMU_ISR
    1584                      .global _PIE_RESERVED_ISR
    1585                      .global _TIMER2_ISR
    1586                      .global _TIMER1_ISR
    1587                      .global _ILLEGAL_ISR
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   34

    1588                      .global _USER6_ISR
    1589                      .global _USER5_ISR
    1590                      .global _USER8_ISR
    1591                      .global _USER7_ISR
    1592                      .global _USER2_ISR
    1593                      .global _USER1_ISR
    1594                      .global _USER4_ISR
    1595                      .global _USER3_ISR
    1596                      .global _SPIB_RX_ISR
    1597                      .global _SPIA_TX_ISR
    1598                      .global _MCBSPA_RX_ISR
    1599                      .global _SPIB_TX_ISR
    1600                      .global _EQEP2_ISR
    1601                      .global _EQEP1_ISR
    1602                      .global _SPIA_RX_ISR
    1603                      .global _EQEP3_ISR
    1604                      .global _MCBSPA_TX_ISR
    1605                      .global _DMA_CH4_ISR
    1606                      .global _DMA_CH3_ISR
    1607                      .global _DMA_CH6_ISR
    1608                      .global _DMA_CH5_ISR
    1609                      .global _MCBSPB_TX_ISR
    1610                      .global _MCBSPB_RX_ISR
    1611                      .global _DMA_CH2_ISR
    1612                      .global _DMA_CH1_ISR
    1613                      .global _EPWM3_ISR
    1614                      .global _EPWM2_ISR
    1615                      .global _EPWM5_ISR
    1616                      .global _EPWM4_ISR
    1617                      .global _EPWM7_TZ_ISR
    1618                      .global _EPWM6_TZ_ISR
    1619                      .global _EPWM1_ISR
    1620                      .global _EPWM8_TZ_ISR
    1621                      .global _EPWM6_ISR
    1622                      .global _ECAP4_ISR
    1623                      .global _ECAP3_ISR
    1624                      .global _ECAP6_ISR
    1625                      .global _ECAP5_ISR
    1626                      .global _EPWM8_ISR
    1627                      .global _EPWM7_ISR
    1628                      .global _ECAP2_ISR
    1629                      .global _ECAP1_ISR
    1630                      .global _SPIC_TX_ISR
    1631                      .global _PieCtrlRegs
    1632                      .global _PieVectTable
    1633              
    1634              ;***************************************************************
    1635              ;* TYPE INFORMATION                                            *
    1636              ;***************************************************************
    1637              
    1638              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1639                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1640                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1641              $C$DW$148       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   35

    1643                      .dwattr $C$DW$148, DW_AT_name("ACK1")
    1644                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK1")
    1645                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    1646                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1647                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$149       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$149, DW_AT_name("ACK2")
    1653                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK2")
    1654                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    1655                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$150       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$150, DW_AT_name("ACK3")
    1662                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK3")
    1663                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    1664                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1665                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$151       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$151, DW_AT_name("ACK4")
    1671                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK4")
    1672                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    1673                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$152       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$152, DW_AT_name("ACK5")
    1680                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK5")
    1681                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    1682                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$153       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$153, DW_AT_name("ACK6")
    1689                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK6")
    1690                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1691                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1692                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$154       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$154, DW_AT_name("ACK7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   36

    1698                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK7")
    1699                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09)
    1700                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$155       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$155, DW_AT_name("ACK8")
    1707                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK8")
    1708                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08)
    1709                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1710                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1711                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$156       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$156, DW_AT_name("ACK9")
    1716                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK9")
    1717                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    1718                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1719                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1721              
    1722              $C$DW$157       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$157, DW_AT_name("ACK10")
    1725                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK10")
    1726                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06)
    1727                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1728                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$158       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$158, DW_AT_name("ACK11")
    1734                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK11")
    1735                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05)
    1736                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1737                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740              $C$DW$159       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$159, DW_AT_name("ACK12")
    1743                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK12")
    1744                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1745                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1746                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1748              
    1749              $C$DW$160       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1752                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   37

    1753                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1754                      .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    1755                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758                      .dwendtag $C$DW$T$20
    1759              
    1760              
    1761              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1762                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1763                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1764              $C$DW$161       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1766                      .dwattr $C$DW$161, DW_AT_name("all")
    1767                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1768                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1770              
    1771              $C$DW$162       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1773                      .dwattr $C$DW$162, DW_AT_name("bit")
    1774                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1775                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778                      .dwendtag $C$DW$T$21
    1779              
    1780              
    1781              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1782                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1783                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1784              $C$DW$163       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$163, DW_AT_name("ENPIE")
    1787                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ENPIE")
    1788                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    1789                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$164       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$164, DW_AT_name("PIEVECT")
    1796                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEVECT")
    1797                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    1798                      .dwattr $C$DW$164, DW_AT_bit_size(0x0f)
    1799                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802                      .dwendtag $C$DW$T$22
    1803              
    1804              
    1805              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1806                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1807                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   38

    1808              $C$DW$165       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$165, DW_AT_name("all")
    1811                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1812                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$166       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1817                      .dwattr $C$DW$166, DW_AT_name("bit")
    1818                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1819                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822                      .dwendtag $C$DW$T$23
    1823              
    1824              
    1825              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1826                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1827                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1828              $C$DW$167       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$167, DW_AT_name("INTx1")
    1831                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx1")
    1832                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f)
    1833                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$168       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$168, DW_AT_name("INTx2")
    1840                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx2")
    1841                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    1842                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1843                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1845              
    1846              $C$DW$169       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$169, DW_AT_name("INTx3")
    1849                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx3")
    1850                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d)
    1851                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1854              
    1855              $C$DW$170       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$170, DW_AT_name("INTx4")
    1858                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx4")
    1859                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c)
    1860                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1861                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   39

    1863              
    1864              $C$DW$171       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$171, DW_AT_name("INTx5")
    1867                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx5")
    1868                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b)
    1869                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1870                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$172       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$172, DW_AT_name("INTx6")
    1876                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx6")
    1877                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a)
    1878                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1879                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$173       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$173, DW_AT_name("INTx7")
    1885                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx7")
    1886                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09)
    1887                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1888                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$174       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$174, DW_AT_name("INTx8")
    1894                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx8")
    1895                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08)
    1896                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$175       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1902                      .dwattr $C$DW$175, DW_AT_name("INTx9")
    1903                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx9")
    1904                      .dwattr $C$DW$175, DW_AT_bit_offset(0x07)
    1905                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1906                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$176       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$176, DW_AT_name("INTx10")
    1912                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx10")
    1913                      .dwattr $C$DW$176, DW_AT_bit_offset(0x06)
    1914                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1917              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   40

    1918              $C$DW$177       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$177, DW_AT_name("INTx11")
    1921                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx11")
    1922                      .dwattr $C$DW$177, DW_AT_bit_offset(0x05)
    1923                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1924                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1926              
    1927              $C$DW$178       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$178, DW_AT_name("INTx12")
    1930                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx12")
    1931                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    1932                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1933                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936              $C$DW$179       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1938                      .dwattr $C$DW$179, DW_AT_name("INTx13")
    1939                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx13")
    1940                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03)
    1941                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1942                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1944              
    1945              $C$DW$180       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$180, DW_AT_name("INTx14")
    1948                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx14")
    1949                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02)
    1950                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1951                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1953              
    1954              $C$DW$181       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1956                      .dwattr $C$DW$181, DW_AT_name("INTx15")
    1957                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx15")
    1958                      .dwattr $C$DW$181, DW_AT_bit_offset(0x01)
    1959                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    1960                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963              $C$DW$182       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1965                      .dwattr $C$DW$182, DW_AT_name("INTx16")
    1966                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx16")
    1967                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    1968                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    1969                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1971              
    1972                      .dwendtag $C$DW$T$24
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   41

    1973              
    1974              
    1975              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1976                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1977                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1978              $C$DW$183       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$183, DW_AT_name("all")
    1981                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1982                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$184       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    1987                      .dwattr $C$DW$184, DW_AT_name("bit")
    1988                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1989                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992                      .dwendtag $C$DW$T$25
    1993              
    1994              
    1995              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1996                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1997                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1998              $C$DW$185       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2000                      .dwattr $C$DW$185, DW_AT_name("INTx1")
    2001                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx1")
    2002                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    2003                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2004                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2006              
    2007              $C$DW$186       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$186, DW_AT_name("INTx2")
    2010                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx2")
    2011                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2012                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2013                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$187       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$187, DW_AT_name("INTx3")
    2019                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx3")
    2020                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    2021                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2022                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$188       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$188, DW_AT_name("INTx4")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   42

    2028                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx4")
    2029                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2030                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034              $C$DW$189       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$189, DW_AT_name("INTx5")
    2037                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx5")
    2038                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2039                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2040                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2042              
    2043              $C$DW$190       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2045                      .dwattr $C$DW$190, DW_AT_name("INTx6")
    2046                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx6")
    2047                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2048                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2049                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$191       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$191, DW_AT_name("INTx7")
    2055                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx7")
    2056                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2057                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2058                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2059                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$192       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$192, DW_AT_name("INTx8")
    2064                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx8")
    2065                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2066                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2067                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$193       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$193, DW_AT_name("INTx9")
    2073                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx9")
    2074                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2075                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2076                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2078              
    2079              $C$DW$194       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2081                      .dwattr $C$DW$194, DW_AT_name("INTx10")
    2082                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx10")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   43

    2083                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2084                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2085                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2087              
    2088              $C$DW$195       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2090                      .dwattr $C$DW$195, DW_AT_name("INTx11")
    2091                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx11")
    2092                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2093                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2094                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097              $C$DW$196       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2099                      .dwattr $C$DW$196, DW_AT_name("INTx12")
    2100                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx12")
    2101                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2102                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2103                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$197       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2108                      .dwattr $C$DW$197, DW_AT_name("INTx13")
    2109                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx13")
    2110                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2111                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2112                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$198       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2117                      .dwattr $C$DW$198, DW_AT_name("INTx14")
    2118                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx14")
    2119                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2120                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2121                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2123              
    2124              $C$DW$199       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2126                      .dwattr $C$DW$199, DW_AT_name("INTx15")
    2127                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx15")
    2128                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2129                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2130                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2132              
    2133              $C$DW$200       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2135                      .dwattr $C$DW$200, DW_AT_name("INTx16")
    2136                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx16")
    2137                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   44

    2138                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2139                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142                      .dwendtag $C$DW$T$26
    2143              
    2144              
    2145              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2146                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2147                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2148              $C$DW$201       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$201, DW_AT_name("all")
    2151                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    2152                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$202       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    2157                      .dwattr $C$DW$202, DW_AT_name("bit")
    2158                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    2159                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162                      .dwendtag $C$DW$T$27
    2163              
    2164              
    2165              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2166                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2167                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2168              $C$DW$203       .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2170                      .dwattr $C$DW$203, DW_AT_name("INTx1")
    2171                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx1")
    2172                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f)
    2173                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2174                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2176              
    2177              $C$DW$204       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2179                      .dwattr $C$DW$204, DW_AT_name("INTx2")
    2180                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx2")
    2181                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e)
    2182                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2183                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$205       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2188                      .dwattr $C$DW$205, DW_AT_name("INTx3")
    2189                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx3")
    2190                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d)
    2191                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   45

    2193                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2194              
    2195              $C$DW$206       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2197                      .dwattr $C$DW$206, DW_AT_name("INTx4")
    2198                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx4")
    2199                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0c)
    2200                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2201                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2202                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2203              
    2204              $C$DW$207       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2206                      .dwattr $C$DW$207, DW_AT_name("INTx5")
    2207                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx5")
    2208                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0b)
    2209                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2210                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2212              
    2213              $C$DW$208       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$208, DW_AT_name("INTx6")
    2216                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx6")
    2217                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0a)
    2218                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2219                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$209       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$209, DW_AT_name("INTx7")
    2225                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx7")
    2226                      .dwattr $C$DW$209, DW_AT_bit_offset(0x09)
    2227                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2228                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2230              
    2231              $C$DW$210       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2233                      .dwattr $C$DW$210, DW_AT_name("INTx8")
    2234                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx8")
    2235                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08)
    2236                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2237                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$211       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2242                      .dwattr $C$DW$211, DW_AT_name("INTx9")
    2243                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx9")
    2244                      .dwattr $C$DW$211, DW_AT_bit_offset(0x07)
    2245                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2246                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   46

    2248              
    2249              $C$DW$212       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$212, DW_AT_name("INTx10")
    2252                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx10")
    2253                      .dwattr $C$DW$212, DW_AT_bit_offset(0x06)
    2254                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$213       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$213, DW_AT_name("INTx11")
    2261                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx11")
    2262                      .dwattr $C$DW$213, DW_AT_bit_offset(0x05)
    2263                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2264                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$214       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2269                      .dwattr $C$DW$214, DW_AT_name("INTx12")
    2270                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx12")
    2271                      .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
    2272                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2273                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2275              
    2276              $C$DW$215       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2278                      .dwattr $C$DW$215, DW_AT_name("INTx13")
    2279                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx13")
    2280                      .dwattr $C$DW$215, DW_AT_bit_offset(0x03)
    2281                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2282                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2284              
    2285              $C$DW$216       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$216, DW_AT_name("INTx14")
    2288                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx14")
    2289                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02)
    2290                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2291                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$217       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$217, DW_AT_name("INTx15")
    2297                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx15")
    2298                      .dwattr $C$DW$217, DW_AT_bit_offset(0x01)
    2299                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2302              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   47

    2303              $C$DW$218       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2305                      .dwattr $C$DW$218, DW_AT_name("INTx16")
    2306                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx16")
    2307                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2308                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2309                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312                      .dwendtag $C$DW$T$28
    2313              
    2314              
    2315              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2316                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2317                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2318              $C$DW$219       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2320                      .dwattr $C$DW$219, DW_AT_name("all")
    2321                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2322                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$220       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
    2327                      .dwattr $C$DW$220, DW_AT_name("bit")
    2328                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2329                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2331              
    2332                      .dwendtag $C$DW$T$29
    2333              
    2334              
    2335              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2336                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2337                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2338              $C$DW$221       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2340                      .dwattr $C$DW$221, DW_AT_name("INTx1")
    2341                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx1")
    2342                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f)
    2343                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2344                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347              $C$DW$222       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2349                      .dwattr $C$DW$222, DW_AT_name("INTx2")
    2350                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx2")
    2351                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2352                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2353                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2355              
    2356              $C$DW$223       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   48

    2358                      .dwattr $C$DW$223, DW_AT_name("INTx3")
    2359                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx3")
    2360                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2361                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2362                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$224       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$224, DW_AT_name("INTx4")
    2368                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx4")
    2369                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c)
    2370                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2371                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$225       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$225, DW_AT_name("INTx5")
    2377                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx5")
    2378                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0b)
    2379                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2380                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$226       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2385                      .dwattr $C$DW$226, DW_AT_name("INTx6")
    2386                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx6")
    2387                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0a)
    2388                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2389                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$227       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$227, DW_AT_name("INTx7")
    2395                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx7")
    2396                      .dwattr $C$DW$227, DW_AT_bit_offset(0x09)
    2397                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2398                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2399                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$228       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$228, DW_AT_name("INTx8")
    2404                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx8")
    2405                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08)
    2406                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$229       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2412                      .dwattr $C$DW$229, DW_AT_name("INTx9")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   49

    2413                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx9")
    2414                      .dwattr $C$DW$229, DW_AT_bit_offset(0x07)
    2415                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$230       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$230, DW_AT_name("INTx10")
    2422                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx10")
    2423                      .dwattr $C$DW$230, DW_AT_bit_offset(0x06)
    2424                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2425                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2426                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$231       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$231, DW_AT_name("INTx11")
    2431                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx11")
    2432                      .dwattr $C$DW$231, DW_AT_bit_offset(0x05)
    2433                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2434                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2436              
    2437              $C$DW$232       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2439                      .dwattr $C$DW$232, DW_AT_name("INTx12")
    2440                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx12")
    2441                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04)
    2442                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2443                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2445              
    2446              $C$DW$233       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2448                      .dwattr $C$DW$233, DW_AT_name("INTx13")
    2449                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx13")
    2450                      .dwattr $C$DW$233, DW_AT_bit_offset(0x03)
    2451                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2452                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2454              
    2455              $C$DW$234       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2457                      .dwattr $C$DW$234, DW_AT_name("INTx14")
    2458                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx14")
    2459                      .dwattr $C$DW$234, DW_AT_bit_offset(0x02)
    2460                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2461                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$235       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2466                      .dwattr $C$DW$235, DW_AT_name("INTx15")
    2467                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx15")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   50

    2468                      .dwattr $C$DW$235, DW_AT_bit_offset(0x01)
    2469                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2470                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2472              
    2473              $C$DW$236       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2475                      .dwattr $C$DW$236, DW_AT_name("INTx16")
    2476                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx16")
    2477                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    2478                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2479                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2481              
    2482                      .dwendtag $C$DW$T$30
    2483              
    2484              
    2485              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2486                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2487                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2488              $C$DW$237       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2490                      .dwattr $C$DW$237, DW_AT_name("all")
    2491                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    2492                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2494              
    2495              $C$DW$238       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    2497                      .dwattr $C$DW$238, DW_AT_name("bit")
    2498                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    2499                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2501              
    2502                      .dwendtag $C$DW$T$31
    2503              
    2504              
    2505              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2506                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2507                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2508              $C$DW$239       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2510                      .dwattr $C$DW$239, DW_AT_name("INTx1")
    2511                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx1")
    2512                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0f)
    2513                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2514                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$240       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$240, DW_AT_name("INTx2")
    2520                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx2")
    2521                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0e)
    2522                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   51

    2523                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$241       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$241, DW_AT_name("INTx3")
    2529                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx3")
    2530                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0d)
    2531                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535              $C$DW$242       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2537                      .dwattr $C$DW$242, DW_AT_name("INTx4")
    2538                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx4")
    2539                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    2540                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2541                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544              $C$DW$243       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2546                      .dwattr $C$DW$243, DW_AT_name("INTx5")
    2547                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx5")
    2548                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b)
    2549                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2552              
    2553              $C$DW$244       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$244, DW_AT_name("INTx6")
    2556                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx6")
    2557                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a)
    2558                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2559                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2561              
    2562              $C$DW$245       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2564                      .dwattr $C$DW$245, DW_AT_name("INTx7")
    2565                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx7")
    2566                      .dwattr $C$DW$245, DW_AT_bit_offset(0x09)
    2567                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2568                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2569                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2570              
    2571              $C$DW$246       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2573                      .dwattr $C$DW$246, DW_AT_name("INTx8")
    2574                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx8")
    2575                      .dwattr $C$DW$246, DW_AT_bit_offset(0x08)
    2576                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2577                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   52

    2578                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2579              
    2580              $C$DW$247       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2582                      .dwattr $C$DW$247, DW_AT_name("INTx9")
    2583                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx9")
    2584                      .dwattr $C$DW$247, DW_AT_bit_offset(0x07)
    2585                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2586                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2588              
    2589              $C$DW$248       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2591                      .dwattr $C$DW$248, DW_AT_name("INTx10")
    2592                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx10")
    2593                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    2594                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2595                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2597              
    2598              $C$DW$249       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2600                      .dwattr $C$DW$249, DW_AT_name("INTx11")
    2601                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx11")
    2602                      .dwattr $C$DW$249, DW_AT_bit_offset(0x05)
    2603                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2604                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607              $C$DW$250       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2609                      .dwattr $C$DW$250, DW_AT_name("INTx12")
    2610                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx12")
    2611                      .dwattr $C$DW$250, DW_AT_bit_offset(0x04)
    2612                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2613                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2615              
    2616              $C$DW$251       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2618                      .dwattr $C$DW$251, DW_AT_name("INTx13")
    2619                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx13")
    2620                      .dwattr $C$DW$251, DW_AT_bit_offset(0x03)
    2621                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2622                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2623                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2624              
    2625              $C$DW$252       .dwtag  DW_TAG_member
    2626                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2627                      .dwattr $C$DW$252, DW_AT_name("INTx14")
    2628                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx14")
    2629                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    2630                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    2631                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2632                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   53

    2633              
    2634              $C$DW$253       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2636                      .dwattr $C$DW$253, DW_AT_name("INTx15")
    2637                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx15")
    2638                      .dwattr $C$DW$253, DW_AT_bit_offset(0x01)
    2639                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2640                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2642              
    2643              $C$DW$254       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2645                      .dwattr $C$DW$254, DW_AT_name("INTx16")
    2646                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx16")
    2647                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00)
    2648                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2649                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2650                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2651              
    2652                      .dwendtag $C$DW$T$32
    2653              
    2654              
    2655              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2656                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2657                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2658              $C$DW$255       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2660                      .dwattr $C$DW$255, DW_AT_name("all")
    2661                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_all")
    2662                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2664              
    2665              $C$DW$256       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$32)
    2667                      .dwattr $C$DW$256, DW_AT_name("bit")
    2668                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_bit")
    2669                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2671              
    2672                      .dwendtag $C$DW$T$33
    2673              
    2674              
    2675              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2676                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2677                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2678              $C$DW$257       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2680                      .dwattr $C$DW$257, DW_AT_name("INTx1")
    2681                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx1")
    2682                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0f)
    2683                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2684                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2686              
    2687              $C$DW$258       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   54

    2688                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2689                      .dwattr $C$DW$258, DW_AT_name("INTx2")
    2690                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx2")
    2691                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0e)
    2692                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$259       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2698                      .dwattr $C$DW$259, DW_AT_name("INTx3")
    2699                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx3")
    2700                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    2701                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2702                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2704              
    2705              $C$DW$260       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2707                      .dwattr $C$DW$260, DW_AT_name("INTx4")
    2708                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx4")
    2709                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
    2710                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2711                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714              $C$DW$261       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2716                      .dwattr $C$DW$261, DW_AT_name("INTx5")
    2717                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx5")
    2718                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0b)
    2719                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2720                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2722              
    2723              $C$DW$262       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$262, DW_AT_name("INTx6")
    2726                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx6")
    2727                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0a)
    2728                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2729                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$263       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2734                      .dwattr $C$DW$263, DW_AT_name("INTx7")
    2735                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx7")
    2736                      .dwattr $C$DW$263, DW_AT_bit_offset(0x09)
    2737                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2738                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2740              
    2741              $C$DW$264       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   55

    2743                      .dwattr $C$DW$264, DW_AT_name("INTx8")
    2744                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx8")
    2745                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08)
    2746                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2747                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750              $C$DW$265       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2752                      .dwattr $C$DW$265, DW_AT_name("INTx9")
    2753                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx9")
    2754                      .dwattr $C$DW$265, DW_AT_bit_offset(0x07)
    2755                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2756                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2758              
    2759              $C$DW$266       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$266, DW_AT_name("INTx10")
    2762                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx10")
    2763                      .dwattr $C$DW$266, DW_AT_bit_offset(0x06)
    2764                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2765                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$267       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$267, DW_AT_name("INTx11")
    2771                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx11")
    2772                      .dwattr $C$DW$267, DW_AT_bit_offset(0x05)
    2773                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777              $C$DW$268       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$268, DW_AT_name("INTx12")
    2780                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx12")
    2781                      .dwattr $C$DW$268, DW_AT_bit_offset(0x04)
    2782                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2783                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786              $C$DW$269       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2788                      .dwattr $C$DW$269, DW_AT_name("INTx13")
    2789                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx13")
    2790                      .dwattr $C$DW$269, DW_AT_bit_offset(0x03)
    2791                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2792                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2793                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795              $C$DW$270       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2797                      .dwattr $C$DW$270, DW_AT_name("INTx14")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   56

    2798                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx14")
    2799                      .dwattr $C$DW$270, DW_AT_bit_offset(0x02)
    2800                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    2801                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2802                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2803              
    2804              $C$DW$271       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2806                      .dwattr $C$DW$271, DW_AT_name("INTx15")
    2807                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx15")
    2808                      .dwattr $C$DW$271, DW_AT_bit_offset(0x01)
    2809                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2810                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2812              
    2813              $C$DW$272       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2815                      .dwattr $C$DW$272, DW_AT_name("INTx16")
    2816                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx16")
    2817                      .dwattr $C$DW$272, DW_AT_bit_offset(0x00)
    2818                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2819                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2820                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2821              
    2822                      .dwendtag $C$DW$T$34
    2823              
    2824              
    2825              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2826                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2827                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2828              $C$DW$273       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2830                      .dwattr $C$DW$273, DW_AT_name("all")
    2831                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_all")
    2832                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2834              
    2835              $C$DW$274       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    2837                      .dwattr $C$DW$274, DW_AT_name("bit")
    2838                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_bit")
    2839                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2841              
    2842                      .dwendtag $C$DW$T$35
    2843              
    2844              
    2845              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2846                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2847                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2848              $C$DW$275       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$275, DW_AT_name("INTx1")
    2851                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx1")
    2852                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   57

    2853                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2854                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2856              
    2857              $C$DW$276       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2859                      .dwattr $C$DW$276, DW_AT_name("INTx2")
    2860                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx2")
    2861                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e)
    2862                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2863                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$277       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$277, DW_AT_name("INTx3")
    2869                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx3")
    2870                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d)
    2871                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2872                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875              $C$DW$278       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2877                      .dwattr $C$DW$278, DW_AT_name("INTx4")
    2878                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx4")
    2879                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c)
    2880                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    2881                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2883              
    2884              $C$DW$279       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$279, DW_AT_name("INTx5")
    2887                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx5")
    2888                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b)
    2889                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    2890                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893              $C$DW$280       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2895                      .dwattr $C$DW$280, DW_AT_name("INTx6")
    2896                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx6")
    2897                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a)
    2898                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    2899                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2900                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902              $C$DW$281       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2904                      .dwattr $C$DW$281, DW_AT_name("INTx7")
    2905                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx7")
    2906                      .dwattr $C$DW$281, DW_AT_bit_offset(0x09)
    2907                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   58

    2908                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$282       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    2913                      .dwattr $C$DW$282, DW_AT_name("INTx8")
    2914                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INTx8")
    2915                      .dwattr $C$DW$282, DW_AT_bit_offset(0x08)
    2916                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    2917                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2919              
    2920              $C$DW$283       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    2922                      .dwattr $C$DW$283, DW_AT_name("INTx9")
