TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:25 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Gpio.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_InputXbarRegs")

    1661                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$92, DW_AT_location[DW_OP_breg20 -5]
    1663              
    1664              $C$DW$93        .dwtag  DW_TAG_variable
    1665                      .dwattr $C$DW$93, DW_AT_name("outVal")
    1666                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_outVal")
    1667                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1668                      .dwattr $C$DW$93, DW_AT_location[DW_OP_breg20 -6]
    1669              
    1670 00000227 9746          MOV       *-SP[6],AH            ; [CPU_ALU] |458| 
    1671 00000228 9645          MOV       *-SP[5],AL            ; [CPU_ALU] |458| 
    1672                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 462,column 5,is_stmt,isa 0
    1673 00000229 FFC4          LSR       AL,5                  ; [CPU_ALU] |462| 
    1674 0000022a 2901          CLRC      SXM                   ; [CPU_FPU] 
    1675 0000022b 8F00!         MOVL      XAR4,#_GpioDataRegs   ; [CPU_ARAU] |462| 
         0000022c 0000 
    1676 0000022d FF81          LSL       AL,2                  ; [CPU_ALU] |462| 
    1677 0000022e 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |462| 
         0000022f 01A9 
    1678 00000230 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |462| 
         00000231 00A4 
    1679 00000232 A842          MOVL      *-SP[2],XAR4          ; [CPU_ALU] |462| 
    1680                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 463,column 5,is_stmt,isa 0
    1681 00000233 0201          MOVB      ACC,#1                ; [CPU_ALU] |463| 
    1682 00000234 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |463| 
    1683 00000235 9245          MOV       AL,*-SP[5]            ; [CPU_ALU] |463| 
    1684 00000236 901F          ANDB      AL,#0x1f              ; [CPU_ALU] |463| 
    1685 00000237 2DA9          MOV       T,AL                  ; [CPU_ALU] |463| 
    1686 00000238 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |463| 
    1687 00000239 563B          LSLL      ACC,T                 ; [CPU_ALU] |463| 
    1688 0000023a 1E44          MOVL      *-SP[4],ACC           ; [CPU_ALU] |463| 
    1689                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 465,column 5,is_stmt,isa 0
    1690 0000023b 9246          MOV       AL,*-SP[6]            ; [CPU_ALU] |465| 
    1691 0000023c 6004          B         $C$L21,NEQ            ; [CPU_ALU] |465| 
    1692                      ; branchcc occurs ; [] |465| 
    1693                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 467,column 9,is_stmt,isa 0
    1694 0000023d 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |467| 
    1695 0000023e 1EE4          MOVL      *+XAR4[4],ACC         ; [CPU_ALU] |467| 
    1696                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 468,column 5,is_stmt,isa 0
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   33

    1697 0000023f 6F03          B         $C$L22,UNC            ; [CPU_ALU] |468| 
    1698                      ; branch occurs ; [] |468| 
    1699 00000240       $C$L21:    
    1700                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 471,column 9,is_stmt,isa 0
    1701 00000240 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |471| 
    1702 00000241 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |471| 
    1703                      .dwpsn  file "../F2837xD/F2837xD_Gpio.c",line 473,column 1,is_stmt,isa 0
    1704 00000242       $C$L22:    
    1705 00000242 FE86          SUBB      SP,#6                 ; [CPU_ARAU] 
    1706                      .dwcfi  cfa_offset, -2
    1707              $C$DW$94        .dwtag  DW_TAG_TI_branch
    1708                      .dwattr $C$DW$94, DW_AT_low_pc(0x00)
    1709                      .dwattr $C$DW$94, DW_AT_TI_return
    1710              
    1711 00000243 0006          LRETR     ; [CPU_ALU] 
    1712                      ; return occurs ; [] 
    1713                      .dwattr $C$DW$87, DW_AT_TI_end_file("../F2837xD/F2837xD_Gpio.c")
    1714                      .dwattr $C$DW$87, DW_AT_TI_end_line(0x1d9)
    1715                      .dwattr $C$DW$87, DW_AT_TI_end_column(0x01)
    1716                      .dwendentry
    1717                      .dwendtag $C$DW$87
    1718              
    1719              ;**************************************************************
    1720              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1721              ;**************************************************************
    1722                      .global _InputXbarRegs
    1723                      .global _GpioDataRegs
    1724                      .global _DevCfgRegs
    1725                      .global _GpioCtrlRegs
    1726              
    1727              ;***************************************************************
    1728              ;* TYPE INFORMATION                                            *
    1729              ;***************************************************************
    1730              
    1731              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1732                      .dwattr $C$DW$T$20, DW_AT_name("CPU2RESCTL_BITS")
    1733                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1734              $C$DW$95        .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$95, DW_AT_name("RESET")
    1737                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RESET")
    1738                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
    1739                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$96        .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1746                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1747                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1748                      .dwattr $C$DW$96, DW_AT_bit_size(0x0f)
    1749                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1751              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   34

    1752              $C$DW$97        .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$97, DW_AT_name("KEY")
    1755                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_KEY")
    1756                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1757                      .dwattr $C$DW$97, DW_AT_bit_size(0x10)
    1758                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1759                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761                      .dwendtag $C$DW$T$20
    1762              
    1763              
    1764              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1765                      .dwattr $C$DW$T$22, DW_AT_name("CPU2RESCTL_REG")
    1766                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1767              $C$DW$98        .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1769                      .dwattr $C$DW$98, DW_AT_name("all")
    1770                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1771                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$99        .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1776                      .dwattr $C$DW$99, DW_AT_name("bit")
    1777                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1778                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781                      .dwendtag $C$DW$T$22
    1782              
    1783              
    1784              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1785                      .dwattr $C$DW$T$23, DW_AT_name("CPUSEL0_BITS")
    1786                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1787              $C$DW$100       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$100, DW_AT_name("EPWM1")
    1790                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_EPWM1")
    1791                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f)
    1792                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$101       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$101, DW_AT_name("EPWM2")
    1799                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_EPWM2")
    1800                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e)
    1801                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1802                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$102       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   35

    1807                      .dwattr $C$DW$102, DW_AT_name("EPWM3")
    1808                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_EPWM3")
    1809                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d)
    1810                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$103       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$103, DW_AT_name("EPWM4")
    1817                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_EPWM4")
    1818                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c)
    1819                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$104       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$104, DW_AT_name("EPWM5")
    1826                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_EPWM5")
    1827                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b)
    1828                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$105       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$105, DW_AT_name("EPWM6")
    1835                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_EPWM6")
    1836                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a)
    1837                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1838                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$106       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$106, DW_AT_name("EPWM7")
    1844                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_EPWM7")
    1845                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09)
    1846                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$107       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$107, DW_AT_name("EPWM8")
    1853                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_EPWM8")
    1854                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    1855                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$108       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$108, DW_AT_name("EPWM9")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   36

    1862                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_EPWM9")
    1863                      .dwattr $C$DW$108, DW_AT_bit_offset(0x07)
    1864                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1865                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$109       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$109, DW_AT_name("EPWM10")
    1871                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_EPWM10")
    1872                      .dwattr $C$DW$109, DW_AT_bit_offset(0x06)
    1873                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1874                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1876              
    1877              $C$DW$110       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$110, DW_AT_name("EPWM11")
    1880                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_EPWM11")
    1881                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    1882                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$111       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$111, DW_AT_name("EPWM12")
    1889                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_EPWM12")
    1890                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04)
    1891                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1894              
    1895              $C$DW$112       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    1898                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    1899                      .dwattr $C$DW$112, DW_AT_bit_offset(0x03)
    1900                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$113       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1907                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1908                      .dwattr $C$DW$113, DW_AT_bit_offset(0x02)
    1909                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$114       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$114, DW_AT_name("rsvd3")
    1916                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   37

    1917                      .dwattr $C$DW$114, DW_AT_bit_offset(0x01)
    1918                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$115       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$115, DW_AT_name("rsvd4")
    1925                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd4")
    1926                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1927                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$116       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$116, DW_AT_name("rsvd5")
    1934                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd5")
    1935                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1936                      .dwattr $C$DW$116, DW_AT_bit_size(0x10)
    1937                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1938                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940                      .dwendtag $C$DW$T$23
    1941              
    1942              
    1943              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1944                      .dwattr $C$DW$T$24, DW_AT_name("CPUSEL0_REG")
    1945                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1946              $C$DW$117       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1948                      .dwattr $C$DW$117, DW_AT_name("all")
    1949                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1950                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953              $C$DW$118       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$23)
    1955                      .dwattr $C$DW$118, DW_AT_name("bit")
    1956                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1957                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960                      .dwendtag $C$DW$T$24
    1961              
    1962              
    1963              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1964                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL11_BITS")
    1965                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1966              $C$DW$119       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1968                      .dwattr $C$DW$119, DW_AT_name("ADC_A")
    1969                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ADC_A")
    1970                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f)
    1971                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   38

    1972                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1974              
    1975              $C$DW$120       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1977                      .dwattr $C$DW$120, DW_AT_name("ADC_B")
    1978                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ADC_B")
    1979                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e)
    1980                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1981                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1983              
    1984              $C$DW$121       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1986                      .dwattr $C$DW$121, DW_AT_name("ADC_C")
    1987                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADC_C")
    1988                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d)
    1989                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1990                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$122       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1995                      .dwattr $C$DW$122, DW_AT_name("ADC_D")
    1996                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADC_D")
    1997                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    1998                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1999                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2001              
    2002              $C$DW$123       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2004                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    2005                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    2006                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2007                      .dwattr $C$DW$123, DW_AT_bit_size(0x0c)
    2008                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2010              
    2011              $C$DW$124       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2013                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    2014                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    2015                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2016                      .dwattr $C$DW$124, DW_AT_bit_size(0x10)
    2017                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2018                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2019              
    2020                      .dwendtag $C$DW$T$25
    2021              
    2022              
    2023              $C$DW$T$26      .dwtag  DW_TAG_union_type
    2024                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL11_REG")
    2025                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2026              $C$DW$125       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   39

    2027                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    2028                      .dwattr $C$DW$125, DW_AT_name("all")
    2029                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    2030                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$126       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    2035                      .dwattr $C$DW$126, DW_AT_name("bit")
    2036                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    2037                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040                      .dwendtag $C$DW$T$26
    2041              
    2042              
    2043              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2044                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL12_BITS")
    2045                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2046              $C$DW$127       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2048                      .dwattr $C$DW$127, DW_AT_name("CMPSS1")
    2049                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CMPSS1")
    2050                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f)
    2051                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2052                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$128       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2057                      .dwattr $C$DW$128, DW_AT_name("CMPSS2")
    2058                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CMPSS2")
    2059                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e)
    2060                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2061                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2063              
    2064              $C$DW$129       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2066                      .dwattr $C$DW$129, DW_AT_name("CMPSS3")
    2067                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CMPSS3")
    2068                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0d)
    2069                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2070                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2071                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2072              
    2073              $C$DW$130       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2075                      .dwattr $C$DW$130, DW_AT_name("CMPSS4")
    2076                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CMPSS4")
    2077                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0c)
    2078                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2079                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2081              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   40

    2082              $C$DW$131       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2084                      .dwattr $C$DW$131, DW_AT_name("CMPSS5")
    2085                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CMPSS5")
    2086                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0b)
    2087                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2088                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$132       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2093                      .dwattr $C$DW$132, DW_AT_name("CMPSS6")
    2094                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CMPSS6")
    2095                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a)
    2096                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2097                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2098                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2099              
    2100              $C$DW$133       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2102                      .dwattr $C$DW$133, DW_AT_name("CMPSS7")
    2103                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_CMPSS7")
    2104                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
    2105                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2106                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2108              
    2109              $C$DW$134       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2111                      .dwattr $C$DW$134, DW_AT_name("CMPSS8")
    2112                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_CMPSS8")
    2113                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    2114                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2115                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2117              
    2118              $C$DW$135       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2120                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    2121                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    2122                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2123                      .dwattr $C$DW$135, DW_AT_bit_size(0x08)
    2124                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2126              
    2127              $C$DW$136       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2129                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2130                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2131                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2132                      .dwattr $C$DW$136, DW_AT_bit_size(0x10)
    2133                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2134                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2135              
    2136                      .dwendtag $C$DW$T$27
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   41

    2137              
    2138              
    2139              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2140                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL12_REG")
    2141                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2142              $C$DW$137       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    2144                      .dwattr $C$DW$137, DW_AT_name("all")
    2145                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    2146                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149              $C$DW$138       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2151                      .dwattr $C$DW$138, DW_AT_name("bit")
    2152                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    2153                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156                      .dwendtag $C$DW$T$28
    2157              
    2158              
    2159              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2160                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL14_BITS")
    2161                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2162              $C$DW$139       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2164                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    2165                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    2166                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f)
    2167                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2168                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2169                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2170              
    2171              $C$DW$140       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$140, DW_AT_name("rsvd2")
    2174                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd2")
    2175                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    2176                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2177                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2179              
    2180              $C$DW$141       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$141, DW_AT_name("rsvd3")
    2183                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd3")
    2184                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    2185                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2186                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2188              
    2189              $C$DW$142       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2191                      .dwattr $C$DW$142, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   42

    2192                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd4")
    2193                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c)
    2194                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2195                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2197              
    2198              $C$DW$143       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2200                      .dwattr $C$DW$143, DW_AT_name("rsvd5")
    2201                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd5")
    2202                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2203                      .dwattr $C$DW$143, DW_AT_bit_size(0x0c)
    2204                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2206              
    2207              $C$DW$144       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2209                      .dwattr $C$DW$144, DW_AT_name("DAC_A")
    2210                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DAC_A")
    2211                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f)
    2212                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2214                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2215              
    2216              $C$DW$145       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$145, DW_AT_name("DAC_B")
    2219                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_DAC_B")
    2220                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    2221                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2222                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2223                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2224              
    2225              $C$DW$146       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2227                      .dwattr $C$DW$146, DW_AT_name("DAC_C")
    2228                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_DAC_C")
    2229                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0d)
    2230                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2231                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2232                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2233              
    2234              $C$DW$147       .dwtag  DW_TAG_member
    2235                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2236                      .dwattr $C$DW$147, DW_AT_name("rsvd6")
    2237                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd6")
    2238                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0c)
    2239                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2240                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2241                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2242              
    2243              $C$DW$148       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$148, DW_AT_name("rsvd7")
    2246                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   43

    2247                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    2248                      .dwattr $C$DW$148, DW_AT_bit_size(0x0c)
    2249                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2250                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2251              
    2252                      .dwendtag $C$DW$T$29
    2253              
    2254              
    2255              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2256                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL14_REG")
    2257                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2258              $C$DW$149       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    2260                      .dwattr $C$DW$149, DW_AT_name("all")
    2261                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    2262                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265              $C$DW$150       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    2267                      .dwattr $C$DW$150, DW_AT_name("bit")
    2268                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    2269                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272                      .dwendtag $C$DW$T$30
    2273              
    2274              
    2275              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2276                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL1_BITS")
    2277                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2278              $C$DW$151       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2280                      .dwattr $C$DW$151, DW_AT_name("ECAP1")
    2281                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ECAP1")
    2282                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0f)
    2283                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2284                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2286              
    2287              $C$DW$152       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2289                      .dwattr $C$DW$152, DW_AT_name("ECAP2")
    2290                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ECAP2")
    2291                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e)
    2292                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2293                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2295              
    2296              $C$DW$153       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2298                      .dwattr $C$DW$153, DW_AT_name("ECAP3")
    2299                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ECAP3")
    2300                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0d)
    2301                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   44

    2302                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2304              
    2305              $C$DW$154       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2307                      .dwattr $C$DW$154, DW_AT_name("ECAP4")
    2308                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ECAP4")
    2309                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    2310                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2311                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2312                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2313              
    2314              $C$DW$155       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2316                      .dwattr $C$DW$155, DW_AT_name("ECAP5")
    2317                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ECAP5")
    2318                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b)
    2319                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2320                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2322              
    2323              $C$DW$156       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2325                      .dwattr $C$DW$156, DW_AT_name("ECAP6")
    2326                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ECAP6")
    2327                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a)
    2328                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2329                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2331              
    2332              $C$DW$157       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2334                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    2335                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    2336                      .dwattr $C$DW$157, DW_AT_bit_offset(0x09)
    2337                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2338                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2340              
    2341              $C$DW$158       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2343                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2344                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2345                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    2346                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2347                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2349              
    2350              $C$DW$159       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2352                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2353                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    2354                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    2355                      .dwattr $C$DW$159, DW_AT_bit_size(0x08)
    2356                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   45

    2357                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2358              
    2359              $C$DW$160       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2361                      .dwattr $C$DW$160, DW_AT_name("rsvd4")
    2362                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd4")
    2363                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2364                      .dwattr $C$DW$160, DW_AT_bit_size(0x10)
    2365                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2366                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2367              
    2368                      .dwendtag $C$DW$T$31
    2369              
    2370              
    2371              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2372                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL1_REG")
    2373                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2374              $C$DW$161       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    2376                      .dwattr $C$DW$161, DW_AT_name("all")
    2377                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    2378                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2379                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2380              
    2381              $C$DW$162       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    2383                      .dwattr $C$DW$162, DW_AT_name("bit")
    2384                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    2385                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388                      .dwendtag $C$DW$T$32
    2389              
    2390              
    2391              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2392                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL2_BITS")
    2393                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2394              $C$DW$163       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2396                      .dwattr $C$DW$163, DW_AT_name("EQEP1")
    2397                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_EQEP1")
    2398                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    2399                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2400                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2402              
    2403              $C$DW$164       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2405                      .dwattr $C$DW$164, DW_AT_name("EQEP2")
    2406                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EQEP2")
    2407                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e)
    2408                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2409                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2410                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2411              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   46

    2412              $C$DW$165       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2414                      .dwattr $C$DW$165, DW_AT_name("EQEP3")
    2415                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_EQEP3")
    2416                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d)
    2417                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2418                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2419                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421              $C$DW$166       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2423                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2424                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2425                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c)
    2426                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2427                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2428                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2429              
    2430              $C$DW$167       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2432                      .dwattr $C$DW$167, DW_AT_name("rsvd2")
    2433                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd2")
    2434                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2435                      .dwattr $C$DW$167, DW_AT_bit_size(0x0c)
    2436                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2438              
    2439              $C$DW$168       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2441                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2442                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2443                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2444                      .dwattr $C$DW$168, DW_AT_bit_size(0x10)
    2445                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2446                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2447              
    2448                      .dwendtag $C$DW$T$33
    2449              
    2450              
    2451              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2452                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL2_REG")
    2453                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2454              $C$DW$169       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2456                      .dwattr $C$DW$169, DW_AT_name("all")
    2457                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    2458                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2460              
    2461              $C$DW$170       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$33)
    2463                      .dwattr $C$DW$170, DW_AT_name("bit")
    2464                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    2465                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   47

    2467              
    2468                      .dwendtag $C$DW$T$34
    2469              
    2470              
    2471              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2472                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL4_BITS")
    2473                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2474              $C$DW$171       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$171, DW_AT_name("SD1")
    2477                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SD1")
    2478                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f)
    2479                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2482              
    2483              $C$DW$172       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$172, DW_AT_name("SD2")
    2486                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SD2")
    2487                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2488                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$173       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2494                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    2495                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    2496                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0d)
    2497                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2498                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$174       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$174, DW_AT_name("rsvd2")
    2504                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd2")
    2505                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0c)
    2506                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2507                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510              $C$DW$175       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$175, DW_AT_name("rsvd3")
    2513                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd3")
    2514                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0b)
    2515                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2516                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2518              
    2519              $C$DW$176       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$176, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   48

    2522                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd4")
    2523                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a)
    2524                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2525                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$177       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$177, DW_AT_name("rsvd5")
    2531                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd5")
    2532                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09)
    2533                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$178       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$178, DW_AT_name("rsvd6")
    2540                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd6")
    2541                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08)
    2542                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$179       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$179, DW_AT_name("rsvd7")
    2549                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd7")
    2550                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    2551                      .dwattr $C$DW$179, DW_AT_bit_size(0x08)
    2552                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$180       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$180, DW_AT_name("rsvd8")
    2558                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd8")
    2559                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00)
    2560                      .dwattr $C$DW$180, DW_AT_bit_size(0x10)
    2561                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2562                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564                      .dwendtag $C$DW$T$35
    2565              
    2566              
    2567              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2568                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL4_REG")
    2569                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2570              $C$DW$181       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    2572                      .dwattr $C$DW$181, DW_AT_name("all")
    2573                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_all")
    2574                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2576              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   49

    2577              $C$DW$182       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$35)
    2579                      .dwattr $C$DW$182, DW_AT_name("bit")
    2580                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_bit")
    2581                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2583              
    2584                      .dwendtag $C$DW$T$36
    2585              
    2586              
    2587              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2588                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL5_BITS")
    2589                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2590              $C$DW$183       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2592                      .dwattr $C$DW$183, DW_AT_name("SCI_A")
    2593                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SCI_A")
    2594                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0f)
    2595                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2596                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2598              
    2599              $C$DW$184       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$184, DW_AT_name("SCI_B")
    2602                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SCI_B")
    2603                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0e)
    2604                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2605                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2607              
    2608              $C$DW$185       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$185, DW_AT_name("SCI_C")
    2611                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SCI_C")
    2612                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0d)
    2613                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2614                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$186       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$186, DW_AT_name("SCI_D")
    2620                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_SCI_D")
    2621                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0c)
    2622                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2623                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$187       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$187, DW_AT_name("rsvd1")
    2629                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd1")
    2630                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    2631                      .dwattr $C$DW$187, DW_AT_bit_size(0x0c)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   50

    2632                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$188       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$188, DW_AT_name("rsvd2")
    2638                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd2")
    2639                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    2640                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
    2641                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2642                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644                      .dwendtag $C$DW$T$37
    2645              
    2646              
    2647              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2648                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL5_REG")
    2649                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2650              $C$DW$189       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    2652                      .dwattr $C$DW$189, DW_AT_name("all")
    2653                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    2654                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2655                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2656              
    2657              $C$DW$190       .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$37)
    2659                      .dwattr $C$DW$190, DW_AT_name("bit")
    2660                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    2661                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2662                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2663              
    2664                      .dwendtag $C$DW$T$38
    2665              
    2666              
    2667              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2668                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL6_BITS")
    2669                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2670              $C$DW$191       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2672                      .dwattr $C$DW$191, DW_AT_name("SPI_A")
    2673                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SPI_A")
    2674                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0f)
    2675                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2676                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2678              
    2679              $C$DW$192       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$192, DW_AT_name("SPI_B")
    2682                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SPI_B")
    2683                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0e)
    2684                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2685                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   51

    2687              
    2688              $C$DW$193       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$193, DW_AT_name("SPI_C")
    2691                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SPI_C")
    2692                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0d)
    2693                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$194       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$194, DW_AT_name("rsvd1")
    2700                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd1")
    2701                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0c)
    2702                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2703                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$195       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$195, DW_AT_name("rsvd2")
    2709                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd2")
    2710                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    2711                      .dwattr $C$DW$195, DW_AT_bit_size(0x0c)
    2712                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$196       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$196, DW_AT_name("rsvd3")
    2718                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd3")
    2719                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0f)
    2720                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2722                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$197       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$197, DW_AT_name("rsvd4")
    2727                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd4")
    2728                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0e)
    2729                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2730                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2731                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$198       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$198, DW_AT_name("rsvd5")
    2736                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd5")
    2737                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    2738                      .dwattr $C$DW$198, DW_AT_bit_size(0x0e)
    2739                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2740                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2741              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   52

    2742                      .dwendtag $C$DW$T$39
    2743              
    2744              
    2745              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2746                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL6_REG")
    2747                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2748              $C$DW$199       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2750                      .dwattr $C$DW$199, DW_AT_name("all")
    2751                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_all")
    2752                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755              $C$DW$200       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$39)
    2757                      .dwattr $C$DW$200, DW_AT_name("bit")
    2758                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_bit")
    2759                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2760                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2761              
    2762                      .dwendtag $C$DW$T$40
    2763              
    2764              
    2765              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2766                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL7_BITS")
    2767                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2768              $C$DW$201       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$201, DW_AT_name("I2C_A")
    2771                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_I2C_A")
    2772                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0f)
    2773                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777              $C$DW$202       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$202, DW_AT_name("I2C_B")
    2780                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_I2C_B")
    2781                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0e)
    2782                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2783                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786              $C$DW$203       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2788                      .dwattr $C$DW$203, DW_AT_name("rsvd1")
    2789                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd1")
    2790                      .dwattr $C$DW$203, DW_AT_bit_offset(0x00)
    2791                      .dwattr $C$DW$203, DW_AT_bit_size(0x0e)
    2792                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2793                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795              $C$DW$204       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   53

    2797                      .dwattr $C$DW$204, DW_AT_name("rsvd2")
    2798                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd2")
    2799                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f)
    2800                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2801                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2802                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2803              
    2804              $C$DW$205       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2806                      .dwattr $C$DW$205, DW_AT_name("rsvd3")
    2807                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd3")
    2808                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e)
    2809                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2810                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2811                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2812              
    2813              $C$DW$206       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2815                      .dwattr $C$DW$206, DW_AT_name("rsvd4")
    2816                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd4")
    2817                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    2818                      .dwattr $C$DW$206, DW_AT_bit_size(0x0e)
    2819                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2820                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2821              
    2822                      .dwendtag $C$DW$T$41
    2823              
    2824              
    2825              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2826                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL7_REG")
    2827                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2828              $C$DW$207       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    2830                      .dwattr $C$DW$207, DW_AT_name("all")
    2831                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_all")
    2832                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2834              
    2835              $C$DW$208       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$41)
    2837                      .dwattr $C$DW$208, DW_AT_name("bit")
    2838                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_bit")
    2839                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2841              
    2842                      .dwendtag $C$DW$T$42
    2843              
    2844              
    2845              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2846                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL8_BITS")
    2847                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2848              $C$DW$209       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$209, DW_AT_name("CAN_A")
    2851                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_CAN_A")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   54

    2852                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0f)
    2853                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2854                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2856              
    2857              $C$DW$210       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2859                      .dwattr $C$DW$210, DW_AT_name("CAN_B")
    2860                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CAN_B")
    2861                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0e)
    2862                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2863                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$211       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    2869                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    2870                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0d)
    2871                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2872                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875              $C$DW$212       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2877                      .dwattr $C$DW$212, DW_AT_name("rsvd2")
    2878                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd2")
    2879                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0c)
    2880                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2881                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2883              
    2884              $C$DW$213       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$213, DW_AT_name("rsvd3")
    2887                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd3")
    2888                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    2889                      .dwattr $C$DW$213, DW_AT_bit_size(0x0c)
    2890                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893              $C$DW$214       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2895                      .dwattr $C$DW$214, DW_AT_name("rsvd4")
    2896                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd4")
    2897                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    2898                      .dwattr $C$DW$214, DW_AT_bit_size(0x10)
    2899                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2900                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902                      .dwendtag $C$DW$T$43
    2903              
    2904              
    2905              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2906                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL8_REG")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   55

    2907                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2908              $C$DW$215       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    2910                      .dwattr $C$DW$215, DW_AT_name("all")
    2911                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    2912                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2914              
    2915              $C$DW$216       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$43)
    2917                      .dwattr $C$DW$216, DW_AT_name("bit")
    2918                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
    2919                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922                      .dwendtag $C$DW$T$44
    2923              
    2924              
    2925              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2926                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL9_BITS")
    2927                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2928              $C$DW$217       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2930                      .dwattr $C$DW$217, DW_AT_name("McBSP_A")
    2931                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_McBSP_A")
    2932                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0f)
    2933                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2934                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2936              
    2937              $C$DW$218       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2939                      .dwattr $C$DW$218, DW_AT_name("McBSP_B")
    2940                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_McBSP_B")
    2941                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0e)
    2942                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2943                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2944                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2945              
    2946              $C$DW$219       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2948                      .dwattr $C$DW$219, DW_AT_name("rsvd1")
    2949                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd1")
    2950                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    2951                      .dwattr $C$DW$219, DW_AT_bit_size(0x0e)
    2952                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2954              
    2955              $C$DW$220       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2957                      .dwattr $C$DW$220, DW_AT_name("rsvd2")
    2958                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd2")
    2959                      .dwattr $C$DW$220, DW_AT_bit_offset(0x00)
    2960                      .dwattr $C$DW$220, DW_AT_bit_size(0x10)
    2961                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   56

    2962                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2963              
    2964                      .dwendtag $C$DW$T$45
    2965              
    2966              
    2967              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2968                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL9_REG")
    2969                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2970              $C$DW$221       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    2972                      .dwattr $C$DW$221, DW_AT_name("all")
    2973                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_all")
    2974                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977              $C$DW$222       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$45)
    2979                      .dwattr $C$DW$222, DW_AT_name("bit")
    2980                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_bit")
    2981                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2983              
    2984                      .dwendtag $C$DW$T$46
    2985              
    2986              
    2987              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2988                      .dwattr $C$DW$T$47, DW_AT_name("DC0_BITS")
    2989                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2990              $C$DW$223       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2992                      .dwattr $C$DW$223, DW_AT_name("SINGLE_CORE")
    2993                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_SINGLE_CORE")
    2994                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0f)
    2995                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2996                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2997                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2998              
    2999              $C$DW$224       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3001                      .dwattr $C$DW$224, DW_AT_name("rsvd1")
    3002                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd1")
    3003                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00)
    3004                      .dwattr $C$DW$224, DW_AT_bit_size(0x0f)
    3005                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3006                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008              $C$DW$225       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3010                      .dwattr $C$DW$225, DW_AT_name("rsvd2")
    3011                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd2")
    3012                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00)
    3013                      .dwattr $C$DW$225, DW_AT_bit_size(0x10)
    3014                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3015                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3016              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Gpio.asm                                                     PAGE   57

    3017                      .dwendtag $C$DW$T$47
    3018              
    3019              
    3020              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3021                      .dwattr $C$DW$T$48, DW_AT_name("DC0_REG")
    3022                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3023              $C$DW$226       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    3025                      .dwattr $C$DW$226, DW_AT_name("all")
    3026                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
    3027                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3028                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3029              
    3030              $C$DW$227       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$47)
