TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:21 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Dma.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$127)

    4534              ;***************************************************************
    4535              ;* FNAME: _DMACH6AddrConfig32bit        FR SIZE:   4           *
    4536              ;*                                                             *
    4537              ;* FUNCTION ENVIRONMENT                                        *
    4538              ;*                                                             *
    4539              ;* FUNCTION PROPERTIES                                         *
    4540              ;*                            0 Parameter,  4 Auto,  0 SOE     *
    4541              ;***************************************************************
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   86

    4542              
    4543 000003f4       _DMACH6AddrConfig32bit:
    4544                      .dwcfi  cfa_offset, -2
    4545                      .dwcfi  save_reg_to_mem, 26, 0
    4546 000003f4 FE04          ADDB      SP,#4                 ; [CPU_ARAU] 
    4547                      .dwcfi  cfa_offset, -6
    4548              $C$DW$339       .dwtag  DW_TAG_variable
    4549                      .dwattr $C$DW$339, DW_AT_name("DMA_Dest")
    4550                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_DMA_Dest")
    4551                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$137)
    4552                      .dwattr $C$DW$339, DW_AT_location[DW_OP_breg20 -2]
    4553              
    4554              $C$DW$340       .dwtag  DW_TAG_variable
    4555                      .dwattr $C$DW$340, DW_AT_name("DMA_Source")
    4556                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_DMA_Source")
    4557                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$137)
    4558                      .dwattr $C$DW$340, DW_AT_location[DW_OP_breg20 -4]
    4559              
    4560 000003f5 A044          MOVL      *-SP[4],XAR5          ; [CPU_ALU] |1048| 
    4561 000003f6 A842          MOVL      *-SP[2],XAR4          ; [CPU_ALU] |1048| 
    4562                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1049,column 5,is_stmt,isa 0
    4563 000003f7 7622   EALLOW
    4564                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1054,column 5,is_stmt,isa 0
    4565 000003f8 761F!         MOVW      DP,#_DmaRegs+208      ; [CPU_ARAU] 
         000003f9 0003 
    4566 000003fa 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |1054| 
    4567 000003fb 1E10!         MOVL      @_DmaRegs+208,ACC     ; [CPU_ALU] |1054| 
    4568                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1056,column 5,is_stmt,isa 0
    4569 000003fc 1E12!         MOVL      @_DmaRegs+210,ACC     ; [CPU_ALU] |1056| 
    4570                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1061,column 5,is_stmt,isa 0
    4571 000003fd 0642          MOVL      ACC,*-SP[2]           ; [CPU_ALU] |1061| 
    4572 000003fe 1E18!         MOVL      @_DmaRegs+216,ACC     ; [CPU_ALU] |1061| 
    4573                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1064,column 5,is_stmt,isa 0
    4574 000003ff 1E1A!         MOVL      @_DmaRegs+218,ACC     ; [CPU_ALU] |1064| 
    4575                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1066,column 5,is_stmt,isa 0
    4576 00000400 761A   EDIS
    4577                      .dwpsn  file "../F2837xD/F2837xD_Dma.c",line 1067,column 1,is_stmt,isa 0
    4578 00000401 FF69          SPM       #0                    ; [CPU_ALU] 
    4579 00000402 FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
    4580                      .dwcfi  cfa_offset, -2
    4581              $C$DW$341       .dwtag  DW_TAG_TI_branch
    4582                      .dwattr $C$DW$341, DW_AT_low_pc(0x00)
    4583                      .dwattr $C$DW$341, DW_AT_TI_return
    4584              
    4585 00000403 0006          LRETR     ; [CPU_ALU] 
    4586                      ; return occurs ; [] 
    4587                      .dwattr $C$DW$336, DW_AT_TI_end_file("../F2837xD/F2837xD_Dma.c")
    4588                      .dwattr $C$DW$336, DW_AT_TI_end_line(0x42b)
    4589                      .dwattr $C$DW$336, DW_AT_TI_end_column(0x01)
    4590                      .dwendentry
    4591                      .dwendtag $C$DW$336
    4592              
    4593              ;**************************************************************
    4594              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4595              ;**************************************************************
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   87

    4596                      .global _PieCtrlRegs
    4597                      .global _DmaClaSrcSelRegs
    4598                      .global _DmaRegs
    4599              
    4600              ;***************************************************************
    4601              ;* TYPE INFORMATION                                            *
    4602              ;***************************************************************
    4603              
    4604              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4605                      .dwattr $C$DW$T$20, DW_AT_name("BURST_COUNT_BITS")
    4606                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    4607              $C$DW$342       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    4609                      .dwattr $C$DW$342, DW_AT_name("BURSTCOUNT")
    4610                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_BURSTCOUNT")
    4611                      .dwattr $C$DW$342, DW_AT_bit_offset(0x0b)
    4612                      .dwattr $C$DW$342, DW_AT_bit_size(0x05)
    4613                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4614                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4615              
    4616              $C$DW$343       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    4618                      .dwattr $C$DW$343, DW_AT_name("rsvd1")
    4619                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_rsvd1")
    4620                      .dwattr $C$DW$343, DW_AT_bit_offset(0x00)
    4621                      .dwattr $C$DW$343, DW_AT_bit_size(0x0b)
    4622                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4623                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4624              
    4625                      .dwendtag $C$DW$T$20
    4626              
    4627              
    4628              $C$DW$T$21      .dwtag  DW_TAG_union_type
    4629                      .dwattr $C$DW$T$21, DW_AT_name("BURST_COUNT_REG")
    4630                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    4631              $C$DW$344       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    4633                      .dwattr $C$DW$344, DW_AT_name("all")
    4634                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_all")
    4635                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4636                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$345       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    4640                      .dwattr $C$DW$345, DW_AT_name("bit")
    4641                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_bit")
    4642                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4643                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645                      .dwendtag $C$DW$T$21
    4646              
    4647              
    4648              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4649                      .dwattr $C$DW$T$22, DW_AT_name("BURST_SIZE_BITS")
    4650                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   88

    4651              $C$DW$346       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    4653                      .dwattr $C$DW$346, DW_AT_name("BURSTSIZE")
    4654                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_BURSTSIZE")
    4655                      .dwattr $C$DW$346, DW_AT_bit_offset(0x0b)
    4656                      .dwattr $C$DW$346, DW_AT_bit_size(0x05)
    4657                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4658                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$347       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    4662                      .dwattr $C$DW$347, DW_AT_name("rsvd1")
    4663                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd1")
    4664                      .dwattr $C$DW$347, DW_AT_bit_offset(0x00)
    4665                      .dwattr $C$DW$347, DW_AT_bit_size(0x0b)
    4666                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4667                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4668              
    4669                      .dwendtag $C$DW$T$22
    4670              
    4671              
    4672              $C$DW$T$23      .dwtag  DW_TAG_union_type
    4673                      .dwattr $C$DW$T$23, DW_AT_name("BURST_SIZE_REG")
    4674                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4675              $C$DW$348       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    4677                      .dwattr $C$DW$348, DW_AT_name("all")
    4678                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_all")
    4679                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4680                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4681              
    4682              $C$DW$349       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$22)
    4684                      .dwattr $C$DW$349, DW_AT_name("bit")
    4685                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_bit")
    4686                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4687                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4688              
    4689                      .dwendtag $C$DW$T$23
    4690              
    4691              
    4692              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4693                      .dwattr $C$DW$T$26, DW_AT_name("CH_REGS")
    4694                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    4695              $C$DW$350       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$51)
    4697                      .dwattr $C$DW$350, DW_AT_name("MODE")
    4698                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_MODE")
    4699                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4700                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4701              
    4702              $C$DW$351       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$34)
    4704                      .dwattr $C$DW$351, DW_AT_name("CONTROL")
    4705                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_CONTROL")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   89

    4706                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4707                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4708              
    4709              $C$DW$352       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    4711                      .dwattr $C$DW$352, DW_AT_name("BURST_SIZE")
    4712                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_BURST_SIZE")
    4713                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4714                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4715              
    4716              $C$DW$353       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    4718                      .dwattr $C$DW$353, DW_AT_name("BURST_COUNT")
    4719                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_BURST_COUNT")
    4720                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4721                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4722              
    4723              $C$DW$354       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
    4725                      .dwattr $C$DW$354, DW_AT_name("SRC_BURST_STEP")
    4726                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_SRC_BURST_STEP")
    4727                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4728                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4729              
    4730              $C$DW$355       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$24)
    4732                      .dwattr $C$DW$355, DW_AT_name("DST_BURST_STEP")
    4733                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_DST_BURST_STEP")
    4734                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4735                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4736              
    4737              $C$DW$356       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    4739                      .dwattr $C$DW$356, DW_AT_name("TRANSFER_SIZE")
    4740                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_TRANSFER_SIZE")
    4741                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4742                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4743              
    4744              $C$DW$357       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    4746                      .dwattr $C$DW$357, DW_AT_name("TRANSFER_COUNT")
    4747                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_TRANSFER_COUNT")
    4748                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4749                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4750              
    4751              $C$DW$358       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$24)
    4753                      .dwattr $C$DW$358, DW_AT_name("SRC_TRANSFER_STEP")
    4754                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_SRC_TRANSFER_STEP")
    4755                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4756                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4757              
    4758              $C$DW$359       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$24)
    4760                      .dwattr $C$DW$359, DW_AT_name("DST_TRANSFER_STEP")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   90

    4761                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_DST_TRANSFER_STEP")
    4762                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4763                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4764              
    4765              $C$DW$360       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    4767                      .dwattr $C$DW$360, DW_AT_name("SRC_WRAP_SIZE")
    4768                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_SRC_WRAP_SIZE")
    4769                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4770                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4771              
    4772              $C$DW$361       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    4774                      .dwattr $C$DW$361, DW_AT_name("SRC_WRAP_COUNT")
    4775                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_SRC_WRAP_COUNT")
    4776                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4777                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4778              
    4779              $C$DW$362       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$24)
    4781                      .dwattr $C$DW$362, DW_AT_name("SRC_WRAP_STEP")
    4782                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_SRC_WRAP_STEP")
    4783                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4784                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4785              
    4786              $C$DW$363       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    4788                      .dwattr $C$DW$363, DW_AT_name("DST_WRAP_SIZE")
    4789                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_DST_WRAP_SIZE")
    4790                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4791                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4792              
    4793              $C$DW$364       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    4795                      .dwattr $C$DW$364, DW_AT_name("DST_WRAP_COUNT")
    4796                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_DST_WRAP_COUNT")
    4797                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4798                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4799              
    4800              $C$DW$365       .dwtag  DW_TAG_member
    4801                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$24)
    4802                      .dwattr $C$DW$365, DW_AT_name("DST_WRAP_STEP")
    4803                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_DST_WRAP_STEP")
    4804                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4805                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4806              
    4807              $C$DW$366       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$25)
    4809                      .dwattr $C$DW$366, DW_AT_name("SRC_BEG_ADDR_SHADOW")
    4810                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_SRC_BEG_ADDR_SHADOW")
    4811                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4812                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4813              
    4814              $C$DW$367       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   91

    4816                      .dwattr $C$DW$367, DW_AT_name("SRC_ADDR_SHADOW")
    4817                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_SRC_ADDR_SHADOW")
    4818                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4819                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4820              
    4821              $C$DW$368       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    4823                      .dwattr $C$DW$368, DW_AT_name("SRC_BEG_ADDR_ACTIVE")
    4824                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_SRC_BEG_ADDR_ACTIVE")
    4825                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4826                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4827              
    4828              $C$DW$369       .dwtag  DW_TAG_member
    4829                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$25)
    4830                      .dwattr $C$DW$369, DW_AT_name("SRC_ADDR_ACTIVE")
    4831                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_SRC_ADDR_ACTIVE")
    4832                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4833                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4834              
    4835              $C$DW$370       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    4837                      .dwattr $C$DW$370, DW_AT_name("DST_BEG_ADDR_SHADOW")
    4838                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DST_BEG_ADDR_SHADOW")
    4839                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4840                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4841              
    4842              $C$DW$371       .dwtag  DW_TAG_member
    4843                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    4844                      .dwattr $C$DW$371, DW_AT_name("DST_ADDR_SHADOW")
    4845                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DST_ADDR_SHADOW")
    4846                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4847                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4848              
    4849              $C$DW$372       .dwtag  DW_TAG_member
    4850                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$25)
    4851                      .dwattr $C$DW$372, DW_AT_name("DST_BEG_ADDR_ACTIVE")
    4852                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DST_BEG_ADDR_ACTIVE")
    4853                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4854                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4855              
    4856              $C$DW$373       .dwtag  DW_TAG_member
    4857                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    4858                      .dwattr $C$DW$373, DW_AT_name("DST_ADDR_ACTIVE")
    4859                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DST_ADDR_ACTIVE")
    4860                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4861                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4862              
    4863                      .dwendtag $C$DW$T$26
    4864              
    4865              
    4866              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4867                      .dwattr $C$DW$T$27, DW_AT_name("CLA1TASKSRCSEL1_BITS")
    4868                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    4869              $C$DW$374       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   92

    4871                      .dwattr $C$DW$374, DW_AT_name("TASK1")
    4872                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_TASK1")
    4873                      .dwattr $C$DW$374, DW_AT_bit_offset(0x08)
    4874                      .dwattr $C$DW$374, DW_AT_bit_size(0x08)
    4875                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4876                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4877              
    4878              $C$DW$375       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    4880                      .dwattr $C$DW$375, DW_AT_name("TASK2")
    4881                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_TASK2")
    4882                      .dwattr $C$DW$375, DW_AT_bit_offset(0x00)
    4883                      .dwattr $C$DW$375, DW_AT_bit_size(0x08)
    4884                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4885                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4886              
    4887              $C$DW$376       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    4889                      .dwattr $C$DW$376, DW_AT_name("TASK3")
    4890                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_TASK3")
    4891                      .dwattr $C$DW$376, DW_AT_bit_offset(0x08)
    4892                      .dwattr $C$DW$376, DW_AT_bit_size(0x08)
    4893                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4894                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4895              
    4896              $C$DW$377       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    4898                      .dwattr $C$DW$377, DW_AT_name("TASK4")
    4899                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_TASK4")
    4900                      .dwattr $C$DW$377, DW_AT_bit_offset(0x00)
    4901                      .dwattr $C$DW$377, DW_AT_bit_size(0x08)
    4902                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4903                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4904              
    4905                      .dwendtag $C$DW$T$27
    4906              
    4907              
    4908              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4909                      .dwattr $C$DW$T$28, DW_AT_name("CLA1TASKSRCSEL1_REG")
    4910                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4911              $C$DW$378       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$25)
    4913                      .dwattr $C$DW$378, DW_AT_name("all")
    4914                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_all")
    4915                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4916                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4917              
    4918              $C$DW$379       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$27)
    4920                      .dwattr $C$DW$379, DW_AT_name("bit")
    4921                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_bit")
    4922                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4923                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4924              
    4925                      .dwendtag $C$DW$T$28
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   93

    4926              
    4927              
    4928              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4929                      .dwattr $C$DW$T$29, DW_AT_name("CLA1TASKSRCSEL2_BITS")
    4930                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    4931              $C$DW$380       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    4933                      .dwattr $C$DW$380, DW_AT_name("TASK5")
    4934                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_TASK5")
    4935                      .dwattr $C$DW$380, DW_AT_bit_offset(0x08)
    4936                      .dwattr $C$DW$380, DW_AT_bit_size(0x08)
    4937                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4938                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4939              
    4940              $C$DW$381       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    4942                      .dwattr $C$DW$381, DW_AT_name("TASK6")
    4943                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_TASK6")
    4944                      .dwattr $C$DW$381, DW_AT_bit_offset(0x00)
    4945                      .dwattr $C$DW$381, DW_AT_bit_size(0x08)
    4946                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4947                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4948              
    4949              $C$DW$382       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    4951                      .dwattr $C$DW$382, DW_AT_name("TASK7")
    4952                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_TASK7")
    4953                      .dwattr $C$DW$382, DW_AT_bit_offset(0x08)
    4954                      .dwattr $C$DW$382, DW_AT_bit_size(0x08)
    4955                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4956                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4957              
    4958              $C$DW$383       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    4960                      .dwattr $C$DW$383, DW_AT_name("TASK8")
    4961                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_TASK8")
    4962                      .dwattr $C$DW$383, DW_AT_bit_offset(0x00)
    4963                      .dwattr $C$DW$383, DW_AT_bit_size(0x08)
    4964                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4965                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4966              
    4967                      .dwendtag $C$DW$T$29
    4968              
    4969              
    4970              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4971                      .dwattr $C$DW$T$30, DW_AT_name("CLA1TASKSRCSEL2_REG")
    4972                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    4973              $C$DW$384       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$25)
    4975                      .dwattr $C$DW$384, DW_AT_name("all")
    4976                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_all")
    4977                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4978                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4979              
    4980              $C$DW$385       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   94

    4981                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    4982                      .dwattr $C$DW$385, DW_AT_name("bit")
    4983                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_bit")
    4984                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4985                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4986              
    4987                      .dwendtag $C$DW$T$30
    4988              
    4989              
    4990              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4991                      .dwattr $C$DW$T$31, DW_AT_name("CLA1TASKSRCSELLOCK_BITS")
    4992                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4993              $C$DW$386       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    4995                      .dwattr $C$DW$386, DW_AT_name("CLA1TASKSRCSEL1")
    4996                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL1")
    4997                      .dwattr $C$DW$386, DW_AT_bit_offset(0x0f)
    4998                      .dwattr $C$DW$386, DW_AT_bit_size(0x01)
    4999                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5000                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5001              
    5002              $C$DW$387       .dwtag  DW_TAG_member
    5003                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    5004                      .dwattr $C$DW$387, DW_AT_name("CLA1TASKSRCSEL2")
    5005                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL2")
    5006                      .dwattr $C$DW$387, DW_AT_bit_offset(0x0e)
    5007                      .dwattr $C$DW$387, DW_AT_bit_size(0x01)
    5008                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5009                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5010              
    5011              $C$DW$388       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    5013                      .dwattr $C$DW$388, DW_AT_name("rsvd1")
    5014                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd1")
    5015                      .dwattr $C$DW$388, DW_AT_bit_offset(0x00)
    5016                      .dwattr $C$DW$388, DW_AT_bit_size(0x0e)
    5017                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5018                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5019              
    5020              $C$DW$389       .dwtag  DW_TAG_member
    5021                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    5022                      .dwattr $C$DW$389, DW_AT_name("rsvd2")
    5023                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd2")
    5024                      .dwattr $C$DW$389, DW_AT_bit_offset(0x00)
    5025                      .dwattr $C$DW$389, DW_AT_bit_size(0x10)
    5026                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5027                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5028              
    5029                      .dwendtag $C$DW$T$31
    5030              
    5031              
    5032              $C$DW$T$32      .dwtag  DW_TAG_union_type
    5033                      .dwattr $C$DW$T$32, DW_AT_name("CLA1TASKSRCSELLOCK_REG")
    5034                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5035              $C$DW$390       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   95

    5036                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$25)
    5037                      .dwattr $C$DW$390, DW_AT_name("all")
    5038                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_all")
    5039                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5040                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5041              
    5042              $C$DW$391       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$31)
    5044                      .dwattr $C$DW$391, DW_AT_name("bit")
    5045                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_bit")
    5046                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5047                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5048              
    5049                      .dwendtag $C$DW$T$32
    5050              
    5051              
    5052              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5053                      .dwattr $C$DW$T$33, DW_AT_name("CONTROL_BITS")
    5054                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5055              $C$DW$392       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    5057                      .dwattr $C$DW$392, DW_AT_name("RUN")
    5058                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_RUN")
    5059                      .dwattr $C$DW$392, DW_AT_bit_offset(0x0f)
    5060                      .dwattr $C$DW$392, DW_AT_bit_size(0x01)
    5061                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5062                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5063              
    5064              $C$DW$393       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    5066                      .dwattr $C$DW$393, DW_AT_name("HALT")
    5067                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_HALT")
    5068                      .dwattr $C$DW$393, DW_AT_bit_offset(0x0e)
    5069                      .dwattr $C$DW$393, DW_AT_bit_size(0x01)
    5070                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5071                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5072              
    5073              $C$DW$394       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    5075                      .dwattr $C$DW$394, DW_AT_name("SOFTRESET")
    5076                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_SOFTRESET")
    5077                      .dwattr $C$DW$394, DW_AT_bit_offset(0x0d)
    5078                      .dwattr $C$DW$394, DW_AT_bit_size(0x01)
    5079                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5080                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5081              
    5082              $C$DW$395       .dwtag  DW_TAG_member
    5083                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    5084                      .dwattr $C$DW$395, DW_AT_name("PERINTFRC")
    5085                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_PERINTFRC")
    5086                      .dwattr $C$DW$395, DW_AT_bit_offset(0x0c)
    5087                      .dwattr $C$DW$395, DW_AT_bit_size(0x01)
    5088                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5089                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5090              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   96

    5091              $C$DW$396       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    5093                      .dwattr $C$DW$396, DW_AT_name("PERINTCLR")
    5094                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_PERINTCLR")
    5095                      .dwattr $C$DW$396, DW_AT_bit_offset(0x0b)
    5096                      .dwattr $C$DW$396, DW_AT_bit_size(0x01)
    5097                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5098                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5099              
    5100              $C$DW$397       .dwtag  DW_TAG_member
    5101                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    5102                      .dwattr $C$DW$397, DW_AT_name("rsvd2")
    5103                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd2")
    5104                      .dwattr $C$DW$397, DW_AT_bit_offset(0x09)
    5105                      .dwattr $C$DW$397, DW_AT_bit_size(0x02)
    5106                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5107                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5108              
    5109              $C$DW$398       .dwtag  DW_TAG_member
    5110                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    5111                      .dwattr $C$DW$398, DW_AT_name("ERRCLR")
    5112                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_ERRCLR")
    5113                      .dwattr $C$DW$398, DW_AT_bit_offset(0x08)
    5114                      .dwattr $C$DW$398, DW_AT_bit_size(0x01)
    5115                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5116                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5117              
    5118              $C$DW$399       .dwtag  DW_TAG_member
    5119                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    5120                      .dwattr $C$DW$399, DW_AT_name("PERINTFLG")
    5121                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_PERINTFLG")
    5122                      .dwattr $C$DW$399, DW_AT_bit_offset(0x07)
    5123                      .dwattr $C$DW$399, DW_AT_bit_size(0x01)
    5124                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5125                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5126              
    5127              $C$DW$400       .dwtag  DW_TAG_member
    5128                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    5129                      .dwattr $C$DW$400, DW_AT_name("SYNCFLG")
    5130                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_SYNCFLG")
    5131                      .dwattr $C$DW$400, DW_AT_bit_offset(0x06)
    5132                      .dwattr $C$DW$400, DW_AT_bit_size(0x01)
    5133                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5134                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5135              
    5136              $C$DW$401       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    5138                      .dwattr $C$DW$401, DW_AT_name("SYNCERR")
    5139                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_SYNCERR")
    5140                      .dwattr $C$DW$401, DW_AT_bit_offset(0x05)
    5141                      .dwattr $C$DW$401, DW_AT_bit_size(0x01)
    5142                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5143                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5144              
    5145              $C$DW$402       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   97

    5146                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    5147                      .dwattr $C$DW$402, DW_AT_name("TRANSFERSTS")
    5148                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_TRANSFERSTS")
    5149                      .dwattr $C$DW$402, DW_AT_bit_offset(0x04)
    5150                      .dwattr $C$DW$402, DW_AT_bit_size(0x01)
    5151                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5152                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5153              
    5154              $C$DW$403       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    5156                      .dwattr $C$DW$403, DW_AT_name("BURSTSTS")
    5157                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_BURSTSTS")
    5158                      .dwattr $C$DW$403, DW_AT_bit_offset(0x03)
    5159                      .dwattr $C$DW$403, DW_AT_bit_size(0x01)
    5160                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5161                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5162              
    5163              $C$DW$404       .dwtag  DW_TAG_member
    5164                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    5165                      .dwattr $C$DW$404, DW_AT_name("RUNSTS")
    5166                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_RUNSTS")
    5167                      .dwattr $C$DW$404, DW_AT_bit_offset(0x02)
    5168                      .dwattr $C$DW$404, DW_AT_bit_size(0x01)
    5169                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5170                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5171              
    5172              $C$DW$405       .dwtag  DW_TAG_member
    5173                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    5174                      .dwattr $C$DW$405, DW_AT_name("OVRFLG")
    5175                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_OVRFLG")
    5176                      .dwattr $C$DW$405, DW_AT_bit_offset(0x01)
    5177                      .dwattr $C$DW$405, DW_AT_bit_size(0x01)
    5178                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5179                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5180              
    5181              $C$DW$406       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    5183                      .dwattr $C$DW$406, DW_AT_name("rsvd1")
    5184                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_rsvd1")
    5185                      .dwattr $C$DW$406, DW_AT_bit_offset(0x00)
    5186                      .dwattr $C$DW$406, DW_AT_bit_size(0x01)
    5187                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5188                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5189              
    5190                      .dwendtag $C$DW$T$33
    5191              
    5192              
    5193              $C$DW$T$34      .dwtag  DW_TAG_union_type
    5194                      .dwattr $C$DW$T$34, DW_AT_name("CONTROL_REG")
    5195                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5196              $C$DW$407       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    5198                      .dwattr $C$DW$407, DW_AT_name("all")
    5199                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_all")
    5200                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   98

    5201                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5202              
    5203              $C$DW$408       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$33)
    5205                      .dwattr $C$DW$408, DW_AT_name("bit")
    5206                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_bit")
    5207                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5208                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5209              
    5210                      .dwendtag $C$DW$T$34
    5211              
    5212              
    5213              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5214                      .dwattr $C$DW$T$35, DW_AT_name("DEBUGCTRL_BITS")
    5215                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    5216              $C$DW$409       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    5218                      .dwattr $C$DW$409, DW_AT_name("rsvd1")
    5219                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_rsvd1")
    5220                      .dwattr $C$DW$409, DW_AT_bit_offset(0x01)
    5221                      .dwattr $C$DW$409, DW_AT_bit_size(0x0f)
    5222                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5223                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5224              
    5225              $C$DW$410       .dwtag  DW_TAG_member
    5226                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    5227                      .dwattr $C$DW$410, DW_AT_name("FREE")
    5228                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_FREE")
    5229                      .dwattr $C$DW$410, DW_AT_bit_offset(0x00)
    5230                      .dwattr $C$DW$410, DW_AT_bit_size(0x01)
    5231                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5233              
    5234                      .dwendtag $C$DW$T$35
    5235              
    5236              
    5237              $C$DW$T$36      .dwtag  DW_TAG_union_type
    5238                      .dwattr $C$DW$T$36, DW_AT_name("DEBUGCTRL_REG")
    5239                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5240              $C$DW$411       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    5242                      .dwattr $C$DW$411, DW_AT_name("all")
    5243                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_all")
    5244                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5245                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5246              
    5247              $C$DW$412       .dwtag  DW_TAG_member
    5248                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$35)
    5249                      .dwattr $C$DW$412, DW_AT_name("bit")
    5250                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_bit")
    5251                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5252                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5253              
    5254                      .dwendtag $C$DW$T$36
    5255              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE   99

    5256              
    5257              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5258                      .dwattr $C$DW$T$37, DW_AT_name("DMACHSRCSEL1_BITS")
    5259                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    5260              $C$DW$413       .dwtag  DW_TAG_member
    5261                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    5262                      .dwattr $C$DW$413, DW_AT_name("CH1")
    5263                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_CH1")
    5264                      .dwattr $C$DW$413, DW_AT_bit_offset(0x08)
    5265                      .dwattr $C$DW$413, DW_AT_bit_size(0x08)
    5266                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5267                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5268              
    5269              $C$DW$414       .dwtag  DW_TAG_member
    5270                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    5271                      .dwattr $C$DW$414, DW_AT_name("CH2")
    5272                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_CH2")
    5273                      .dwattr $C$DW$414, DW_AT_bit_offset(0x00)
    5274                      .dwattr $C$DW$414, DW_AT_bit_size(0x08)
    5275                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5276                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5277              
    5278              $C$DW$415       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    5280                      .dwattr $C$DW$415, DW_AT_name("CH3")
    5281                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_CH3")
    5282                      .dwattr $C$DW$415, DW_AT_bit_offset(0x08)
    5283                      .dwattr $C$DW$415, DW_AT_bit_size(0x08)
    5284                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5285                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5286              
    5287              $C$DW$416       .dwtag  DW_TAG_member
    5288                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    5289                      .dwattr $C$DW$416, DW_AT_name("CH4")
    5290                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_CH4")
    5291                      .dwattr $C$DW$416, DW_AT_bit_offset(0x00)
    5292                      .dwattr $C$DW$416, DW_AT_bit_size(0x08)
    5293                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5294                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5295              
    5296                      .dwendtag $C$DW$T$37
    5297              
    5298              
    5299              $C$DW$T$38      .dwtag  DW_TAG_union_type
    5300                      .dwattr $C$DW$T$38, DW_AT_name("DMACHSRCSEL1_REG")
    5301                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    5302              $C$DW$417       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$25)
    5304                      .dwattr $C$DW$417, DW_AT_name("all")
    5305                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_all")
    5306                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5307                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5308              
    5309              $C$DW$418       .dwtag  DW_TAG_member
    5310                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  100

    5311                      .dwattr $C$DW$418, DW_AT_name("bit")
    5312                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_bit")
    5313                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5314                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5315              
    5316                      .dwendtag $C$DW$T$38
    5317              
    5318              
    5319              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5320                      .dwattr $C$DW$T$39, DW_AT_name("DMACHSRCSEL2_BITS")
    5321                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    5322              $C$DW$419       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    5324                      .dwattr $C$DW$419, DW_AT_name("CH5")
    5325                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_CH5")
    5326                      .dwattr $C$DW$419, DW_AT_bit_offset(0x08)
    5327                      .dwattr $C$DW$419, DW_AT_bit_size(0x08)
    5328                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5329                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5330              
    5331              $C$DW$420       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    5333                      .dwattr $C$DW$420, DW_AT_name("CH6")
    5334                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_CH6")
    5335                      .dwattr $C$DW$420, DW_AT_bit_offset(0x00)
    5336                      .dwattr $C$DW$420, DW_AT_bit_size(0x08)
    5337                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5338                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5339              
    5340              $C$DW$421       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    5342                      .dwattr $C$DW$421, DW_AT_name("rsvd1")
    5343                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_rsvd1")
    5344                      .dwattr $C$DW$421, DW_AT_bit_offset(0x00)
    5345                      .dwattr $C$DW$421, DW_AT_bit_size(0x10)
    5346                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5347                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5348              
    5349                      .dwendtag $C$DW$T$39
    5350              
    5351              
    5352              $C$DW$T$40      .dwtag  DW_TAG_union_type
    5353                      .dwattr $C$DW$T$40, DW_AT_name("DMACHSRCSEL2_REG")
    5354                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    5355              $C$DW$422       .dwtag  DW_TAG_member
    5356                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    5357                      .dwattr $C$DW$422, DW_AT_name("all")
    5358                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_all")
    5359                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5360                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5361              
    5362              $C$DW$423       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$39)
    5364                      .dwattr $C$DW$423, DW_AT_name("bit")
    5365                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  101

    5366                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5367                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5368              
    5369                      .dwendtag $C$DW$T$40
    5370              
    5371              
    5372              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5373                      .dwattr $C$DW$T$41, DW_AT_name("DMACHSRCSELLOCK_BITS")
    5374                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    5375              $C$DW$424       .dwtag  DW_TAG_member
    5376                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    5377                      .dwattr $C$DW$424, DW_AT_name("DMACHSRCSEL1")
    5378                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMACHSRCSEL1")
    5379                      .dwattr $C$DW$424, DW_AT_bit_offset(0x0f)
    5380                      .dwattr $C$DW$424, DW_AT_bit_size(0x01)
    5381                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5382                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5383              
    5384              $C$DW$425       .dwtag  DW_TAG_member
    5385                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    5386                      .dwattr $C$DW$425, DW_AT_name("DMACHSRCSEL2")
    5387                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMACHSRCSEL2")
    5388                      .dwattr $C$DW$425, DW_AT_bit_offset(0x0e)
    5389                      .dwattr $C$DW$425, DW_AT_bit_size(0x01)
    5390                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5391                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5392              
    5393              $C$DW$426       .dwtag  DW_TAG_member
    5394                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    5395                      .dwattr $C$DW$426, DW_AT_name("rsvd1")
    5396                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_rsvd1")
    5397                      .dwattr $C$DW$426, DW_AT_bit_offset(0x00)
    5398                      .dwattr $C$DW$426, DW_AT_bit_size(0x0e)
    5399                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5400                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5401              
    5402              $C$DW$427       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    5404                      .dwattr $C$DW$427, DW_AT_name("rsvd2")
    5405                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_rsvd2")
    5406                      .dwattr $C$DW$427, DW_AT_bit_offset(0x00)
    5407                      .dwattr $C$DW$427, DW_AT_bit_size(0x10)
    5408                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5409                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5410              
    5411                      .dwendtag $C$DW$T$41
    5412              
    5413              
    5414              $C$DW$T$42      .dwtag  DW_TAG_union_type
    5415                      .dwattr $C$DW$T$42, DW_AT_name("DMACHSRCSELLOCK_REG")
    5416                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    5417              $C$DW$428       .dwtag  DW_TAG_member
    5418                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$25)
    5419                      .dwattr $C$DW$428, DW_AT_name("all")
    5420                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  102

    5421                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5422                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5423              
    5424              $C$DW$429       .dwtag  DW_TAG_member
    5425                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$41)
    5426                      .dwattr $C$DW$429, DW_AT_name("bit")
    5427                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_bit")
    5428                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5429                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5430              
    5431                      .dwendtag $C$DW$T$42
    5432              
    5433              
    5434              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5435                      .dwattr $C$DW$T$43, DW_AT_name("DMACTRL_BITS")
    5436                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    5437              $C$DW$430       .dwtag  DW_TAG_member
    5438                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    5439                      .dwattr $C$DW$430, DW_AT_name("HARDRESET")
    5440                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_HARDRESET")
    5441                      .dwattr $C$DW$430, DW_AT_bit_offset(0x0f)
    5442                      .dwattr $C$DW$430, DW_AT_bit_size(0x01)
    5443                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5444                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5445              
    5446              $C$DW$431       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    5448                      .dwattr $C$DW$431, DW_AT_name("PRIORITYRESET")
    5449                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_PRIORITYRESET")
    5450                      .dwattr $C$DW$431, DW_AT_bit_offset(0x0e)
    5451                      .dwattr $C$DW$431, DW_AT_bit_size(0x01)
    5452                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5453                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5454              
    5455              $C$DW$432       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    5457                      .dwattr $C$DW$432, DW_AT_name("rsvd1")
    5458                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd1")
    5459                      .dwattr $C$DW$432, DW_AT_bit_offset(0x00)
    5460                      .dwattr $C$DW$432, DW_AT_bit_size(0x0e)
    5461                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5462                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5463              
    5464                      .dwendtag $C$DW$T$43
    5465              
    5466              
    5467              $C$DW$T$44      .dwtag  DW_TAG_union_type
    5468                      .dwattr $C$DW$T$44, DW_AT_name("DMACTRL_REG")
    5469                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5470              $C$DW$433       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    5472                      .dwattr $C$DW$433, DW_AT_name("all")
    5473                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_all")
    5474                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5475                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  103

    5476              
    5477              $C$DW$434       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$43)
    5479                      .dwattr $C$DW$434, DW_AT_name("bit")
    5480                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_bit")
    5481                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5482                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5483              
    5484                      .dwendtag $C$DW$T$44
    5485              
    5486              
    5487              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5488                      .dwattr $C$DW$T$47, DW_AT_name("DMA_CLA_SRC_SEL_REGS")
    5489                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x1a)
    5490              $C$DW$435       .dwtag  DW_TAG_member
    5491                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$32)
    5492                      .dwattr $C$DW$435, DW_AT_name("CLA1TASKSRCSELLOCK")
    5493                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_CLA1TASKSRCSELLOCK")
    5494                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5495                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5496              
    5497              $C$DW$436       .dwtag  DW_TAG_member
    5498                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$45)
    5499                      .dwattr $C$DW$436, DW_AT_name("rsvd1")
    5500                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd1")
    5501                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5502                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5503              
    5504              $C$DW$437       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$42)
    5506                      .dwattr $C$DW$437, DW_AT_name("DMACHSRCSELLOCK")
    5507                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DMACHSRCSELLOCK")
    5508                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5509                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5510              
    5511              $C$DW$438       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$28)
    5513                      .dwattr $C$DW$438, DW_AT_name("CLA1TASKSRCSEL1")
    5514                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL1")
    5515                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5516                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5517              
    5518              $C$DW$439       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$30)
    5520                      .dwattr $C$DW$439, DW_AT_name("CLA1TASKSRCSEL2")
    5521                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL2")
    5522                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5523                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5524              
    5525              $C$DW$440       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$46)
    5527                      .dwattr $C$DW$440, DW_AT_name("rsvd2")
    5528                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd2")
    5529                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5530                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  104

    5531              
    5532              $C$DW$441       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$38)
    5534                      .dwattr $C$DW$441, DW_AT_name("DMACHSRCSEL1")
    5535                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMACHSRCSEL1")
    5536                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5537                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5538              
    5539              $C$DW$442       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$40)
    5541                      .dwattr $C$DW$442, DW_AT_name("DMACHSRCSEL2")
    5542                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_DMACHSRCSEL2")
    5543                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5544                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5545              
    5546                      .dwendtag $C$DW$T$47
    5547              
    5548              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    5549                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$47)
    5550              
    5551              $C$DW$T$121     .dwtag  DW_TAG_volatile_type
    5552                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$443)
    5553              
    5554              
    5555              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5556                      .dwattr $C$DW$T$49, DW_AT_name("DMA_REGS")
    5557                      .dwattr $C$DW$T$49, DW_AT_byte_size(0xe0)
    5558              $C$DW$444       .dwtag  DW_TAG_member
    5559                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$44)
    5560                      .dwattr $C$DW$444, DW_AT_name("DMACTRL")
    5561                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_DMACTRL")
    5562                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5563                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5564              
    5565              $C$DW$445       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$36)
    5567                      .dwattr $C$DW$445, DW_AT_name("DEBUGCTRL")
    5568                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_DEBUGCTRL")
    5569                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5570                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5571              
    5572              $C$DW$446       .dwtag  DW_TAG_member
    5573                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    5574                      .dwattr $C$DW$446, DW_AT_name("rsvd0")
    5575                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_rsvd0")
    5576                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5577                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5578              
    5579              $C$DW$447       .dwtag  DW_TAG_member
    5580                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    5581                      .dwattr $C$DW$447, DW_AT_name("rsvd1")
    5582                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd1")
    5583                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5584                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5585              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  105

    5586              $C$DW$448       .dwtag  DW_TAG_member
    5587                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$106)
    5588                      .dwattr $C$DW$448, DW_AT_name("PRIORITYCTRL1")
    5589                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_PRIORITYCTRL1")
    5590                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5591                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5592              
    5593              $C$DW$449       .dwtag  DW_TAG_member
    5594                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
    5595                      .dwattr $C$DW$449, DW_AT_name("rsvd2")
    5596                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd2")
    5597                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5598                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5599              
    5600              $C$DW$450       .dwtag  DW_TAG_member
    5601                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$108)
    5602                      .dwattr $C$DW$450, DW_AT_name("PRIORITYSTAT")
    5603                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_PRIORITYSTAT")
    5604                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5605                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5606              
    5607              $C$DW$451       .dwtag  DW_TAG_member
    5608                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$48)
    5609                      .dwattr $C$DW$451, DW_AT_name("rsvd3")
    5610                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd3")
    5611                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5612                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5613              
    5614              $C$DW$452       .dwtag  DW_TAG_member
    5615                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$26)
    5616                      .dwattr $C$DW$452, DW_AT_name("CH1")
    5617                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_CH1")
    5618                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5619                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5620              
    5621              $C$DW$453       .dwtag  DW_TAG_member
    5622                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$26)
    5623                      .dwattr $C$DW$453, DW_AT_name("CH2")
    5624                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_CH2")
    5625                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5626                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5627              
    5628              $C$DW$454       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$26)
    5630                      .dwattr $C$DW$454, DW_AT_name("CH3")
    5631                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_CH3")
    5632                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5633                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5634              
    5635              $C$DW$455       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$26)
    5637                      .dwattr $C$DW$455, DW_AT_name("CH4")
    5638                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_CH4")
    5639                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    5640                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  106

    5641              
    5642              $C$DW$456       .dwtag  DW_TAG_member
    5643                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$26)
    5644                      .dwattr $C$DW$456, DW_AT_name("CH5")
    5645                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_CH5")
    5646                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5647                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5648              
    5649              $C$DW$457       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$26)
    5651                      .dwattr $C$DW$457, DW_AT_name("CH6")
    5652                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_CH6")
    5653                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5654                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5655              
    5656                      .dwendtag $C$DW$T$49
    5657              
    5658              $C$DW$458       .dwtag  DW_TAG_TI_far_type
    5659                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$49)
    5660              
    5661              $C$DW$T$122     .dwtag  DW_TAG_volatile_type
    5662                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$458)
    5663              
    5664              
    5665              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5666                      .dwattr $C$DW$T$50, DW_AT_name("MODE_BITS")
    5667                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    5668              $C$DW$459       .dwtag  DW_TAG_member
    5669                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    5670                      .dwattr $C$DW$459, DW_AT_name("PERINTSEL")
    5671                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_PERINTSEL")
    5672                      .dwattr $C$DW$459, DW_AT_bit_offset(0x0b)
    5673                      .dwattr $C$DW$459, DW_AT_bit_size(0x05)
    5674                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5675                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5676              
    5677              $C$DW$460       .dwtag  DW_TAG_member
    5678                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    5679                      .dwattr $C$DW$460, DW_AT_name("rsvd1")
    5680                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd1")
    5681                      .dwattr $C$DW$460, DW_AT_bit_offset(0x09)
    5682                      .dwattr $C$DW$460, DW_AT_bit_size(0x02)
    5683                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5684                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5685              
    5686              $C$DW$461       .dwtag  DW_TAG_member
    5687                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    5688                      .dwattr $C$DW$461, DW_AT_name("OVRINTE")
    5689                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_OVRINTE")
    5690                      .dwattr $C$DW$461, DW_AT_bit_offset(0x08)
    5691                      .dwattr $C$DW$461, DW_AT_bit_size(0x01)
    5692                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5693                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5694              
    5695              $C$DW$462       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  107

    5696                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    5697                      .dwattr $C$DW$462, DW_AT_name("PERINTE")
    5698                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_PERINTE")
    5699                      .dwattr $C$DW$462, DW_AT_bit_offset(0x07)
    5700                      .dwattr $C$DW$462, DW_AT_bit_size(0x01)
    5701                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5702                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5703              
    5704              $C$DW$463       .dwtag  DW_TAG_member
    5705                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    5706                      .dwattr $C$DW$463, DW_AT_name("CHINTMODE")
    5707                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_CHINTMODE")
    5708                      .dwattr $C$DW$463, DW_AT_bit_offset(0x06)
    5709                      .dwattr $C$DW$463, DW_AT_bit_size(0x01)
    5710                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5711                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5712              
    5713              $C$DW$464       .dwtag  DW_TAG_member
    5714                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    5715                      .dwattr $C$DW$464, DW_AT_name("ONESHOT")
    5716                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_ONESHOT")
    5717                      .dwattr $C$DW$464, DW_AT_bit_offset(0x05)
    5718                      .dwattr $C$DW$464, DW_AT_bit_size(0x01)
    5719                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5720                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5721              
    5722              $C$DW$465       .dwtag  DW_TAG_member
    5723                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    5724                      .dwattr $C$DW$465, DW_AT_name("CONTINUOUS")
    5725                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_CONTINUOUS")
    5726                      .dwattr $C$DW$465, DW_AT_bit_offset(0x04)
    5727                      .dwattr $C$DW$465, DW_AT_bit_size(0x01)
    5728                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5729                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5730              
    5731              $C$DW$466       .dwtag  DW_TAG_member
    5732                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    5733                      .dwattr $C$DW$466, DW_AT_name("rsvd2")
    5734                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd2")
    5735                      .dwattr $C$DW$466, DW_AT_bit_offset(0x02)
    5736                      .dwattr $C$DW$466, DW_AT_bit_size(0x02)
    5737                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5738                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5739              
    5740              $C$DW$467       .dwtag  DW_TAG_member
    5741                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    5742                      .dwattr $C$DW$467, DW_AT_name("DATASIZE")
    5743                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_DATASIZE")
    5744                      .dwattr $C$DW$467, DW_AT_bit_offset(0x01)
    5745                      .dwattr $C$DW$467, DW_AT_bit_size(0x01)
    5746                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5747                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5748              
    5749              $C$DW$468       .dwtag  DW_TAG_member
    5750                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  108

    5751                      .dwattr $C$DW$468, DW_AT_name("CHINTE")
    5752                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_CHINTE")
    5753                      .dwattr $C$DW$468, DW_AT_bit_offset(0x00)
    5754                      .dwattr $C$DW$468, DW_AT_bit_size(0x01)
    5755                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5756                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5757              
    5758                      .dwendtag $C$DW$T$50
    5759              
    5760              
    5761              $C$DW$T$51      .dwtag  DW_TAG_union_type
    5762                      .dwattr $C$DW$T$51, DW_AT_name("MODE_REG")
    5763                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    5764              $C$DW$469       .dwtag  DW_TAG_member
    5765                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    5766                      .dwattr $C$DW$469, DW_AT_name("all")
    5767                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_all")
    5768                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5769                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5770              
    5771              $C$DW$470       .dwtag  DW_TAG_member
    5772                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$50)
    5773                      .dwattr $C$DW$470, DW_AT_name("bit")
    5774                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_bit")
    5775                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5776                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5777              
    5778                      .dwendtag $C$DW$T$51
    5779              
    5780              
    5781              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5782                      .dwattr $C$DW$T$52, DW_AT_name("PIEACK_BITS")
    5783                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5784              $C$DW$471       .dwtag  DW_TAG_member
    5785                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    5786                      .dwattr $C$DW$471, DW_AT_name("ACK1")
    5787                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ACK1")
    5788                      .dwattr $C$DW$471, DW_AT_bit_offset(0x0f)
    5789                      .dwattr $C$DW$471, DW_AT_bit_size(0x01)
    5790                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5791                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5792              
    5793              $C$DW$472       .dwtag  DW_TAG_member
    5794                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    5795                      .dwattr $C$DW$472, DW_AT_name("ACK2")
    5796                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_ACK2")
    5797                      .dwattr $C$DW$472, DW_AT_bit_offset(0x0e)
    5798                      .dwattr $C$DW$472, DW_AT_bit_size(0x01)
    5799                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5800                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5801              
    5802              $C$DW$473       .dwtag  DW_TAG_member
    5803                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    5804                      .dwattr $C$DW$473, DW_AT_name("ACK3")
    5805                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_ACK3")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  109

    5806                      .dwattr $C$DW$473, DW_AT_bit_offset(0x0d)
    5807                      .dwattr $C$DW$473, DW_AT_bit_size(0x01)
    5808                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5809                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5810              
    5811              $C$DW$474       .dwtag  DW_TAG_member
    5812                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    5813                      .dwattr $C$DW$474, DW_AT_name("ACK4")
    5814                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_ACK4")
    5815                      .dwattr $C$DW$474, DW_AT_bit_offset(0x0c)
    5816                      .dwattr $C$DW$474, DW_AT_bit_size(0x01)
    5817                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5818                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5819              
    5820              $C$DW$475       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    5822                      .dwattr $C$DW$475, DW_AT_name("ACK5")
    5823                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_ACK5")
    5824                      .dwattr $C$DW$475, DW_AT_bit_offset(0x0b)
    5825                      .dwattr $C$DW$475, DW_AT_bit_size(0x01)
    5826                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5827                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5828              
    5829              $C$DW$476       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    5831                      .dwattr $C$DW$476, DW_AT_name("ACK6")
    5832                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_ACK6")
    5833                      .dwattr $C$DW$476, DW_AT_bit_offset(0x0a)
    5834                      .dwattr $C$DW$476, DW_AT_bit_size(0x01)
    5835                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5836                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5837              
    5838              $C$DW$477       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
    5840                      .dwattr $C$DW$477, DW_AT_name("ACK7")
    5841                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_ACK7")
    5842                      .dwattr $C$DW$477, DW_AT_bit_offset(0x09)
    5843                      .dwattr $C$DW$477, DW_AT_bit_size(0x01)
    5844                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5845                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5846              
    5847              $C$DW$478       .dwtag  DW_TAG_member
    5848                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$19)
    5849                      .dwattr $C$DW$478, DW_AT_name("ACK8")
    5850                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_ACK8")
    5851                      .dwattr $C$DW$478, DW_AT_bit_offset(0x08)
    5852                      .dwattr $C$DW$478, DW_AT_bit_size(0x01)
    5853                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5854                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5855              
    5856              $C$DW$479       .dwtag  DW_TAG_member
    5857                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    5858                      .dwattr $C$DW$479, DW_AT_name("ACK9")
    5859                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_ACK9")
    5860                      .dwattr $C$DW$479, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Dma.asm                                                      PAGE  110

    5861                      .dwattr $C$DW$479, DW_AT_bit_size(0x01)
    5862                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5863                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5864              
    5865              $C$DW$480       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    5867                      .dwattr $C$DW$480, DW_AT_name("ACK10")
    5868                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_ACK10")
    5869                      .dwattr $C$DW$480, DW_AT_bit_offset(0x06)
    5870                      .dwattr $C$DW$480, DW_AT_bit_size(0x01)
    5871                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5872                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5873              
    5874              $C$DW$481       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    5876                      .dwattr $C$DW$481, DW_AT_name("ACK11")
    5877                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_ACK11")
    5878                      .dwattr $C$DW$481, DW_AT_bit_offset(0x05)
    5879                      .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5880                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5881                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5882              
    5883              $C$DW$482       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    5885                      .dwattr $C$DW$482, DW_AT_name("ACK12")
    5886                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_ACK12")
    5887                      .dwattr $C$DW$482, DW_AT_bit_offset(0x04)
    5888                      .dwattr $C$DW$482, DW_AT_bit_size(0x01)
    5889                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5890                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5891              
    5892              $C$DW$483       .dwtag  DW_TAG_member
    5893                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
    5894                      .dwattr $C$DW$483, DW_AT_name("rsvd1")
    5895                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_rsvd1")
    5896                      .dwattr $C$DW$483, DW_AT_bit_offset(0x00)
