TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:23 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Emif.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinMux")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinMux")

    2140 000002fd D431          MOVB      XAR4,#49              ; [CPU_ALU] |419| 
    2141 000002fe 9B00          MOVB      AH,#0                 ; [CPU_ALU] |419| 
    2142              $C$DW$139       .dwtag  DW_TAG_TI_branch
    2143                      .dwattr $C$DW$139, DW_AT_low_pc(0x00)
    2144                      .dwattr $C$DW$139, DW_AT_name("_GPIO_SetupPinOptions")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   42

    2145                      .dwattr $C$DW$139, DW_AT_TI_call
    2146              
    2147 000002ff 7640!         LCR       #_GPIO_SetupPinOptions ; [CPU_ALU] |419| 
         00000300 0000 
    2148                      ; call occurs [#_GPIO_SetupPinOptions] ; [] |419| 
    2149                      .dwpsn  file "../F2837xD/F2837xD_Emif.c",line 420,column 5,is_stmt,isa 0
    2150 00000301 9A59          MOVB      AL,#89                ; [CPU_ALU] |420| 
    2151 00000302 D431          MOVB      XAR4,#49              ; [CPU_ALU] |420| 
    2152 00000303 9B00          MOVB      AH,#0                 ; [CPU_ALU] |420| 
    2153              $C$DW$140       .dwtag  DW_TAG_TI_branch
    2154                      .dwattr $C$DW$140, DW_AT_low_pc(0x00)
    2155                      .dwattr $C$DW$140, DW_AT_name("_GPIO_SetupPinOptions")
    2156                      .dwattr $C$DW$140, DW_AT_TI_call
    2157              
    2158 00000304 7640!         LCR       #_GPIO_SetupPinOptions ; [CPU_ALU] |420| 
         00000305 0000 
    2159                      ; call occurs [#_GPIO_SetupPinOptions] ; [] |420| 
    2160                      .dwpsn  file "../F2837xD/F2837xD_Emif.c",line 421,column 5,is_stmt,isa 0
    2161 00000306 9A5A          MOVB      AL,#90                ; [CPU_ALU] |421| 
    2162 00000307 D431          MOVB      XAR4,#49              ; [CPU_ALU] |421| 
    2163 00000308 9B00          MOVB      AH,#0                 ; [CPU_ALU] |421| 
    2164              $C$DW$141       .dwtag  DW_TAG_TI_branch
    2165                      .dwattr $C$DW$141, DW_AT_low_pc(0x00)
    2166                      .dwattr $C$DW$141, DW_AT_name("_GPIO_SetupPinOptions")
    2167                      .dwattr $C$DW$141, DW_AT_TI_call
    2168              
    2169 00000309 7640!         LCR       #_GPIO_SetupPinOptions ; [CPU_ALU] |421| 
         0000030a 0000 
    2170                      ; call occurs [#_GPIO_SetupPinOptions] ; [] |421| 
    2171                      .dwpsn  file "../F2837xD/F2837xD_Emif.c",line 422,column 5,is_stmt,isa 0
    2172 0000030b 9A5B          MOVB      AL,#91                ; [CPU_ALU] |422| 
    2173 0000030c D431          MOVB      XAR4,#49              ; [CPU_ALU] |422| 
    2174 0000030d 9B00          MOVB      AH,#0                 ; [CPU_ALU] |422| 
    2175              $C$DW$142       .dwtag  DW_TAG_TI_branch
    2176                      .dwattr $C$DW$142, DW_AT_low_pc(0x00)
    2177                      .dwattr $C$DW$142, DW_AT_name("_GPIO_SetupPinOptions")
    2178                      .dwattr $C$DW$142, DW_AT_TI_call
    2179              
    2180 0000030e 7640!         LCR       #_GPIO_SetupPinOptions ; [CPU_ALU] |422| 
         0000030f 0000 
    2181                      ; call occurs [#_GPIO_SetupPinOptions] ; [] |422| 
    2182                      .dwpsn  file "../F2837xD/F2837xD_Emif.c",line 423,column 2,is_stmt,isa 0
    2183 00000310 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    2184                      .dwcfi  cfa_offset, -2
    2185              $C$DW$143       .dwtag  DW_TAG_TI_branch
    2186                      .dwattr $C$DW$143, DW_AT_low_pc(0x00)
    2187                      .dwattr $C$DW$143, DW_AT_TI_return
    2188              
    2189 00000311 0006          LRETR     ; [CPU_ALU] 
    2190                      ; return occurs ; [] 
    2191                      .dwattr $C$DW$131, DW_AT_TI_end_file("../F2837xD/F2837xD_Emif.c")
    2192                      .dwattr $C$DW$131, DW_AT_TI_end_line(0x1a7)
    2193                      .dwattr $C$DW$131, DW_AT_TI_end_column(0x02)
    2194                      .dwendentry
    2195                      .dwendtag $C$DW$131
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   43

    2196              
    2197              ;**************************************************************
    2198              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2199              ;**************************************************************
    2200                      .global _GPIO_SetupPinMux
    2201                      .global _GPIO_SetupPinOptions
    2202                      .global _Emif2Regs
    2203                      .global _Emif1Regs
    2204                      .global _DevCfgRegs
    2205              
    2206              ;***************************************************************
    2207              ;* TYPE INFORMATION                                            *
    2208              ;***************************************************************
    2209              
    2210              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2211                      .dwattr $C$DW$T$21, DW_AT_name("ASYNC_CS2_CR_BITS")
    2212                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2213              $C$DW$144       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$144, DW_AT_name("ASIZE")
    2216                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ASIZE")
    2217                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    2218                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2219                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$145       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$145, DW_AT_name("TA")
    2225                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_TA")
    2226                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    2227                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    2228                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2230              
    2231              $C$DW$146       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2233                      .dwattr $C$DW$146, DW_AT_name("R_HOLD")
    2234                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_R_HOLD")
    2235                      .dwattr $C$DW$146, DW_AT_bit_offset(0x09)
    2236                      .dwattr $C$DW$146, DW_AT_bit_size(0x03)
    2237                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$147       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2242                      .dwattr $C$DW$147, DW_AT_name("R_STROBE")
    2243                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_R_STROBE")
    2244                      .dwattr $C$DW$147, DW_AT_bit_offset(0x03)
    2245                      .dwattr $C$DW$147, DW_AT_bit_size(0x06)
    2246                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$148       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   44

    2251                      .dwattr $C$DW$148, DW_AT_name("R_SETUP")
    2252                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_R_SETUP")
    2253                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    2254                      .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    2255                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$149       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$149, DW_AT_name("W_HOLD")
    2261                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_W_HOLD")
    2262                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    2263                      .dwattr $C$DW$149, DW_AT_bit_size(0x03)
    2264                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2265                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$150       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2269                      .dwattr $C$DW$150, DW_AT_name("W_STROBE")
    2270                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_W_STROBE")
    2271                      .dwattr $C$DW$150, DW_AT_bit_offset(0x06)
    2272                      .dwattr $C$DW$150, DW_AT_bit_size(0x06)
    2273                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2274                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2275              
    2276              $C$DW$151       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2278                      .dwattr $C$DW$151, DW_AT_name("W_SETUP")
    2279                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_W_SETUP")
    2280                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02)
    2281                      .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    2282                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2283                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2284              
    2285              $C$DW$152       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$152, DW_AT_name("EW")
    2288                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_EW")
    2289                      .dwattr $C$DW$152, DW_AT_bit_offset(0x01)
    2290                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2291                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2292                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$153       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$153, DW_AT_name("SS")
    2297                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_SS")
    2298                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2299                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2301                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303                      .dwendtag $C$DW$T$21
    2304              
    2305              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   45

    2306              $C$DW$T$22      .dwtag  DW_TAG_union_type
    2307                      .dwattr $C$DW$T$22, DW_AT_name("ASYNC_CS2_CR_REG")
    2308                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2309              $C$DW$154       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2311                      .dwattr $C$DW$154, DW_AT_name("all")
    2312                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    2313                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$155       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    2318                      .dwattr $C$DW$155, DW_AT_name("bit")
    2319                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    2320                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2322              
    2323                      .dwendtag $C$DW$T$22
    2324              
    2325              
    2326              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2327                      .dwattr $C$DW$T$23, DW_AT_name("ASYNC_CS3_CR_BITS")
    2328                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    2329              $C$DW$156       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$156, DW_AT_name("ASIZE")
    2332                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ASIZE")
    2333                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e)
    2334                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2335                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$157       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2340                      .dwattr $C$DW$157, DW_AT_name("TA")
    2341                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_TA")
    2342                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c)
    2343                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2344                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347              $C$DW$158       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2349                      .dwattr $C$DW$158, DW_AT_name("R_HOLD")
    2350                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_R_HOLD")
    2351                      .dwattr $C$DW$158, DW_AT_bit_offset(0x09)
    2352                      .dwattr $C$DW$158, DW_AT_bit_size(0x03)
    2353                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2355              
    2356              $C$DW$159       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$159, DW_AT_name("R_STROBE")
    2359                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_R_STROBE")
    2360                      .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   46

    2361                      .dwattr $C$DW$159, DW_AT_bit_size(0x06)
    2362                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$160       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2367                      .dwattr $C$DW$160, DW_AT_name("R_SETUP")
    2368                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_R_SETUP")
    2369                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    2370                      .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    2371                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$161       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$161, DW_AT_name("W_HOLD")
    2377                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_W_HOLD")
    2378                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
    2379                      .dwattr $C$DW$161, DW_AT_bit_size(0x03)
    2380                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2381                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$162       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2385                      .dwattr $C$DW$162, DW_AT_name("W_STROBE")
    2386                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_W_STROBE")
    2387                      .dwattr $C$DW$162, DW_AT_bit_offset(0x06)
    2388                      .dwattr $C$DW$162, DW_AT_bit_size(0x06)
    2389                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2390                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$163       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$163, DW_AT_name("W_SETUP")
    2395                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_W_SETUP")
    2396                      .dwattr $C$DW$163, DW_AT_bit_offset(0x02)
    2397                      .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2398                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2399                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$164       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$164, DW_AT_name("EW")
    2404                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EW")
    2405                      .dwattr $C$DW$164, DW_AT_bit_offset(0x01)
    2406                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2408                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$165       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2412                      .dwattr $C$DW$165, DW_AT_name("SS")
    2413                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SS")
    2414                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2415                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   47

    2416                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2417                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419                      .dwendtag $C$DW$T$23
    2420              
    2421              
    2422              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2423                      .dwattr $C$DW$T$24, DW_AT_name("ASYNC_CS3_CR_REG")
    2424                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2425              $C$DW$166       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2427                      .dwattr $C$DW$166, DW_AT_name("all")
    2428                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    2429                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$167       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2434                      .dwattr $C$DW$167, DW_AT_name("bit")
    2435                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    2436                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2438              
    2439                      .dwendtag $C$DW$T$24
    2440              
    2441              
    2442              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2443                      .dwattr $C$DW$T$25, DW_AT_name("ASYNC_CS4_CR_BITS")
    2444                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    2445              $C$DW$168       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2447                      .dwattr $C$DW$168, DW_AT_name("ASIZE")
    2448                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ASIZE")
    2449                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    2450                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2451                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2453              
    2454              $C$DW$169       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$169, DW_AT_name("TA")
    2457                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_TA")
    2458                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    2459                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2460                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463              $C$DW$170       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$170, DW_AT_name("R_HOLD")
    2466                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_R_HOLD")
    2467                      .dwattr $C$DW$170, DW_AT_bit_offset(0x09)
    2468                      .dwattr $C$DW$170, DW_AT_bit_size(0x03)
    2469                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   48

    2471              
    2472              $C$DW$171       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2474                      .dwattr $C$DW$171, DW_AT_name("R_STROBE")
    2475                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_R_STROBE")
    2476                      .dwattr $C$DW$171, DW_AT_bit_offset(0x03)
    2477                      .dwattr $C$DW$171, DW_AT_bit_size(0x06)
    2478                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$172       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2483                      .dwattr $C$DW$172, DW_AT_name("R_SETUP")
    2484                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_R_SETUP")
    2485                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f)
    2486                      .dwattr $C$DW$172, DW_AT_bit_size(0x04)
    2487                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$173       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$173, DW_AT_name("W_HOLD")
    2493                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_W_HOLD")
    2494                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2495                      .dwattr $C$DW$173, DW_AT_bit_size(0x03)
    2496                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2497                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$174       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2501                      .dwattr $C$DW$174, DW_AT_name("W_STROBE")
    2502                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_W_STROBE")
    2503                      .dwattr $C$DW$174, DW_AT_bit_offset(0x06)
    2504                      .dwattr $C$DW$174, DW_AT_bit_size(0x06)
    2505                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2506                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$175       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2510                      .dwattr $C$DW$175, DW_AT_name("W_SETUP")
    2511                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_W_SETUP")
    2512                      .dwattr $C$DW$175, DW_AT_bit_offset(0x02)
    2513                      .dwattr $C$DW$175, DW_AT_bit_size(0x04)
    2514                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2515                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$176       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$176, DW_AT_name("EW")
    2520                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_EW")
    2521                      .dwattr $C$DW$176, DW_AT_bit_offset(0x01)
    2522                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2523                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2524                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2525              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   49

    2526              $C$DW$177       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$177, DW_AT_name("SS")
    2529                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SS")
    2530                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2531                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2533                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535                      .dwendtag $C$DW$T$25
    2536              
    2537              
    2538              $C$DW$T$26      .dwtag  DW_TAG_union_type
    2539                      .dwattr $C$DW$T$26, DW_AT_name("ASYNC_CS4_CR_REG")
    2540                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2541              $C$DW$178       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2543                      .dwattr $C$DW$178, DW_AT_name("all")
    2544                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    2545                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$179       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$25)
    2550                      .dwattr $C$DW$179, DW_AT_name("bit")
    2551                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_bit")
    2552                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555                      .dwendtag $C$DW$T$26
    2556              
    2557              
    2558              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2559                      .dwattr $C$DW$T$27, DW_AT_name("ASYNC_WCCR_BITS")
    2560                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2561              $C$DW$180       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2563                      .dwattr $C$DW$180, DW_AT_name("MAX_EXT_WAIT")
    2564                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_MAX_EXT_WAIT")
    2565                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08)
    2566                      .dwattr $C$DW$180, DW_AT_bit_size(0x08)
    2567                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2568                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2569              
    2570              $C$DW$181       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2572                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    2573                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    2574                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    2575                      .dwattr $C$DW$181, DW_AT_bit_size(0x08)
    2576                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579              $C$DW$182       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   50

    2581                      .dwattr $C$DW$182, DW_AT_name("rsvd2")
    2582                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd2")
    2583                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    2584                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2585                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2586                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2587              
    2588              $C$DW$183       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$183, DW_AT_name("rsvd3")
    2591                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd3")
    2592                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c)
    2593                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    2594                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2595                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597              $C$DW$184       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2599                      .dwattr $C$DW$184, DW_AT_name("rsvd4")
    2600                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd4")
    2601                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0a)
    2602                      .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    2603                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2604                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2605              
    2606              $C$DW$185       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$185, DW_AT_name("rsvd5")
    2609                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd5")
    2610                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08)
    2611                      .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    2612                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2613                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2614              
    2615              $C$DW$186       .dwtag  DW_TAG_member
    2616                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2617                      .dwattr $C$DW$186, DW_AT_name("rsvd6")
    2618                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd6")
    2619                      .dwattr $C$DW$186, DW_AT_bit_offset(0x04)
    2620                      .dwattr $C$DW$186, DW_AT_bit_size(0x04)
    2621                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2622                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2623              
    2624              $C$DW$187       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$187, DW_AT_name("WP0")
    2627                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_WP0")
    2628                      .dwattr $C$DW$187, DW_AT_bit_offset(0x03)
    2629                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2630                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2631                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2632              
    2633              $C$DW$188       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2635                      .dwattr $C$DW$188, DW_AT_name("rsvd7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   51

    2636                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd7")
    2637                      .dwattr $C$DW$188, DW_AT_bit_offset(0x02)
    2638                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2639                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2640                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2641              
    2642              $C$DW$189       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2644                      .dwattr $C$DW$189, DW_AT_name("rsvd8")
    2645                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd8")
    2646                      .dwattr $C$DW$189, DW_AT_bit_offset(0x01)
    2647                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2648                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2649                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2650              
    2651              $C$DW$190       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2653                      .dwattr $C$DW$190, DW_AT_name("rsvd9")
    2654                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd9")
    2655                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    2656                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2657                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2658                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2659              
    2660                      .dwendtag $C$DW$T$27
    2661              
    2662              
    2663              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2664                      .dwattr $C$DW$T$28, DW_AT_name("ASYNC_WCCR_REG")
    2665                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2666              $C$DW$191       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$191, DW_AT_name("all")
    2669                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    2670                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2671                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2672              
    2673              $C$DW$192       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    2675                      .dwattr $C$DW$192, DW_AT_name("bit")
    2676                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    2677                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2679              
    2680                      .dwendtag $C$DW$T$28
    2681              
    2682              
    2683              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2684                      .dwattr $C$DW$T$29, DW_AT_name("CPU2RESCTL_BITS")
    2685                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2686              $C$DW$193       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2688                      .dwattr $C$DW$193, DW_AT_name("RESET")
    2689                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RESET")
    2690                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   52

    2691                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2692                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2694              
    2695              $C$DW$194       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$194, DW_AT_name("rsvd1")
    2698                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd1")
    2699                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    2700                      .dwattr $C$DW$194, DW_AT_bit_size(0x0f)
    2701                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2702                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2703              
    2704              $C$DW$195       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2706                      .dwattr $C$DW$195, DW_AT_name("KEY")
    2707                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_KEY")
    2708                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    2709                      .dwattr $C$DW$195, DW_AT_bit_size(0x10)
    2710                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2711                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2712              
    2713                      .dwendtag $C$DW$T$29
    2714              
    2715              
    2716              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2717                      .dwattr $C$DW$T$30, DW_AT_name("CPU2RESCTL_REG")
    2718                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2719              $C$DW$196       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2721                      .dwattr $C$DW$196, DW_AT_name("all")
    2722                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    2723                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2724                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2725              
    2726              $C$DW$197       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$29)
    2728                      .dwattr $C$DW$197, DW_AT_name("bit")
    2729                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    2730                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733                      .dwendtag $C$DW$T$30
    2734              
    2735              
    2736              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2737                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL0_BITS")
    2738                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2739              $C$DW$198       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2741                      .dwattr $C$DW$198, DW_AT_name("EPWM1")
    2742                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EPWM1")
    2743                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f)
    2744                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2745                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   53

    2746                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2747              
    2748              $C$DW$199       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2750                      .dwattr $C$DW$199, DW_AT_name("EPWM2")
    2751                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EPWM2")
    2752                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
    2753                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2754                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2755                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2756              
    2757              $C$DW$200       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2759                      .dwattr $C$DW$200, DW_AT_name("EPWM3")
    2760                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EPWM3")
    2761                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d)
    2762                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2763                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2764                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2765              
    2766              $C$DW$201       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2768                      .dwattr $C$DW$201, DW_AT_name("EPWM4")
    2769                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EPWM4")
    2770                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c)
    2771                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2772                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2773                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2774              
    2775              $C$DW$202       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2777                      .dwattr $C$DW$202, DW_AT_name("EPWM5")
    2778                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_EPWM5")
    2779                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b)
    2780                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2781                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2782                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2783              
    2784              $C$DW$203       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2786                      .dwattr $C$DW$203, DW_AT_name("EPWM6")
    2787                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EPWM6")
    2788                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a)
    2789                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2790                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2792              
    2793              $C$DW$204       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2795                      .dwattr $C$DW$204, DW_AT_name("EPWM7")
    2796                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EPWM7")
    2797                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09)
    2798                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2799                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   54

    2801              
    2802              $C$DW$205       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2804                      .dwattr $C$DW$205, DW_AT_name("EPWM8")
    2805                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EPWM8")
    2806                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
    2807                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2808                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2809                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2810              
    2811              $C$DW$206       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2813                      .dwattr $C$DW$206, DW_AT_name("EPWM9")
    2814                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EPWM9")
    2815                      .dwattr $C$DW$206, DW_AT_bit_offset(0x07)
    2816                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2817                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820              $C$DW$207       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2822                      .dwattr $C$DW$207, DW_AT_name("EPWM10")
    2823                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_EPWM10")
    2824                      .dwattr $C$DW$207, DW_AT_bit_offset(0x06)
    2825                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2826                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2827                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2828              
    2829              $C$DW$208       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2831                      .dwattr $C$DW$208, DW_AT_name("EPWM11")
    2832                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_EPWM11")
    2833                      .dwattr $C$DW$208, DW_AT_bit_offset(0x05)
    2834                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2835                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2837              
    2838              $C$DW$209       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2840                      .dwattr $C$DW$209, DW_AT_name("EPWM12")
    2841                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_EPWM12")
    2842                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    2843                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2844                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2845                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2846              
    2847              $C$DW$210       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2849                      .dwattr $C$DW$210, DW_AT_name("rsvd1")
    2850                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd1")
    2851                      .dwattr $C$DW$210, DW_AT_bit_offset(0x03)
    2852                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2853                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2855              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   55

    2856              $C$DW$211       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2858                      .dwattr $C$DW$211, DW_AT_name("rsvd2")
    2859                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd2")
    2860                      .dwattr $C$DW$211, DW_AT_bit_offset(0x02)
    2861                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2862                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2863                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2864              
    2865              $C$DW$212       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2867                      .dwattr $C$DW$212, DW_AT_name("rsvd3")
    2868                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd3")
    2869                      .dwattr $C$DW$212, DW_AT_bit_offset(0x01)
    2870                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2871                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2873              
    2874              $C$DW$213       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2876                      .dwattr $C$DW$213, DW_AT_name("rsvd4")
    2877                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd4")
    2878                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    2879                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2880                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883              $C$DW$214       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2885                      .dwattr $C$DW$214, DW_AT_name("rsvd5")
    2886                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd5")
    2887                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    2888                      .dwattr $C$DW$214, DW_AT_bit_size(0x10)
    2889                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2890                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2891              
    2892                      .dwendtag $C$DW$T$31
    2893              
    2894              
    2895              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2896                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL0_REG")
    2897                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2898              $C$DW$215       .dwtag  DW_TAG_member
    2899                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2900                      .dwattr $C$DW$215, DW_AT_name("all")
    2901                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    2902                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2903                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2904              
    2905              $C$DW$216       .dwtag  DW_TAG_member
    2906                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
    2907                      .dwattr $C$DW$216, DW_AT_name("bit")
    2908                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
    2909                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2910                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   56

    2911              
    2912                      .dwendtag $C$DW$T$32
    2913              
    2914              
    2915              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2916                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL11_BITS")
    2917                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2918              $C$DW$217       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2920                      .dwattr $C$DW$217, DW_AT_name("ADC_A")
    2921                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ADC_A")
    2922                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0f)
    2923                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2924                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2925                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2926              
    2927              $C$DW$218       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2929                      .dwattr $C$DW$218, DW_AT_name("ADC_B")
    2930                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_ADC_B")
    2931                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0e)
    2932                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2933                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2935              
    2936              $C$DW$219       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2938                      .dwattr $C$DW$219, DW_AT_name("ADC_C")
    2939                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_ADC_C")
    2940                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0d)
    2941                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2942                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2943                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2944              
    2945              $C$DW$220       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2947                      .dwattr $C$DW$220, DW_AT_name("ADC_D")
    2948                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_ADC_D")
    2949                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0c)
    2950                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2951                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2953              
    2954              $C$DW$221       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2956                      .dwattr $C$DW$221, DW_AT_name("rsvd1")
    2957                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd1")
    2958                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00)
    2959                      .dwattr $C$DW$221, DW_AT_bit_size(0x0c)
    2960                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2961                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2962              
    2963              $C$DW$222       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2965                      .dwattr $C$DW$222, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   57

    2966                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd2")
    2967                      .dwattr $C$DW$222, DW_AT_bit_offset(0x00)
    2968                      .dwattr $C$DW$222, DW_AT_bit_size(0x10)
    2969                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2970                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2971              
    2972                      .dwendtag $C$DW$T$33
    2973              
    2974              
    2975              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2976                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL11_REG")
    2977                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2978              $C$DW$223       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2980                      .dwattr $C$DW$223, DW_AT_name("all")
    2981                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_all")
    2982                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2983                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2984              
    2985              $C$DW$224       .dwtag  DW_TAG_member
    2986                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$33)
    2987                      .dwattr $C$DW$224, DW_AT_name("bit")
    2988                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_bit")
    2989                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2991              
    2992                      .dwendtag $C$DW$T$34
    2993              
    2994              
    2995              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2996                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL12_BITS")
    2997                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2998              $C$DW$225       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3000                      .dwattr $C$DW$225, DW_AT_name("CMPSS1")
    3001                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_CMPSS1")
    3002                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0f)
    3003                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3004                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3005                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3006              
    3007              $C$DW$226       .dwtag  DW_TAG_member
    3008                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3009                      .dwattr $C$DW$226, DW_AT_name("CMPSS2")
    3010                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_CMPSS2")
    3011                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0e)
    3012                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    3013                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3014                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3015              
    3016              $C$DW$227       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3018                      .dwattr $C$DW$227, DW_AT_name("CMPSS3")
    3019                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_CMPSS3")
    3020                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0d)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   58

    3021                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3022                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3023                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3024              
    3025              $C$DW$228       .dwtag  DW_TAG_member
    3026                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3027                      .dwattr $C$DW$228, DW_AT_name("CMPSS4")
    3028                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_CMPSS4")
    3029                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0c)
    3030                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    3031                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3033              
    3034              $C$DW$229       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3036                      .dwattr $C$DW$229, DW_AT_name("CMPSS5")
    3037                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_CMPSS5")
    3038                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0b)
    3039                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3040                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3042              
    3043              $C$DW$230       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$230, DW_AT_name("CMPSS6")
    3046                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_CMPSS6")
    3047                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0a)
    3048                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    3049                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3050                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052              $C$DW$231       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3054                      .dwattr $C$DW$231, DW_AT_name("CMPSS7")
    3055                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_CMPSS7")
    3056                      .dwattr $C$DW$231, DW_AT_bit_offset(0x09)
    3057                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    3058                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3059                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061              $C$DW$232       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3063                      .dwattr $C$DW$232, DW_AT_name("CMPSS8")
    3064                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_CMPSS8")
    3065                      .dwattr $C$DW$232, DW_AT_bit_offset(0x08)
    3066                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    3067                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3068                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3069              
    3070              $C$DW$233       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3072                      .dwattr $C$DW$233, DW_AT_name("rsvd1")
    3073                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_rsvd1")
    3074                      .dwattr $C$DW$233, DW_AT_bit_offset(0x00)
    3075                      .dwattr $C$DW$233, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   59

    3076                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3077                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3078              
    3079              $C$DW$234       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3081                      .dwattr $C$DW$234, DW_AT_name("rsvd2")
    3082                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd2")
    3083                      .dwattr $C$DW$234, DW_AT_bit_offset(0x00)
    3084                      .dwattr $C$DW$234, DW_AT_bit_size(0x10)
    3085                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3086                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3087              
    3088                      .dwendtag $C$DW$T$35
    3089              
    3090              
    3091              $C$DW$T$36      .dwtag  DW_TAG_union_type
    3092                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL12_REG")
    3093                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3094              $C$DW$235       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    3096                      .dwattr $C$DW$235, DW_AT_name("all")
    3097                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_all")
    3098                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3099                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3100              
    3101              $C$DW$236       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$35)
    3103                      .dwattr $C$DW$236, DW_AT_name("bit")
    3104                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_bit")
    3105                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3106                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3107              
    3108                      .dwendtag $C$DW$T$36
    3109              
    3110              
    3111              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3112                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL14_BITS")
    3113                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    3114              $C$DW$237       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3116                      .dwattr $C$DW$237, DW_AT_name("rsvd1")
    3117                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd1")
    3118                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0f)
    3119                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    3120                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3121                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3122              
    3123              $C$DW$238       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3125                      .dwattr $C$DW$238, DW_AT_name("rsvd2")
    3126                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd2")
    3127                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0e)
    3128                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3129                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3130                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   60

    3131              
    3132              $C$DW$239       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3134                      .dwattr $C$DW$239, DW_AT_name("rsvd3")
    3135                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd3")
    3136                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0d)
    3137                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    3138                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3139                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3140              
    3141              $C$DW$240       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3143                      .dwattr $C$DW$240, DW_AT_name("rsvd4")
    3144                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd4")
    3145                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0c)
    3146                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3147                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3148                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3149              
    3150              $C$DW$241       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3152                      .dwattr $C$DW$241, DW_AT_name("rsvd5")
    3153                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_rsvd5")
    3154                      .dwattr $C$DW$241, DW_AT_bit_offset(0x00)
    3155                      .dwattr $C$DW$241, DW_AT_bit_size(0x0c)
    3156                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3157                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3158              
    3159              $C$DW$242       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3161                      .dwattr $C$DW$242, DW_AT_name("DAC_A")
    3162                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DAC_A")
    3163                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0f)
    3164                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3165                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3166                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3167              
    3168              $C$DW$243       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3170                      .dwattr $C$DW$243, DW_AT_name("DAC_B")
    3171                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DAC_B")
    3172                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e)
    3173                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    3174                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3175                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3176              
    3177              $C$DW$244       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3179                      .dwattr $C$DW$244, DW_AT_name("DAC_C")
    3180                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DAC_C")
    3181                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0d)
    3182                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    3183                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3184                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3185              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   61

    3186              $C$DW$245       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3188                      .dwattr $C$DW$245, DW_AT_name("rsvd6")
    3189                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd6")
    3190                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0c)
    3191                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3192                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3193                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$246       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3197                      .dwattr $C$DW$246, DW_AT_name("rsvd7")
    3198                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd7")
    3199                      .dwattr $C$DW$246, DW_AT_bit_offset(0x00)
    3200                      .dwattr $C$DW$246, DW_AT_bit_size(0x0c)
    3201                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3202                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3203              
    3204                      .dwendtag $C$DW$T$37
    3205              
    3206              
    3207              $C$DW$T$38      .dwtag  DW_TAG_union_type
    3208                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL14_REG")
    3209                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    3210              $C$DW$247       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    3212                      .dwattr $C$DW$247, DW_AT_name("all")
    3213                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_all")
    3214                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3215                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217              $C$DW$248       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$37)
    3219                      .dwattr $C$DW$248, DW_AT_name("bit")
    3220                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_bit")
    3221                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224                      .dwendtag $C$DW$T$38
    3225              
    3226              
    3227              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3228                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL1_BITS")
    3229                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3230              $C$DW$249       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3232                      .dwattr $C$DW$249, DW_AT_name("ECAP1")
    3233                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_ECAP1")
    3234                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0f)
    3235                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    3236                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3237                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3238              
    3239              $C$DW$250       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   62

    3241                      .dwattr $C$DW$250, DW_AT_name("ECAP2")
    3242                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ECAP2")
    3243                      .dwattr $C$DW$250, DW_AT_bit_offset(0x0e)
    3244                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    3245                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3247              
    3248              $C$DW$251       .dwtag  DW_TAG_member
    3249                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3250                      .dwattr $C$DW$251, DW_AT_name("ECAP3")
    3251                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_ECAP3")
    3252                      .dwattr $C$DW$251, DW_AT_bit_offset(0x0d)
    3253                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    3254                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3255                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3256              
    3257              $C$DW$252       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3259                      .dwattr $C$DW$252, DW_AT_name("ECAP4")
    3260                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_ECAP4")
    3261                      .dwattr $C$DW$252, DW_AT_bit_offset(0x0c)
    3262                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    3263                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3264                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266              $C$DW$253       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3268                      .dwattr $C$DW$253, DW_AT_name("ECAP5")
    3269                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_ECAP5")
    3270                      .dwattr $C$DW$253, DW_AT_bit_offset(0x0b)
    3271                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    3272                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3273                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3274              
    3275              $C$DW$254       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3277                      .dwattr $C$DW$254, DW_AT_name("ECAP6")
    3278                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_ECAP6")
    3279                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0a)
    3280                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    3281                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284              $C$DW$255       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3286                      .dwattr $C$DW$255, DW_AT_name("rsvd1")
    3287                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_rsvd1")
    3288                      .dwattr $C$DW$255, DW_AT_bit_offset(0x09)
    3289                      .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    3290                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3292              
    3293              $C$DW$256       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3295                      .dwattr $C$DW$256, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   63

    3296                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd2")
    3297                      .dwattr $C$DW$256, DW_AT_bit_offset(0x08)
    3298                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3299                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3301              
    3302              $C$DW$257       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3304                      .dwattr $C$DW$257, DW_AT_name("rsvd3")
    3305                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd3")
    3306                      .dwattr $C$DW$257, DW_AT_bit_offset(0x00)
    3307                      .dwattr $C$DW$257, DW_AT_bit_size(0x08)
    3308                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3309                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3310              
    3311              $C$DW$258       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3313                      .dwattr $C$DW$258, DW_AT_name("rsvd4")
    3314                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd4")
    3315                      .dwattr $C$DW$258, DW_AT_bit_offset(0x00)
    3316                      .dwattr $C$DW$258, DW_AT_bit_size(0x10)
    3317                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3318                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3319              
    3320                      .dwendtag $C$DW$T$39
    3321              
    3322              
    3323              $C$DW$T$40      .dwtag  DW_TAG_union_type
    3324                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL1_REG")
    3325                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3326              $C$DW$259       .dwtag  DW_TAG_member
    3327                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    3328                      .dwattr $C$DW$259, DW_AT_name("all")
    3329                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_all")
    3330                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3331                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3332              
    3333              $C$DW$260       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$39)
    3335                      .dwattr $C$DW$260, DW_AT_name("bit")
    3336                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_bit")
    3337                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3338                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3339              
    3340                      .dwendtag $C$DW$T$40
    3341              
    3342              
    3343              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3344                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL2_BITS")
    3345                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3346              $C$DW$261       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3348                      .dwattr $C$DW$261, DW_AT_name("EQEP1")
    3349                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_EQEP1")
    3350                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   64

    3351                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    3352                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3354              
    3355              $C$DW$262       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3357                      .dwattr $C$DW$262, DW_AT_name("EQEP2")
    3358                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_EQEP2")
    3359                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0e)
    3360                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    3361                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3362                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3363              
    3364              $C$DW$263       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3366                      .dwattr $C$DW$263, DW_AT_name("EQEP3")
    3367                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_EQEP3")
    3368                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0d)
    3369                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    3370                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373              $C$DW$264       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3375                      .dwattr $C$DW$264, DW_AT_name("rsvd1")
    3376                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd1")
    3377                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0c)
    3378                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    3379                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3380                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3381              
    3382              $C$DW$265       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3384                      .dwattr $C$DW$265, DW_AT_name("rsvd2")
    3385                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd2")
    3386                      .dwattr $C$DW$265, DW_AT_bit_offset(0x00)
    3387                      .dwattr $C$DW$265, DW_AT_bit_size(0x0c)
    3388                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3389                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3390              
    3391              $C$DW$266       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3393                      .dwattr $C$DW$266, DW_AT_name("rsvd3")
    3394                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd3")
    3395                      .dwattr $C$DW$266, DW_AT_bit_offset(0x00)
    3396                      .dwattr $C$DW$266, DW_AT_bit_size(0x10)
    3397                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3398                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3399              
    3400                      .dwendtag $C$DW$T$41
    3401              
    3402              
    3403              $C$DW$T$42      .dwtag  DW_TAG_union_type
    3404                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL2_REG")
    3405                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   65

    3406              $C$DW$267       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    3408                      .dwattr $C$DW$267, DW_AT_name("all")
    3409                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_all")
    3410                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3411                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3412              
    3413              $C$DW$268       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$41)
    3415                      .dwattr $C$DW$268, DW_AT_name("bit")
    3416                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_bit")
    3417                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3418                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3419              
    3420                      .dwendtag $C$DW$T$42
    3421              
    3422              
    3423              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3424                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL4_BITS")
    3425                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3426              $C$DW$269       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3428                      .dwattr $C$DW$269, DW_AT_name("SD1")
    3429                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SD1")
    3430                      .dwattr $C$DW$269, DW_AT_bit_offset(0x0f)
    3431                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    3432                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3434              
    3435              $C$DW$270       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3437                      .dwattr $C$DW$270, DW_AT_name("SD2")
    3438                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_SD2")
    3439                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0e)
    3440                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    3441                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3443              
    3444              $C$DW$271       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3446                      .dwattr $C$DW$271, DW_AT_name("rsvd1")
    3447                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_rsvd1")
    3448                      .dwattr $C$DW$271, DW_AT_bit_offset(0x0d)
    3449                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    3450                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3451                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3452              
    3453              $C$DW$272       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    3455                      .dwattr $C$DW$272, DW_AT_name("rsvd2")
    3456                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_rsvd2")
    3457                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0c)
    3458                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    3459                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3460                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Emif.asm                                                     PAGE   66

    3461              
    3462              $C$DW$273       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3464                      .dwattr $C$DW$273, DW_AT_name("rsvd3")
    3465                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_rsvd3")
    3466                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0b)
    3467                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    3468                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3469                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3470              
    3471              $C$DW$274       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3473                      .dwattr $C$DW$274, DW_AT_name("rsvd4")
    3474                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_rsvd4")
    3475                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0a)
    3476                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    3477                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3479              
    3480              $C$DW$275       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    3482                      .dwattr $C$DW$275, DW_AT_name("rsvd5")
    3483                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_rsvd5")
    3484                      .dwattr $C$DW$275, DW_AT_bit_offset(0x09)
    3485                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    3486                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3487                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3488              
    3489              $C$DW$276       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3491                      .dwattr $C$DW$276, DW_AT_name("rsvd6")
    3492                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_rsvd6")
    3493                      .dwattr $C$DW$276, DW_AT_bit_offset(0x08)
    3494                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    3495                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3496                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3497              
    3498              $C$DW$277       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3500                      .dwattr $C$DW$277, DW_AT_name("rsvd7")
    3501                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_rsvd7")
    3502                      .dwattr $C$DW$277, DW_AT_bit_offset(0x00)
    3503                      .dwattr $C$DW$277, DW_AT_bit_size(0x08)
