TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:35 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_can.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("CanaRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CanaRegs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$110)

     112 0000002b 1EC4          MOVL      *+XAR4[0],ACC         ; [CPU_ALU] |59| 
     113                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 61,column 5,is_stmt,isa 0
     114 0000002c 8F00!         MOVL      XAR4,#_CanaRegs+300   ; [CPU_ARAU] |61| 
         0000002d 012C 
     115 0000002e 1EC4          MOVL      *+XAR4[0],ACC         ; [CPU_ALU] |61| 
     116                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 66,column 9,is_stmt,isa 0
     117 0000002f 56BF          MOVB      *-SP[3],#1,UNC        ; [CPU_ALU] |66| 
         00000030 0143 
     118                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 66,column 19,is_stmt,isa 0
     119 00000031 9243          MOV       AL,*-SP[3]            ; [CPU_ALU] |66| 
     120 00000032 5220          CMPB      AL,#32                ; [CPU_ALU] |66| 
     121 00000033 6213          B         $C$L4,GT              ; [CPU_ALU] |66| 
     122                      ; branchcc occurs ; [] |66| 
     123                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 71,column 9,is_stmt,isa 0
     124 00000034       $C$L2:    
     125 00000034 4F00!         TBIT      @_CanaRegs+256,#15    ; [CPU_ALU] |71| 
     126 00000035 6DFF          B         $C$L2,TC              ; [CPU_ALU] |71| 
     127                      ; branchcc occurs ; [] |71| 
     128                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 78,column 9,is_stmt,isa 0
     129 00000036 9243          MOV       AL,*-SP[3]            ; [CPU_ALU] |78| 
     130 00000037 9300!         MOV       AH,@_CanaRegs+256     ; [CPU_ALU] |78| 
     131 00000038 3CA8          MOVB      AH,AL.LSB             ; [CPU_ALU] |78| 
     132 00000039 9700!         MOV       @_CanaRegs+256,AH     ; [CPU_ALU] |78| 
     133                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 83,column 9,is_stmt,isa 0
     134 0000003a       $C$L3:    
     135 0000003a 4F20!         TBIT      @_CanaRegs+288,#15    ; [CPU_ALU] |83| 
     136 0000003b 6DFF          B         $C$L3,TC              ; [CPU_ALU] |83| 
     137                      ; branchcc occurs ; [] |83| 
     138                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 90,column 9,is_stmt,isa 0
     139 0000003c 9243          MOV       AL,*-SP[3]            ; [CPU_ALU] |90| 
     140 0000003d 9320!         MOV       AH,@_CanaRegs+288     ; [CPU_ALU] |90| 
     141 0000003e 9C01          ADDB      AL,#1                 ; [CPU_ALU] |90| 
     142 0000003f 3CA8          MOVB      AH,AL.LSB             ; [CPU_ALU] |90| 
     143 00000040 9720!         MOV       @_CanaRegs+288,AH     ; [CPU_ALU] |90| 
     144                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 66,column 31,is_stmt,isa 0
     145 00000041 0843          ADD       *-SP[3],#2            ; [CPU_ALU] |66| 
         00000042 0002 
     146                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 66,column 19,is_stmt,isa 0
     147 00000043 9243          MOV       AL,*-SP[3]            ; [CPU_ALU] |66| 
     148 00000044 5220          CMPB      AL,#32                ; [CPU_ALU] |66| 
     149 00000045 65EF          B         $C$L2,LEQ             ; [CPU_ALU] |66| 
     150                      ; branchcc occurs ; [] |66| 
     151 00000046       $C$L4:    
     152                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 96,column 35,is_stmt,isa 0
     153 00000046 8F00!         MOVL      XAR4,#_CanaRegs+4     ; [CPU_ARAU] |96| 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    4

         00000047 0004 
     154 00000048 06C4          MOVL      ACC,*+XAR4[0]         ; [CPU_ALU] |96| 
     155 00000049 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |96| 
     156                      .dwpsn  file "../F2837xD/F2837xD_can.c",line 98,column 1,is_stmt,isa 0
     157 0000004a FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
     158                      .dwcfi  cfa_offset, -2
     159              $C$DW$5 .dwtag  DW_TAG_TI_branch
     160                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     161                      .dwattr $C$DW$5, DW_AT_TI_return
     162              
     163 0000004b 0006          LRETR     ; [CPU_ALU] 
     164                      ; return occurs ; [] 
     165                      .dwattr $C$DW$2, DW_AT_TI_end_file("../F2837xD/F2837xD_can.c")
     166                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x62)
     167                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     168                      .dwendentry
     169                      .dwendtag $C$DW$2
     170              
     171              ;**************************************************************
     172              ;* UNDEFINED EXTERNAL REFERENCES                              *
     173              ;**************************************************************
     174                      .global _CanaRegs
     175              
     176              ;***************************************************************
     177              ;* TYPE INFORMATION                                            *
     178              ;***************************************************************
     179              
     180              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     181                      .dwattr $C$DW$T$23, DW_AT_name("CAN_BTR_BITS")
     182                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     183              $C$DW$6 .dwtag  DW_TAG_member
     184                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$20)
     185                      .dwattr $C$DW$6, DW_AT_name("BRP")
     186                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_BRP")
     187                      .dwattr $C$DW$6, DW_AT_bit_offset(0x1a)
     188                      .dwattr $C$DW$6, DW_AT_bit_size(0x06)
     189                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     190                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     191              
     192              $C$DW$7 .dwtag  DW_TAG_member
     193                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$20)
     194                      .dwattr $C$DW$7, DW_AT_name("SJW")
     195                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_SJW")
     196                      .dwattr $C$DW$7, DW_AT_bit_offset(0x18)
     197                      .dwattr $C$DW$7, DW_AT_bit_size(0x02)
     198                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     199                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     200              
     201              $C$DW$8 .dwtag  DW_TAG_member
     202                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$20)
     203                      .dwattr $C$DW$8, DW_AT_name("TSEG1")
     204                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_TSEG1")
     205                      .dwattr $C$DW$8, DW_AT_bit_offset(0x14)
     206                      .dwattr $C$DW$8, DW_AT_bit_size(0x04)
     207                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    5

     208                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     209              
     210              $C$DW$9 .dwtag  DW_TAG_member
     211                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     212                      .dwattr $C$DW$9, DW_AT_name("TSEG2")
     213                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_TSEG2")
     214                      .dwattr $C$DW$9, DW_AT_bit_offset(0x11)
     215                      .dwattr $C$DW$9, DW_AT_bit_size(0x03)
     216                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     217                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     218              
     219              $C$DW$10        .dwtag  DW_TAG_member
     220                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     221                      .dwattr $C$DW$10, DW_AT_name("rsvd1")
     222                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_rsvd1")
     223                      .dwattr $C$DW$10, DW_AT_bit_offset(0x10)
     224                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     225                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     226                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     227              
     228              $C$DW$11        .dwtag  DW_TAG_member
     229                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$22)
     230                      .dwattr $C$DW$11, DW_AT_name("BRPE")
     231                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_BRPE")
     232                      .dwattr $C$DW$11, DW_AT_bit_offset(0x2c)
     233                      .dwattr $C$DW$11, DW_AT_bit_size(0x04)
     234                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     235                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     236              
     237              $C$DW$12        .dwtag  DW_TAG_member
     238                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$22)
     239                      .dwattr $C$DW$12, DW_AT_name("rsvd2")
     240                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_rsvd2")
     241                      .dwattr $C$DW$12, DW_AT_bit_offset(0x20)
     242                      .dwattr $C$DW$12, DW_AT_bit_size(0x0c)
     243                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     244                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     245              
     246                      .dwendtag $C$DW$T$23
     247              
     248              
     249              $C$DW$T$24      .dwtag  DW_TAG_union_type
     250                      .dwattr $C$DW$T$24, DW_AT_name("CAN_BTR_REG")
     251                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     252              $C$DW$13        .dwtag  DW_TAG_member
     253                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$22)
     254                      .dwattr $C$DW$13, DW_AT_name("all")
     255                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_all")
     256                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     257                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     258              
     259              $C$DW$14        .dwtag  DW_TAG_member
     260                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$23)
     261                      .dwattr $C$DW$14, DW_AT_name("bit")
     262                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    6

     263                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     264                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     265              
     266                      .dwendtag $C$DW$T$24
     267              
     268              
     269              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     270                      .dwattr $C$DW$T$25, DW_AT_name("CAN_CTL_BITS")
     271                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     272              $C$DW$15        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     274                      .dwattr $C$DW$15, DW_AT_name("Init")
     275                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_Init")
     276                      .dwattr $C$DW$15, DW_AT_bit_offset(0x1f)
     277                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     278                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     279                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     280              
     281              $C$DW$16        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     283                      .dwattr $C$DW$16, DW_AT_name("IE0")
     284                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_IE0")
     285                      .dwattr $C$DW$16, DW_AT_bit_offset(0x1e)
     286                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     287                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     288                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     289              
     290              $C$DW$17        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     292                      .dwattr $C$DW$17, DW_AT_name("SIE")
     293                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_SIE")
     294                      .dwattr $C$DW$17, DW_AT_bit_offset(0x1d)
     295                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     296                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     298              
     299              $C$DW$18        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     301                      .dwattr $C$DW$18, DW_AT_name("EIE")
     302                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_EIE")
     303                      .dwattr $C$DW$18, DW_AT_bit_offset(0x1c)
     304                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     305                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     306                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     307              
     308              $C$DW$19        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     310                      .dwattr $C$DW$19, DW_AT_name("rsvd1")
     311                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd1")
     312                      .dwattr $C$DW$19, DW_AT_bit_offset(0x1b)
     313                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     314                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     315                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317              $C$DW$20        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    7

     318                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     319                      .dwattr $C$DW$20, DW_AT_name("DAR")
     320                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_DAR")
     321                      .dwattr $C$DW$20, DW_AT_bit_offset(0x1a)
     322                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     323                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     325              
     326              $C$DW$21        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     328                      .dwattr $C$DW$21, DW_AT_name("CCE")
     329                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_CCE")
     330                      .dwattr $C$DW$21, DW_AT_bit_offset(0x19)
     331                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     334              
     335              $C$DW$22        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     337                      .dwattr $C$DW$22, DW_AT_name("Test")
     338                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_Test")
     339                      .dwattr $C$DW$22, DW_AT_bit_offset(0x18)
     340                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     341                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     342                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     343              
     344              $C$DW$23        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     346                      .dwattr $C$DW$23, DW_AT_name("IDS")
     347                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_IDS")
     348                      .dwattr $C$DW$23, DW_AT_bit_offset(0x17)
     349                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     350                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     351                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     352              
     353              $C$DW$24        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     355                      .dwattr $C$DW$24, DW_AT_name("ABO")
     356                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_ABO")
     357                      .dwattr $C$DW$24, DW_AT_bit_offset(0x16)
     358                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     359                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$25        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     364                      .dwattr $C$DW$25, DW_AT_name("PMD")
     365                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_PMD")
     366                      .dwattr $C$DW$25, DW_AT_bit_offset(0x12)
     367                      .dwattr $C$DW$25, DW_AT_bit_size(0x04)
     368                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371              $C$DW$26        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    8

     373                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     374                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     375                      .dwattr $C$DW$26, DW_AT_bit_offset(0x11)
     376                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     377                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     378                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$27        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
     382                      .dwattr $C$DW$27, DW_AT_name("SWR")
     383                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_SWR")
     384                      .dwattr $C$DW$27, DW_AT_bit_offset(0x10)
     385                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     386                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$28        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$22)
     391                      .dwattr $C$DW$28, DW_AT_name("INITDBG")
     392                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INITDBG")
     393                      .dwattr $C$DW$28, DW_AT_bit_offset(0x2f)
     394                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     395                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     396                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     397              
     398              $C$DW$29        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     400                      .dwattr $C$DW$29, DW_AT_name("IE1")
     401                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_IE1")
     402                      .dwattr $C$DW$29, DW_AT_bit_offset(0x2e)
     403                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     404                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     405                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     406              
     407              $C$DW$30        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     409                      .dwattr $C$DW$30, DW_AT_name("rsvd3")
     410                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd3")
     411                      .dwattr $C$DW$30, DW_AT_bit_offset(0x2d)
     412                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     413                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     414                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416              $C$DW$31        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$22)
     418                      .dwattr $C$DW$31, DW_AT_name("rsvd4")
     419                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd4")
     420                      .dwattr $C$DW$31, DW_AT_bit_offset(0x2c)
     421                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     422                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     424              
     425              $C$DW$32        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     427                      .dwattr $C$DW$32, DW_AT_name("rsvd5")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE    9

     428                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd5")
     429                      .dwattr $C$DW$32, DW_AT_bit_offset(0x2b)
     430                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     431                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     432                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     433              
     434              $C$DW$33        .dwtag  DW_TAG_member
     435                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     436                      .dwattr $C$DW$33, DW_AT_name("rsvd6")
     437                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd6")
     438                      .dwattr $C$DW$33, DW_AT_bit_offset(0x28)
     439                      .dwattr $C$DW$33, DW_AT_bit_size(0x03)
     440                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     441                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     442              
     443              $C$DW$34        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     445                      .dwattr $C$DW$34, DW_AT_name("PDR")
     446                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_PDR")
     447                      .dwattr $C$DW$34, DW_AT_bit_offset(0x27)
     448                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     449                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$35        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     454                      .dwattr $C$DW$35, DW_AT_name("WUBA")
     455                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_WUBA")
     456                      .dwattr $C$DW$35, DW_AT_bit_offset(0x26)
     457                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     458                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461              $C$DW$36        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     463                      .dwattr $C$DW$36, DW_AT_name("rsvd7")
     464                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd7")
     465                      .dwattr $C$DW$36, DW_AT_bit_offset(0x20)
     466                      .dwattr $C$DW$36, DW_AT_bit_size(0x06)
     467                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     468                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     469              
     470                      .dwendtag $C$DW$T$25
     471              
     472              
     473              $C$DW$T$26      .dwtag  DW_TAG_union_type
     474                      .dwattr $C$DW$T$26, DW_AT_name("CAN_CTL_REG")
     475                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     476              $C$DW$37        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
     478                      .dwattr $C$DW$37, DW_AT_name("all")
     479                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_all")
     480                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     481                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     482              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   10

     483              $C$DW$38        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$25)
     485                      .dwattr $C$DW$38, DW_AT_name("bit")
     486                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bit")
     487                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     489              
     490                      .dwendtag $C$DW$T$26
     491              
     492              
     493              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     494                      .dwattr $C$DW$T$27, DW_AT_name("CAN_ERRC_BITS")
     495                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     496              $C$DW$39        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$20)
     498                      .dwattr $C$DW$39, DW_AT_name("TEC")
     499                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_TEC")
     500                      .dwattr $C$DW$39, DW_AT_bit_offset(0x18)
     501                      .dwattr $C$DW$39, DW_AT_bit_size(0x08)
     502                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     504              
     505              $C$DW$40        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
     507                      .dwattr $C$DW$40, DW_AT_name("REC")
     508                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_REC")
     509                      .dwattr $C$DW$40, DW_AT_bit_offset(0x11)
     510                      .dwattr $C$DW$40, DW_AT_bit_size(0x07)
     511                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     513              
     514              $C$DW$41        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     516                      .dwattr $C$DW$41, DW_AT_name("RP")
     517                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_RP")
     518                      .dwattr $C$DW$41, DW_AT_bit_offset(0x10)
     519                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     520                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$42        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
     525                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     526                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     527                      .dwattr $C$DW$42, DW_AT_bit_offset(0x20)
     528                      .dwattr $C$DW$42, DW_AT_bit_size(0x10)
     529                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532                      .dwendtag $C$DW$T$27
     533              
     534              
     535              $C$DW$T$28      .dwtag  DW_TAG_union_type
     536                      .dwattr $C$DW$T$28, DW_AT_name("CAN_ERRC_REG")
     537                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   11

     538              $C$DW$43        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
     540                      .dwattr $C$DW$43, DW_AT_name("all")
     541                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     542                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     544              
     545              $C$DW$44        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$27)
     547                      .dwattr $C$DW$44, DW_AT_name("bit")
     548                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     549                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     551              
     552                      .dwendtag $C$DW$T$28
     553              
     554              
     555              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     556                      .dwattr $C$DW$T$29, DW_AT_name("CAN_ES_BITS")
     557                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     558              $C$DW$45        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
     560                      .dwattr $C$DW$45, DW_AT_name("LEC")
     561                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_LEC")
     562                      .dwattr $C$DW$45, DW_AT_bit_offset(0x1d)
     563                      .dwattr $C$DW$45, DW_AT_bit_size(0x03)
     564                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567              $C$DW$46        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     569                      .dwattr $C$DW$46, DW_AT_name("TxOk")
     570                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_TxOk")
     571                      .dwattr $C$DW$46, DW_AT_bit_offset(0x1c)
     572                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     573                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576              $C$DW$47        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     578                      .dwattr $C$DW$47, DW_AT_name("RxOk")
     579                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_RxOk")
     580                      .dwattr $C$DW$47, DW_AT_bit_offset(0x1b)
     581                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     584              
     585              $C$DW$48        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     587                      .dwattr $C$DW$48, DW_AT_name("EPass")
     588                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_EPass")
     589                      .dwattr $C$DW$48, DW_AT_bit_offset(0x1a)
     590                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     591                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   12

     593              
     594              $C$DW$49        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     596                      .dwattr $C$DW$49, DW_AT_name("EWarn")
     597                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_EWarn")
     598                      .dwattr $C$DW$49, DW_AT_bit_offset(0x19)
     599                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     600                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603              $C$DW$50        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     605                      .dwattr $C$DW$50, DW_AT_name("BOff")
     606                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_BOff")
     607                      .dwattr $C$DW$50, DW_AT_bit_offset(0x18)
     608                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     609                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     611              
     612              $C$DW$51        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
     614                      .dwattr $C$DW$51, DW_AT_name("PER")
     615                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PER")
     616                      .dwattr $C$DW$51, DW_AT_bit_offset(0x17)
     617                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     618                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621              $C$DW$52        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     623                      .dwattr $C$DW$52, DW_AT_name("WakeUpPnd")
     624                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_WakeUpPnd")
     625                      .dwattr $C$DW$52, DW_AT_bit_offset(0x16)
     626                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     627                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     628                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     629              
     630              $C$DW$53        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     632                      .dwattr $C$DW$53, DW_AT_name("PDA")
     633                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PDA")
     634                      .dwattr $C$DW$53, DW_AT_bit_offset(0x15)
     635                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     636                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     638              
     639              $C$DW$54        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     641                      .dwattr $C$DW$54, DW_AT_name("rsvd1")
     642                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd1")
     643                      .dwattr $C$DW$54, DW_AT_bit_offset(0x10)
     644                      .dwattr $C$DW$54, DW_AT_bit_size(0x05)
     645                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     647              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   13

     648              $C$DW$55        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
     650                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     651                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     652                      .dwattr $C$DW$55, DW_AT_bit_offset(0x20)
     653                      .dwattr $C$DW$55, DW_AT_bit_size(0x10)
     654                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657                      .dwendtag $C$DW$T$29
     658              
     659              
     660              $C$DW$T$30      .dwtag  DW_TAG_union_type
     661                      .dwattr $C$DW$T$30, DW_AT_name("CAN_ES_REG")
     662                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     663              $C$DW$56        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
     665                      .dwattr $C$DW$56, DW_AT_name("all")
     666                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     667                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670              $C$DW$57        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$29)
     672                      .dwattr $C$DW$57, DW_AT_name("bit")
     673                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     674                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     676              
     677                      .dwendtag $C$DW$T$30
     678              
     679              
     680              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     681                      .dwattr $C$DW$T$31, DW_AT_name("CAN_GLB_INT_CLR_BITS")
     682                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     683              $C$DW$58        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     685                      .dwattr $C$DW$58, DW_AT_name("INT0_FLG_CLR")
     686                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_INT0_FLG_CLR")
     687                      .dwattr $C$DW$58, DW_AT_bit_offset(0x1f)
     688                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$59        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     694                      .dwattr $C$DW$59, DW_AT_name("INT1_FLG_CLR")
     695                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_INT1_FLG_CLR")
     696                      .dwattr $C$DW$59, DW_AT_bit_offset(0x1e)
     697                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     698                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$60        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   14

     703                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
     704                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
     705                      .dwattr $C$DW$60, DW_AT_bit_offset(0x10)
     706                      .dwattr $C$DW$60, DW_AT_bit_size(0x0e)
     707                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     709              
     710              $C$DW$61        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
     712                      .dwattr $C$DW$61, DW_AT_name("rsvd2")
     713                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd2")
     714                      .dwattr $C$DW$61, DW_AT_bit_offset(0x20)
     715                      .dwattr $C$DW$61, DW_AT_bit_size(0x10)
     716                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719                      .dwendtag $C$DW$T$31
     720              
     721              
     722              $C$DW$T$32      .dwtag  DW_TAG_union_type
     723                      .dwattr $C$DW$T$32, DW_AT_name("CAN_GLB_INT_CLR_REG")
     724                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
     725              $C$DW$62        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
     727                      .dwattr $C$DW$62, DW_AT_name("all")
     728                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     729                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732              $C$DW$63        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$31)
     734                      .dwattr $C$DW$63, DW_AT_name("bit")
     735                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     736                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739                      .dwendtag $C$DW$T$32
     740              
     741              
     742              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     743                      .dwattr $C$DW$T$33, DW_AT_name("CAN_GLB_INT_EN_BITS")
     744                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
     745              $C$DW$64        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     747                      .dwattr $C$DW$64, DW_AT_name("GLBINT0_EN")
     748                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GLBINT0_EN")
     749                      .dwattr $C$DW$64, DW_AT_bit_offset(0x1f)
     750                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     751                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     753              
     754              $C$DW$65        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     756                      .dwattr $C$DW$65, DW_AT_name("GLBINT1_EN")
     757                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GLBINT1_EN")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   15

     758                      .dwattr $C$DW$65, DW_AT_bit_offset(0x1e)
     759                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     760                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$66        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     765                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
     766                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
     767                      .dwattr $C$DW$66, DW_AT_bit_offset(0x10)
     768                      .dwattr $C$DW$66, DW_AT_bit_size(0x0e)
     769                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$67        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
     774                      .dwattr $C$DW$67, DW_AT_name("rsvd2")
     775                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd2")
     776                      .dwattr $C$DW$67, DW_AT_bit_offset(0x20)
     777                      .dwattr $C$DW$67, DW_AT_bit_size(0x10)
     778                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781                      .dwendtag $C$DW$T$33
     782              
     783              
     784              $C$DW$T$34      .dwtag  DW_TAG_union_type
     785                      .dwattr $C$DW$T$34, DW_AT_name("CAN_GLB_INT_EN_REG")
     786                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
     787              $C$DW$68        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
     789                      .dwattr $C$DW$68, DW_AT_name("all")
     790                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     791                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794              $C$DW$69        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$33)
     796                      .dwattr $C$DW$69, DW_AT_name("bit")
     797                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     798                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801                      .dwendtag $C$DW$T$34
     802              
     803              
     804              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     805                      .dwattr $C$DW$T$35, DW_AT_name("CAN_GLB_INT_FLG_BITS")
     806                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     807              $C$DW$70        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
     809                      .dwattr $C$DW$70, DW_AT_name("Name")
     810                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Name")
     811                      .dwattr $C$DW$70, DW_AT_bit_offset(0x1f)
     812                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   16

     813                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$71        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
     818                      .dwattr $C$DW$71, DW_AT_name("INT1_FLG")
     819                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_INT1_FLG")
     820                      .dwattr $C$DW$71, DW_AT_bit_offset(0x1e)
     821                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$72        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
     827                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
     828                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
     829                      .dwattr $C$DW$72, DW_AT_bit_offset(0x10)
     830                      .dwattr $C$DW$72, DW_AT_bit_size(0x0e)
     831                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$73        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
     836                      .dwattr $C$DW$73, DW_AT_name("rsvd2")
     837                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd2")
     838                      .dwattr $C$DW$73, DW_AT_bit_offset(0x20)
     839                      .dwattr $C$DW$73, DW_AT_bit_size(0x10)
     840                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843                      .dwendtag $C$DW$T$35
     844              
     845              
     846              $C$DW$T$36      .dwtag  DW_TAG_union_type
     847                      .dwattr $C$DW$T$36, DW_AT_name("CAN_GLB_INT_FLG_REG")
     848                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
     849              $C$DW$74        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
     851                      .dwattr $C$DW$74, DW_AT_name("all")
     852                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     853                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$75        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$35)
     858                      .dwattr $C$DW$75, DW_AT_name("bit")
     859                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     860                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     862              
     863                      .dwendtag $C$DW$T$36
     864              
     865              
     866              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     867                      .dwattr $C$DW$T$37, DW_AT_name("CAN_IF1ARB_BITS")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   17

     868                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
     869              $C$DW$76        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
     871                      .dwattr $C$DW$76, DW_AT_name("ID")
     872                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ID")
     873                      .dwattr $C$DW$76, DW_AT_bit_offset(0x23)
     874                      .dwattr $C$DW$76, DW_AT_bit_size(0x1d)
     875                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     877              
     878              $C$DW$77        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
     880                      .dwattr $C$DW$77, DW_AT_name("Dir")
     881                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Dir")
     882                      .dwattr $C$DW$77, DW_AT_bit_offset(0x22)
     883                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     886              
     887              $C$DW$78        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
     889                      .dwattr $C$DW$78, DW_AT_name("Xtd")
     890                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Xtd")
     891                      .dwattr $C$DW$78, DW_AT_bit_offset(0x21)
     892                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     893                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896              $C$DW$79        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
     898                      .dwattr $C$DW$79, DW_AT_name("MsgVal")
     899                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_MsgVal")
     900                      .dwattr $C$DW$79, DW_AT_bit_offset(0x20)
     901                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     902                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     904              
     905                      .dwendtag $C$DW$T$37
     906              
     907              
     908              $C$DW$T$38      .dwtag  DW_TAG_union_type
     909                      .dwattr $C$DW$T$38, DW_AT_name("CAN_IF1ARB_REG")
     910                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
     911              $C$DW$80        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
     913                      .dwattr $C$DW$80, DW_AT_name("all")
     914                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     915                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     917              
     918              $C$DW$81        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$37)
     920                      .dwattr $C$DW$81, DW_AT_name("bit")
     921                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     922                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   18

     923                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     924              
     925                      .dwendtag $C$DW$T$38
     926              
     927              
     928              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     929                      .dwattr $C$DW$T$39, DW_AT_name("CAN_IF1CMD_BITS")
     930                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
     931              $C$DW$82        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
     933                      .dwattr $C$DW$82, DW_AT_name("MSG_NUM")
     934                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_MSG_NUM")
     935                      .dwattr $C$DW$82, DW_AT_bit_offset(0x18)
     936                      .dwattr $C$DW$82, DW_AT_bit_size(0x08)
     937                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     939              
     940              $C$DW$83        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     942                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
     943                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
     944                      .dwattr $C$DW$83, DW_AT_bit_offset(0x12)
     945                      .dwattr $C$DW$83, DW_AT_bit_size(0x06)
     946                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$84        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     951                      .dwattr $C$DW$84, DW_AT_name("rsvd2")
     952                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd2")
     953                      .dwattr $C$DW$84, DW_AT_bit_offset(0x11)
     954                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     955                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$85        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     960                      .dwattr $C$DW$85, DW_AT_name("Busy")
     961                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Busy")
     962                      .dwattr $C$DW$85, DW_AT_bit_offset(0x10)
     963                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967              $C$DW$86        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
     969                      .dwattr $C$DW$86, DW_AT_name("DATA_B")
     970                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_DATA_B")
     971                      .dwattr $C$DW$86, DW_AT_bit_offset(0x2f)
     972                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     973                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$87        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   19

     978                      .dwattr $C$DW$87, DW_AT_name("DATA_A")
     979                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_DATA_A")
     980                      .dwattr $C$DW$87, DW_AT_bit_offset(0x2e)
     981                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     982                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$88        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
     987                      .dwattr $C$DW$88, DW_AT_name("TXRQST")
     988                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_TXRQST")
     989                      .dwattr $C$DW$88, DW_AT_bit_offset(0x2d)
     990                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     991                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$89        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
     996                      .dwattr $C$DW$89, DW_AT_name("ClrIntPnd")
     997                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ClrIntPnd")
     998                      .dwattr $C$DW$89, DW_AT_bit_offset(0x2c)
     999                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1000                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003              $C$DW$90        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
    1005                      .dwattr $C$DW$90, DW_AT_name("Control")
    1006                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Control")
    1007                      .dwattr $C$DW$90, DW_AT_bit_offset(0x2b)
    1008                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1011              
    1012              $C$DW$91        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    1014                      .dwattr $C$DW$91, DW_AT_name("Arb")
    1015                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Arb")
    1016                      .dwattr $C$DW$91, DW_AT_bit_offset(0x2a)
    1017                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1018                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021              $C$DW$92        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
    1023                      .dwattr $C$DW$92, DW_AT_name("Mask")
    1024                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Mask")
    1025                      .dwattr $C$DW$92, DW_AT_bit_offset(0x29)
    1026                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$93        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
    1032                      .dwattr $C$DW$93, DW_AT_name("DIR")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   20

    1033                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_DIR")
    1034                      .dwattr $C$DW$93, DW_AT_bit_offset(0x28)
    1035                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039              $C$DW$94        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    1041                      .dwattr $C$DW$94, DW_AT_name("rsvd3")
    1042                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd3")
    1043                      .dwattr $C$DW$94, DW_AT_bit_offset(0x20)
    1044                      .dwattr $C$DW$94, DW_AT_bit_size(0x08)
    1045                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048                      .dwendtag $C$DW$T$39
    1049              
    1050              
    1051              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1052                      .dwattr $C$DW$T$40, DW_AT_name("CAN_IF1CMD_REG")
    1053                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1054              $C$DW$95        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
    1056                      .dwattr $C$DW$95, DW_AT_name("all")
    1057                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1058                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$96        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$39)
    1063                      .dwattr $C$DW$96, DW_AT_name("bit")
    1064                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1065                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068                      .dwendtag $C$DW$T$40
    1069              
    1070              
    1071              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1072                      .dwattr $C$DW$T$41, DW_AT_name("CAN_IF1DATA_BITS")
    1073                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1074              $C$DW$97        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1076                      .dwattr $C$DW$97, DW_AT_name("Data_0")
    1077                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Data_0")
    1078                      .dwattr $C$DW$97, DW_AT_bit_offset(0x18)
    1079                      .dwattr $C$DW$97, DW_AT_bit_size(0x08)
    1080                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$98        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1085                      .dwattr $C$DW$98, DW_AT_name("Data_1")
    1086                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Data_1")
    1087                      .dwattr $C$DW$98, DW_AT_bit_offset(0x10)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   21

    1088                      .dwattr $C$DW$98, DW_AT_bit_size(0x08)
    1089                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$99        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
    1094                      .dwattr $C$DW$99, DW_AT_name("Data_2")
    1095                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Data_2")
    1096                      .dwattr $C$DW$99, DW_AT_bit_offset(0x28)
    1097                      .dwattr $C$DW$99, DW_AT_bit_size(0x08)
    1098                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$100       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    1103                      .dwattr $C$DW$100, DW_AT_name("Data_3")
    1104                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Data_3")
    1105                      .dwattr $C$DW$100, DW_AT_bit_offset(0x20)
    1106                      .dwattr $C$DW$100, DW_AT_bit_size(0x08)
    1107                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110                      .dwendtag $C$DW$T$41
    1111              
    1112              
    1113              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1114                      .dwattr $C$DW$T$42, DW_AT_name("CAN_IF1DATA_REG")
    1115                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1116              $C$DW$101       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1118                      .dwattr $C$DW$101, DW_AT_name("all")
    1119                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1120                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$102       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$41)
    1125                      .dwattr $C$DW$102, DW_AT_name("bit")
    1126                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1127                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1129              
    1130                      .dwendtag $C$DW$T$42
    1131              
    1132              
    1133              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1134                      .dwattr $C$DW$T$43, DW_AT_name("CAN_IF1DATB_BITS")
    1135                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    1136              $C$DW$103       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1138                      .dwattr $C$DW$103, DW_AT_name("Data_4")
    1139                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Data_4")
    1140                      .dwattr $C$DW$103, DW_AT_bit_offset(0x18)
    1141                      .dwattr $C$DW$103, DW_AT_bit_size(0x08)
    1142                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   22

    1143                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$104       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1147                      .dwattr $C$DW$104, DW_AT_name("Data_5")
    1148                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Data_5")
    1149                      .dwattr $C$DW$104, DW_AT_bit_offset(0x10)
    1150                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    1151                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$105       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    1156                      .dwattr $C$DW$105, DW_AT_name("Data_6")
    1157                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Data_6")
    1158                      .dwattr $C$DW$105, DW_AT_bit_offset(0x28)
    1159                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    1160                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$106       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
    1165                      .dwattr $C$DW$106, DW_AT_name("Data_7")
    1166                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Data_7")
    1167                      .dwattr $C$DW$106, DW_AT_bit_offset(0x20)
    1168                      .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    1169                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172                      .dwendtag $C$DW$T$43
    1173              
    1174              
    1175              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1176                      .dwattr $C$DW$T$44, DW_AT_name("CAN_IF1DATB_REG")
    1177                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1178              $C$DW$107       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$22)
    1180                      .dwattr $C$DW$107, DW_AT_name("all")
    1181                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    1182                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$108       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$43)
    1187                      .dwattr $C$DW$108, DW_AT_name("bit")
    1188                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    1189                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192                      .dwendtag $C$DW$T$44
    1193              
    1194              
    1195              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1196                      .dwattr $C$DW$T$45, DW_AT_name("CAN_IF1MCTL_BITS")
    1197                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   23

    1198              $C$DW$109       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1200                      .dwattr $C$DW$109, DW_AT_name("DLC")
    1201                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DLC")
    1202                      .dwattr $C$DW$109, DW_AT_bit_offset(0x1c)
    1203                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1204                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$110       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1209                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1210                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1211                      .dwattr $C$DW$110, DW_AT_bit_offset(0x19)
    1212                      .dwattr $C$DW$110, DW_AT_bit_size(0x03)
    1213                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$111       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1218                      .dwattr $C$DW$111, DW_AT_name("EoB")
    1219                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_EoB")
    1220                      .dwattr $C$DW$111, DW_AT_bit_offset(0x18)
    1221                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$112       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1227                      .dwattr $C$DW$112, DW_AT_name("TxRqst")
    1228                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_TxRqst")
    1229                      .dwattr $C$DW$112, DW_AT_bit_offset(0x17)
    1230                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$113       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    1236                      .dwattr $C$DW$113, DW_AT_name("RmtEn")
    1237                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RmtEn")
    1238                      .dwattr $C$DW$113, DW_AT_bit_offset(0x16)
    1239                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$114       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1245                      .dwattr $C$DW$114, DW_AT_name("RxIE")
    1246                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_RxIE")
    1247                      .dwattr $C$DW$114, DW_AT_bit_offset(0x15)
    1248                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$115       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   24

    1253                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1254                      .dwattr $C$DW$115, DW_AT_name("TxIE")
    1255                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_TxIE")
    1256                      .dwattr $C$DW$115, DW_AT_bit_offset(0x14)
    1257                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$116       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1263                      .dwattr $C$DW$116, DW_AT_name("UMask")
    1264                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_UMask")
    1265                      .dwattr $C$DW$116, DW_AT_bit_offset(0x13)
    1266                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$117       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1272                      .dwattr $C$DW$117, DW_AT_name("IntPnd")
    1273                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IntPnd")
    1274                      .dwattr $C$DW$117, DW_AT_bit_offset(0x12)
    1275                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$118       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1281                      .dwattr $C$DW$118, DW_AT_name("MsgLst")
    1282                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_MsgLst")
    1283                      .dwattr $C$DW$118, DW_AT_bit_offset(0x11)
    1284                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$119       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1290                      .dwattr $C$DW$119, DW_AT_name("NewDat")
    1291                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_NewDat")
    1292                      .dwattr $C$DW$119, DW_AT_bit_offset(0x10)
    1293                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$120       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$22)
    1299                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    1300                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    1301                      .dwattr $C$DW$120, DW_AT_bit_offset(0x20)
    1302                      .dwattr $C$DW$120, DW_AT_bit_size(0x10)
    1303                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306                      .dwendtag $C$DW$T$45
    1307              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   25

    1308              
    1309              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1310                      .dwattr $C$DW$T$46, DW_AT_name("CAN_IF1MCTL_REG")
    1311                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1312              $C$DW$121       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$22)
    1314                      .dwattr $C$DW$121, DW_AT_name("all")
    1315                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1316                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1318              
    1319              $C$DW$122       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$45)
    1321                      .dwattr $C$DW$122, DW_AT_name("bit")
    1322                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1323                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326                      .dwendtag $C$DW$T$46
    1327              
    1328              
    1329              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1330                      .dwattr $C$DW$T$47, DW_AT_name("CAN_IF1MSK_BITS")
    1331                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    1332              $C$DW$123       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$22)
    1334                      .dwattr $C$DW$123, DW_AT_name("Msk")
    1335                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Msk")
    1336                      .dwattr $C$DW$123, DW_AT_bit_offset(0x23)
    1337                      .dwattr $C$DW$123, DW_AT_bit_size(0x1d)
    1338                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$124       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$22)
    1343                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1344                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1345                      .dwattr $C$DW$124, DW_AT_bit_offset(0x22)
    1346                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$125       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
    1352                      .dwattr $C$DW$125, DW_AT_name("MDir")
    1353                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_MDir")
    1354                      .dwattr $C$DW$125, DW_AT_bit_offset(0x21)
    1355                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$126       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$22)
    1361                      .dwattr $C$DW$126, DW_AT_name("MXtd")
    1362                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_MXtd")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   26

    1363                      .dwattr $C$DW$126, DW_AT_bit_offset(0x20)
    1364                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368                      .dwendtag $C$DW$T$47
    1369              
    1370              
    1371              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1372                      .dwattr $C$DW$T$48, DW_AT_name("CAN_IF1MSK_REG")
    1373                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1374              $C$DW$127       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$22)
    1376                      .dwattr $C$DW$127, DW_AT_name("all")
    1377                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1378                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$128       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$47)
    1383                      .dwattr $C$DW$128, DW_AT_name("bit")
    1384                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1385                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388                      .dwendtag $C$DW$T$48
    1389              
    1390              
    1391              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1392                      .dwattr $C$DW$T$49, DW_AT_name("CAN_IF2ARB_BITS")
    1393                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    1394              $C$DW$129       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    1396                      .dwattr $C$DW$129, DW_AT_name("ID")
    1397                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ID")
    1398                      .dwattr $C$DW$129, DW_AT_bit_offset(0x23)
    1399                      .dwattr $C$DW$129, DW_AT_bit_size(0x1d)
    1400                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$130       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    1405                      .dwattr $C$DW$130, DW_AT_name("Dir")
    1406                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Dir")
    1407                      .dwattr $C$DW$130, DW_AT_bit_offset(0x22)
    1408                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$131       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
    1414                      .dwattr $C$DW$131, DW_AT_name("Xtd")
    1415                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Xtd")
    1416                      .dwattr $C$DW$131, DW_AT_bit_offset(0x21)
    1417                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   27

    1418                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$132       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$22)
    1423                      .dwattr $C$DW$132, DW_AT_name("MsgVal")
    1424                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MsgVal")
    1425                      .dwattr $C$DW$132, DW_AT_bit_offset(0x20)
    1426                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430                      .dwendtag $C$DW$T$49
    1431              
    1432              
    1433              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1434                      .dwattr $C$DW$T$50, DW_AT_name("CAN_IF2ARB_REG")
    1435                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1436              $C$DW$133       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$22)
    1438                      .dwattr $C$DW$133, DW_AT_name("all")
    1439                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1440                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$134       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$49)
    1445                      .dwattr $C$DW$134, DW_AT_name("bit")
    1446                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1447                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450                      .dwendtag $C$DW$T$50
    1451              
    1452              
    1453              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1454                      .dwattr $C$DW$T$51, DW_AT_name("CAN_IF2CMD_BITS")
    1455                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    1456              $C$DW$135       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1458                      .dwattr $C$DW$135, DW_AT_name("MSG_NUM")
    1459                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_MSG_NUM")
    1460                      .dwattr $C$DW$135, DW_AT_bit_offset(0x18)
    1461                      .dwattr $C$DW$135, DW_AT_bit_size(0x08)
    1462                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$136       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1467                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1468                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    1469                      .dwattr $C$DW$136, DW_AT_bit_offset(0x12)
    1470                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    1471                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_can.asm                                                      PAGE   28

    1473              
    1474              $C$DW$137       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1476                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    1477                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    1478                      .dwattr $C$DW$137, DW_AT_bit_offset(0x11)
    1479                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$138       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1485                      .dwattr $C$DW$138, DW_AT_name("Busy")
    1486                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Busy")
    1487                      .dwattr $C$DW$138, DW_AT_bit_offset(0x10)
    1488                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
