TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:26 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_I2C.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioCtrlRegs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$252)

     275 00000083 1A02!         OR        @_GpioCtrlRegs+130,#0x0030 ; [CPU_ALU] |246| 
         00000084 0030 
     276                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 247,column 13,is_stmt,isa 0
     277 00000085 1A02!         OR        @_GpioCtrlRegs+130,#0x0c00 ; [CPU_ALU] |247| 
         00000086 0C00 
     278                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 253,column 13,is_stmt,isa 0
     279 00000087 CC20!         AND       AL,@_GpioCtrlRegs+160,#0xffcf ; [CPU_ALU] |253| 
         00000088 FFCF 
     280 00000089 5010          ORB       AL,#0x10              ; [CPU_ALU] |253| 
     281 0000008a 9620!         MOV       @_GpioCtrlRegs+160,AL ; [CPU_ALU] |253| 
     282                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 254,column 13,is_stmt,isa 0
     283 0000008b CC06!         AND       AL,@_GpioCtrlRegs+134,#0xffcf ; [CPU_ALU] |254| 
         0000008c FFCF 
     284 0000008d 5020          ORB       AL,#0x20              ; [CPU_ALU] |254| 
     285 0000008e 9606!         MOV       @_GpioCtrlRegs+134,AL ; [CPU_ALU] |254| 
     286                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 256,column 13,is_stmt,isa 0
     287 0000008f CC20!         AND       AL,@_GpioCtrlRegs+160,#0xf3ff ; [CPU_ALU] |256| 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE    7

         00000090 F3FF 
     288 00000091 1AA9          OR        AL,#0x0400            ; [CPU_ALU] |256| 
         00000092 0400 
     289 00000093 9620!         MOV       @_GpioCtrlRegs+160,AL ; [CPU_ALU] |256| 
     290                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 257,column 13,is_stmt,isa 0
     291 00000094 CC06!         AND       AL,@_GpioCtrlRegs+134,#0xf3ff ; [CPU_ALU] |257| 
         00000095 F3FF 
     292 00000096 1AA9          OR        AL,#0x0800            ; [CPU_ALU] |257| 
         00000097 0800 
     293 00000098 9606!         MOV       @_GpioCtrlRegs+134,AL ; [CPU_ALU] |257| 
     294                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 258,column 13,is_stmt,isa 0
     295 00000099 6F09          B         $C$L10,UNC            ; [CPU_ALU] |258| 
     296                      ; branch occurs ; [] |258| 
     297 0000009a       $C$L9:    
     298                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 172,column 5,is_stmt,isa 0
     299 0000009a 5201          CMPB      AL,#1                 ; [CPU_ALU] |172| 
     300 0000009b 61C7          B         $C$L7,EQ              ; [CPU_ALU] |172| 
     301                      ; branchcc occurs ; [] |172| 
     302 0000009c 5202          CMPB      AL,#2                 ; [CPU_ALU] |172| 
     303 0000009d 6105          B         $C$L10,EQ             ; [CPU_ALU] |172| 
     304                      ; branchcc occurs ; [] |172| 
     305 0000009e 5203          CMPB      AL,#3                 ; [CPU_ALU] |172| 
     306 0000009f 6103          B         $C$L10,EQ             ; [CPU_ALU] |172| 
     307                      ; branchcc occurs ; [] |172| 
     308 000000a0 5204          CMPB      AL,#4                 ; [CPU_ALU] |172| 
     309 000000a1 61DC          B         $C$L8,EQ              ; [CPU_ALU] |172| 
     310                      ; branchcc occurs ; [] |172| 
     311 000000a2       $C$L10:    
     312                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 264,column 5,is_stmt,isa 0
     313 000000a2 761A   EDIS
     314                      .dwpsn  file "../F2837xD/F2837xD_I2C.c",line 265,column 1,is_stmt,isa 0
     315 000000a3 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     316                      .dwcfi  cfa_offset, -2
     317 000000a4 FF69          SPM       #0                    ; [CPU_ALU] 
     318              $C$DW$9 .dwtag  DW_TAG_TI_branch
     319                      .dwattr $C$DW$9, DW_AT_low_pc(0x00)
     320                      .dwattr $C$DW$9, DW_AT_TI_return
     321              
     322 000000a5 0006          LRETR     ; [CPU_ALU] 
     323                      ; return occurs ; [] 
     324                      .dwattr $C$DW$6, DW_AT_TI_end_file("../F2837xD/F2837xD_I2C.c")
     325                      .dwattr $C$DW$6, DW_AT_TI_end_line(0x109)
     326                      .dwattr $C$DW$6, DW_AT_TI_end_column(0x01)
     327                      .dwendentry
     328                      .dwendtag $C$DW$6
     329              
     330              ;**************************************************************
     331              ;* UNDEFINED EXTERNAL REFERENCES                              *
     332              ;**************************************************************
     333                      .global _GpioCtrlRegs
     334              
     335              ;***************************************************************
     336              ;* TYPE INFORMATION                                            *
     337              ;***************************************************************
     338              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE    8

     339              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     340                      .dwattr $C$DW$T$20, DW_AT_name("GPACR_BITS")
     341                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     342              $C$DW$10        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     344                      .dwattr $C$DW$10, DW_AT_name("GPIO0")
     345                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_GPIO0")
     346                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0f)
     347                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     348                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     350              
     351              $C$DW$11        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     353                      .dwattr $C$DW$11, DW_AT_name("GPIO1")
     354                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_GPIO1")
     355                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0e)
     356                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     357                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     358                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     359              
     360              $C$DW$12        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     362                      .dwattr $C$DW$12, DW_AT_name("GPIO2")
     363                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_GPIO2")
     364                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0d)
     365                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     366                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     367                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$13        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$13, DW_AT_name("GPIO3")
     372                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_GPIO3")
     373                      .dwattr $C$DW$13, DW_AT_bit_offset(0x0c)
     374                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     375                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     377              
     378              $C$DW$14        .dwtag  DW_TAG_member
     379                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     380                      .dwattr $C$DW$14, DW_AT_name("GPIO4")
     381                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_GPIO4")
     382                      .dwattr $C$DW$14, DW_AT_bit_offset(0x0b)
     383                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     384                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     385                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     386              
     387              $C$DW$15        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$15, DW_AT_name("GPIO5")
     390                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_GPIO5")
     391                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0a)
     392                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     393                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE    9

     394                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396              $C$DW$16        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     398                      .dwattr $C$DW$16, DW_AT_name("GPIO6")
     399                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_GPIO6")
     400                      .dwattr $C$DW$16, DW_AT_bit_offset(0x09)
     401                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     402                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     403                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     404              
     405              $C$DW$17        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     407                      .dwattr $C$DW$17, DW_AT_name("GPIO7")
     408                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_GPIO7")
     409                      .dwattr $C$DW$17, DW_AT_bit_offset(0x08)
     410                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     411                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     412                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     413              
     414              $C$DW$18        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     416                      .dwattr $C$DW$18, DW_AT_name("GPIO8")
     417                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_GPIO8")
     418                      .dwattr $C$DW$18, DW_AT_bit_offset(0x07)
     419                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     420                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     422              
     423              $C$DW$19        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$19, DW_AT_name("GPIO9")
     426                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_GPIO9")
     427                      .dwattr $C$DW$19, DW_AT_bit_offset(0x06)
     428                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     429                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     431              
     432              $C$DW$20        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     434                      .dwattr $C$DW$20, DW_AT_name("GPIO10")
     435                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_GPIO10")
     436                      .dwattr $C$DW$20, DW_AT_bit_offset(0x05)
     437                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     438                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     440              
     441              $C$DW$21        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     443                      .dwattr $C$DW$21, DW_AT_name("GPIO11")
     444                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_GPIO11")
     445                      .dwattr $C$DW$21, DW_AT_bit_offset(0x04)
     446                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     447                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   10

     449              
     450              $C$DW$22        .dwtag  DW_TAG_member
     451                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     452                      .dwattr $C$DW$22, DW_AT_name("GPIO12")
     453                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_GPIO12")
     454                      .dwattr $C$DW$22, DW_AT_bit_offset(0x03)
     455                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     456                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     457                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     458              
     459              $C$DW$23        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$23, DW_AT_name("GPIO13")
     462                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_GPIO13")
     463                      .dwattr $C$DW$23, DW_AT_bit_offset(0x02)
     464                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     465                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     466                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     467              
     468              $C$DW$24        .dwtag  DW_TAG_member
     469                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     470                      .dwattr $C$DW$24, DW_AT_name("GPIO14")
     471                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GPIO14")
     472                      .dwattr $C$DW$24, DW_AT_bit_offset(0x01)
     473                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     474                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     475                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     476              
     477              $C$DW$25        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$25, DW_AT_name("GPIO15")
     480                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GPIO15")
     481                      .dwattr $C$DW$25, DW_AT_bit_offset(0x00)
     482                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     483                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     485              
     486              $C$DW$26        .dwtag  DW_TAG_member
     487                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     488                      .dwattr $C$DW$26, DW_AT_name("GPIO16")
     489                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_GPIO16")
     490                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0f)
     491                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     492                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     493                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495              $C$DW$27        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$27, DW_AT_name("GPIO17")
     498                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIO17")
     499                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0e)
     500                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     501                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     502                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     503              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   11

     504              $C$DW$28        .dwtag  DW_TAG_member
     505                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     506                      .dwattr $C$DW$28, DW_AT_name("GPIO18")
     507                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIO18")
     508                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d)
     509                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     510                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     511                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     512              
     513              $C$DW$29        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$29, DW_AT_name("GPIO19")
     516                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO19")
     517                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     518                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     519                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     520                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522              $C$DW$30        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     524                      .dwattr $C$DW$30, DW_AT_name("GPIO20")
     525                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO20")
     526                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     527                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     528                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     529                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     530              
     531              $C$DW$31        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     533                      .dwattr $C$DW$31, DW_AT_name("GPIO21")
     534                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO21")
     535                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a)
     536                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     537                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     538                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     539              
     540              $C$DW$32        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$32, DW_AT_name("GPIO22")
     543                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO22")
     544                      .dwattr $C$DW$32, DW_AT_bit_offset(0x09)
     545                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     546                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     547                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549              $C$DW$33        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$33, DW_AT_name("GPIO23")
     552                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO23")
     553                      .dwattr $C$DW$33, DW_AT_bit_offset(0x08)
     554                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     555                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     556                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558              $C$DW$34        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   12

     559                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     560                      .dwattr $C$DW$34, DW_AT_name("GPIO24")
     561                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO24")
     562                      .dwattr $C$DW$34, DW_AT_bit_offset(0x07)
     563                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     564                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     565                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567              $C$DW$35        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     569                      .dwattr $C$DW$35, DW_AT_name("GPIO25")
     570                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO25")
     571                      .dwattr $C$DW$35, DW_AT_bit_offset(0x06)
     572                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     573                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     574                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576              $C$DW$36        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     578                      .dwattr $C$DW$36, DW_AT_name("GPIO26")
     579                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO26")
     580                      .dwattr $C$DW$36, DW_AT_bit_offset(0x05)
     581                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     583                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     584              
     585              $C$DW$37        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$37, DW_AT_name("GPIO27")
     588                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO27")
     589                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04)
     590                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     591                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     592                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     593              
     594              $C$DW$38        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$38, DW_AT_name("GPIO28")
     597                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO28")
     598                      .dwattr $C$DW$38, DW_AT_bit_offset(0x03)
     599                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     600                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     601                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603              $C$DW$39        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$39, DW_AT_name("GPIO29")
     606                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO29")
     607                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     608                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     609                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     610                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     611              
     612              $C$DW$40        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   13

     614                      .dwattr $C$DW$40, DW_AT_name("GPIO30")
     615                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO30")
     616                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     617                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     618                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     619                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621              $C$DW$41        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     623                      .dwattr $C$DW$41, DW_AT_name("GPIO31")
     624                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO31")
     625                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     626                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     627                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     628                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     629              
     630                      .dwendtag $C$DW$T$20
     631              
     632              
     633              $C$DW$T$22      .dwtag  DW_TAG_union_type
     634                      .dwattr $C$DW$T$22, DW_AT_name("GPACR_REG")
     635                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     636              $C$DW$42        .dwtag  DW_TAG_member
     637                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
     638                      .dwattr $C$DW$42, DW_AT_name("all")
     639                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     640                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     642              
     643              $C$DW$43        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     645                      .dwattr $C$DW$43, DW_AT_name("bit")
     646                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     647                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650                      .dwendtag $C$DW$T$22
     651              
     652              
     653              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     654                      .dwattr $C$DW$T$23, DW_AT_name("GPACSEL1_BITS")
     655                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     656              $C$DW$44        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$44, DW_AT_name("GPIO0")
     659                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO0")
     660                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     661                      .dwattr $C$DW$44, DW_AT_bit_size(0x04)
     662                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     664              
     665              $C$DW$45        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     667                      .dwattr $C$DW$45, DW_AT_name("GPIO1")
     668                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   14

     669                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08)
     670                      .dwattr $C$DW$45, DW_AT_bit_size(0x04)
     671                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     673              
     674              $C$DW$46        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     676                      .dwattr $C$DW$46, DW_AT_name("GPIO2")
     677                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO2")
     678                      .dwattr $C$DW$46, DW_AT_bit_offset(0x04)
     679                      .dwattr $C$DW$46, DW_AT_bit_size(0x04)
     680                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$47        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$47, DW_AT_name("GPIO3")
     686                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO3")
     687                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     688                      .dwattr $C$DW$47, DW_AT_bit_size(0x04)
     689                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$48        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$48, DW_AT_name("GPIO4")
     695                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO4")
     696                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c)
     697                      .dwattr $C$DW$48, DW_AT_bit_size(0x04)
     698                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     699                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$49        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$49, DW_AT_name("GPIO5")
     704                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO5")
     705                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     706                      .dwattr $C$DW$49, DW_AT_bit_size(0x04)
     707                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     708                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     709              
     710              $C$DW$50        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     712                      .dwattr $C$DW$50, DW_AT_name("GPIO6")
     713                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO6")
     714                      .dwattr $C$DW$50, DW_AT_bit_offset(0x04)
     715                      .dwattr $C$DW$50, DW_AT_bit_size(0x04)
     716                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     717                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719              $C$DW$51        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$51, DW_AT_name("GPIO7")
     722                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO7")
     723                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   15

     724                      .dwattr $C$DW$51, DW_AT_bit_size(0x04)
     725                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     726                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728                      .dwendtag $C$DW$T$23
     729              
     730              
     731              $C$DW$T$24      .dwtag  DW_TAG_union_type
     732                      .dwattr $C$DW$T$24, DW_AT_name("GPACSEL1_REG")
     733                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     734              $C$DW$52        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     736                      .dwattr $C$DW$52, DW_AT_name("all")
     737                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     738                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$53        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
     743                      .dwattr $C$DW$53, DW_AT_name("bit")
     744                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     745                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748                      .dwendtag $C$DW$T$24
     749              
     750              
     751              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     752                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL2_BITS")
     753                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     754              $C$DW$54        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$54, DW_AT_name("GPIO8")
     757                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO8")
     758                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c)
     759                      .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     760                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$55        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$55, DW_AT_name("GPIO9")
     766                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO9")
     767                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08)
     768                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     769                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$56        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$56, DW_AT_name("GPIO10")
     775                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO10")
     776                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     777                      .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     778                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   16

     779                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$57        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$57, DW_AT_name("GPIO11")
     784                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO11")
     785                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     786                      .dwattr $C$DW$57, DW_AT_bit_size(0x04)
     787                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790              $C$DW$58        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$58, DW_AT_name("GPIO12")
     793                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO12")
     794                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     795                      .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     796                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     797                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     798              
     799              $C$DW$59        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$59, DW_AT_name("GPIO13")
     802                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO13")
     803                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     804                      .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     805                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     806                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808              $C$DW$60        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$60, DW_AT_name("GPIO14")
     811                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO14")
     812                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     813                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     814                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     815                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$61        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$61, DW_AT_name("GPIO15")
     820                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO15")
     821                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     822                      .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     823                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     824                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826                      .dwendtag $C$DW$T$25
     827              
     828              
     829              $C$DW$T$26      .dwtag  DW_TAG_union_type
     830                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL2_REG")
     831                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     832              $C$DW$62        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   17

     834                      .dwattr $C$DW$62, DW_AT_name("all")
     835                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     836                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$63        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
     841                      .dwattr $C$DW$63, DW_AT_name("bit")
     842                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     843                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846                      .dwendtag $C$DW$T$26
     847              
     848              
     849              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     850                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL3_BITS")
     851                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     852              $C$DW$64        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$64, DW_AT_name("GPIO16")
     855                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO16")
     856                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     857                      .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     858                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$65        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$65, DW_AT_name("GPIO17")
     864                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO17")
     865                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     866                      .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     867                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870              $C$DW$66        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$66, DW_AT_name("GPIO18")
     873                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO18")
     874                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
     875                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     876                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     878              
     879              $C$DW$67        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$67, DW_AT_name("GPIO19")
     882                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO19")
     883                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     884                      .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     885                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$68        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   18

     889                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$68, DW_AT_name("GPIO20")
     891                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO20")
     892                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
     893                      .dwattr $C$DW$68, DW_AT_bit_size(0x04)
     894                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     895                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$69        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$69, DW_AT_name("GPIO21")
     900                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO21")
     901                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08)
     902                      .dwattr $C$DW$69, DW_AT_bit_size(0x04)
     903                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     904                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$70        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$70, DW_AT_name("GPIO22")
     909                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO22")
     910                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04)
     911                      .dwattr $C$DW$70, DW_AT_bit_size(0x04)
     912                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     913                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$71        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$71, DW_AT_name("GPIO23")
     918                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO23")
     919                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00)
     920                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
     921                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     922                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924                      .dwendtag $C$DW$T$27
     925              
     926              
     927              $C$DW$T$28      .dwtag  DW_TAG_union_type
     928                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL3_REG")
     929                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     930              $C$DW$72        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     932                      .dwattr $C$DW$72, DW_AT_name("all")
     933                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     934                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     936              
     937              $C$DW$73        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$27)
     939                      .dwattr $C$DW$73, DW_AT_name("bit")
     940                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     941                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     943              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   19

     944                      .dwendtag $C$DW$T$28
     945              
     946              
     947              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     948                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL4_BITS")
     949                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     950              $C$DW$74        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$74, DW_AT_name("GPIO24")
     953                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO24")
     954                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
     955                      .dwattr $C$DW$74, DW_AT_bit_size(0x04)
     956                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     958              
     959              $C$DW$75        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$75, DW_AT_name("GPIO25")
     962                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO25")
     963                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
     964                      .dwattr $C$DW$75, DW_AT_bit_size(0x04)
     965                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$76        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$76, DW_AT_name("GPIO26")
     971                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO26")
     972                      .dwattr $C$DW$76, DW_AT_bit_offset(0x04)
     973                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
     974                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$77        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$77, DW_AT_name("GPIO27")
     980                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO27")
     981                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
     982                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
     983                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$78        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$78, DW_AT_name("GPIO28")
     989                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO28")
     990                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c)
     991                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
     992                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     993                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$79        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$79, DW_AT_name("GPIO29")
     998                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO29")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   20

     999                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
    1000                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
    1001                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1002                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$80        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$80, DW_AT_name("GPIO30")
    1007                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO30")
    1008                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1009                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1010                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1011                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$81        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$81, DW_AT_name("GPIO31")
    1016                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO31")
    1017                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1018                      .dwattr $C$DW$81, DW_AT_bit_size(0x04)
    1019                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1020                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022                      .dwendtag $C$DW$T$29
    1023              
    1024              
    1025              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1026                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL4_REG")
    1027                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1028              $C$DW$82        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1030                      .dwattr $C$DW$82, DW_AT_name("all")
    1031                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1032                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$83        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
    1037                      .dwattr $C$DW$83, DW_AT_name("bit")
    1038                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1039                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1041              
    1042                      .dwendtag $C$DW$T$30
    1043              
    1044              
    1045              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1046                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
    1047                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1048              $C$DW$84        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$84, DW_AT_name("QUALPRD0")
    1051                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_QUALPRD0")
    1052                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
    1053                      .dwattr $C$DW$84, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   21

    1054                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$85        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$85, DW_AT_name("QUALPRD1")
    1060                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_QUALPRD1")
    1061                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1062                      .dwattr $C$DW$85, DW_AT_bit_size(0x08)
    1063                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$86        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$86, DW_AT_name("QUALPRD2")
    1069                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_QUALPRD2")
    1070                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
    1071                      .dwattr $C$DW$86, DW_AT_bit_size(0x08)
    1072                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1073                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$87        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$87, DW_AT_name("QUALPRD3")
    1078                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_QUALPRD3")
    1079                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1080                      .dwattr $C$DW$87, DW_AT_bit_size(0x08)
    1081                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1082                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084                      .dwendtag $C$DW$T$31
    1085              
    1086              
    1087              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1088                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
    1089                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1090              $C$DW$88        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1092                      .dwattr $C$DW$88, DW_AT_name("all")
    1093                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1094                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$89        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$31)
    1099                      .dwattr $C$DW$89, DW_AT_name("bit")
    1100                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1101                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1103              
    1104                      .dwendtag $C$DW$T$32
    1105              
    1106              
    1107              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1108                      .dwattr $C$DW$T$33, DW_AT_name("GPADIR_BITS")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   22

    1109                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1110              $C$DW$90        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$90, DW_AT_name("GPIO0")
    1113                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO0")
    1114                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
    1115                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$91        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$91, DW_AT_name("GPIO1")
    1122                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO1")
    1123                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
    1124                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$92        .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$92, DW_AT_name("GPIO2")
    1131                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO2")
    1132                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
    1133                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$93        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$93, DW_AT_name("GPIO3")
    1140                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO3")
    1141                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1142                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$94        .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$94, DW_AT_name("GPIO4")
    1149                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO4")
    1150                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b)
    1151                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$95        .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$95, DW_AT_name("GPIO5")
    1158                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO5")
    1159                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1160                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1163              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   23

    1164              $C$DW$96        .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$96, DW_AT_name("GPIO6")
    1167                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO6")
    1168                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09)
    1169                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$97        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$97, DW_AT_name("GPIO7")
    1176                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO7")
    1177                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    1178                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$98        .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$98, DW_AT_name("GPIO8")
    1185                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO8")
    1186                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
    1187                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$99        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$99, DW_AT_name("GPIO9")
    1194                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO9")
    1195                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06)
    1196                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$100       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$100, DW_AT_name("GPIO10")
    1203                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO10")
    1204                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05)
    1205                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$101       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$101, DW_AT_name("GPIO11")
    1212                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO11")
    1213                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1214                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$102       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   24

    1219                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$102, DW_AT_name("GPIO12")
    1221                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO12")
    1222                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1223                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$103       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$103, DW_AT_name("GPIO13")
    1230                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO13")
    1231                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
    1232                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$104       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$104, DW_AT_name("GPIO14")
    1239                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO14")
    1240                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    1241                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1242                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245              $C$DW$105       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$105, DW_AT_name("GPIO15")
    1248                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO15")
    1249                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1250                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1251                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254              $C$DW$106       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$106, DW_AT_name("GPIO16")
    1257                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO16")
    1258                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1259                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1261                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$107       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$107, DW_AT_name("GPIO17")
    1266                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO17")
    1267                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1268                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1270                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$108       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   25

    1274                      .dwattr $C$DW$108, DW_AT_name("GPIO18")
    1275                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO18")
    1276                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1277                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1278                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1279                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$109       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$109, DW_AT_name("GPIO19")
    1284                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO19")
    1285                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1286                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$110       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$110, DW_AT_name("GPIO20")
    1293                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO20")
    1294                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1295                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1296                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1297                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$111       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$111, DW_AT_name("GPIO21")
    1302                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO21")
    1303                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1304                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1305                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1306                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$112       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$112, DW_AT_name("GPIO22")
    1311                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO22")
    1312                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1313                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1314                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1315                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$113       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$113, DW_AT_name("GPIO23")
    1320                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO23")
    1321                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1322                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1324                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$114       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$114, DW_AT_name("GPIO24")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   26

    1329                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO24")
    1330                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1331                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$115       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$115, DW_AT_name("GPIO25")
    1338                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO25")
    1339                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1340                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1341                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1342                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1343              
    1344              $C$DW$116       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$116, DW_AT_name("GPIO26")
    1347                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO26")
    1348                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1349                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1351                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$117       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$117, DW_AT_name("GPIO27")
    1356                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO27")
    1357                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1358                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1360                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$118       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$118, DW_AT_name("GPIO28")
    1365                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO28")
    1366                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1367                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1369                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$119       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$119, DW_AT_name("GPIO29")
    1374                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO29")
    1375                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1376                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1377                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1378                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$120       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1382                      .dwattr $C$DW$120, DW_AT_name("GPIO30")
    1383                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO30")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   27

    1384                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    1385                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1387                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$121       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$121, DW_AT_name("GPIO31")
    1392                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO31")
    1393                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1394                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1395                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1396                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398                      .dwendtag $C$DW$T$33
    1399              
    1400              
    1401              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1402                      .dwattr $C$DW$T$34, DW_AT_name("GPADIR_REG")
    1403                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1404              $C$DW$122       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1406                      .dwattr $C$DW$122, DW_AT_name("all")
    1407                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1408                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$123       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$33)
    1413                      .dwattr $C$DW$123, DW_AT_name("bit")
    1414                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1415                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418                      .dwendtag $C$DW$T$34
    1419              
    1420              
    1421              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1422                      .dwattr $C$DW$T$35, DW_AT_name("GPAGMUX1_BITS")
    1423                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1424              $C$DW$124       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$124, DW_AT_name("GPIO0")
    1427                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO0")
    1428                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1429                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1430                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$125       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$125, DW_AT_name("GPIO1")
    1436                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO1")
    1437                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c)
    1438                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   28

    1439                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$126       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$126, DW_AT_name("GPIO2")
    1445                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO2")
    1446                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1447                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1448                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$127       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$127, DW_AT_name("GPIO3")
    1454                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO3")
    1455                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1456                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1457                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$128       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$128, DW_AT_name("GPIO4")
    1463                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO4")
    1464                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06)
    1465                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1466                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469              $C$DW$129       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$129, DW_AT_name("GPIO5")
    1472                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO5")
    1473                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    1474                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1475                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478              $C$DW$130       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$130, DW_AT_name("GPIO6")
    1481                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO6")
    1482                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02)
    1483                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1484                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1486              
    1487              $C$DW$131       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$131, DW_AT_name("GPIO7")
    1490                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO7")
    1491                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1492                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1493                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   29

    1494                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$132       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$132, DW_AT_name("GPIO8")
    1499                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO8")
    1500                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1501                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1502                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1503                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505              $C$DW$133       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$133, DW_AT_name("GPIO9")
    1508                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO9")
    1509                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    1510                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1511                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1512                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514              $C$DW$134       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$134, DW_AT_name("GPIO10")
    1517                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO10")
    1518                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0a)
    1519                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1520                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1521                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1522              
    1523              $C$DW$135       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1525                      .dwattr $C$DW$135, DW_AT_name("GPIO11")
    1526                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO11")
    1527                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08)
    1528                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1529                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1530                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1531              
    1532              $C$DW$136       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$136, DW_AT_name("GPIO12")
    1535                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO12")
    1536                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06)
    1537                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1538                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1539                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1540              
    1541              $C$DW$137       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$137, DW_AT_name("GPIO13")
    1544                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO13")
    1545                      .dwattr $C$DW$137, DW_AT_bit_offset(0x04)
    1546                      .dwattr $C$DW$137, DW_AT_bit_size(0x02)
    1547                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1548                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   30

    1549              
    1550              $C$DW$138       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$138, DW_AT_name("GPIO14")
    1553                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO14")
    1554                      .dwattr $C$DW$138, DW_AT_bit_offset(0x02)
    1555                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    1556                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1557                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$139       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$139, DW_AT_name("GPIO15")
    1562                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO15")
    1563                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1564                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    1565                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1566                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1567              
    1568                      .dwendtag $C$DW$T$35
    1569              
    1570              
    1571              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1572                      .dwattr $C$DW$T$36, DW_AT_name("GPAGMUX1_REG")
    1573                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1574              $C$DW$140       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1576                      .dwattr $C$DW$140, DW_AT_name("all")
    1577                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1578                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$141       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$35)
    1583                      .dwattr $C$DW$141, DW_AT_name("bit")
    1584                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1585                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588                      .dwendtag $C$DW$T$36
    1589              
    1590              
    1591              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1592                      .dwattr $C$DW$T$37, DW_AT_name("GPAGMUX2_BITS")
    1593                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1594              $C$DW$142       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$142, DW_AT_name("GPIO16")
    1597                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO16")
    1598                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    1599                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    1600                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1602              
    1603              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_I2C.asm                                                      PAGE   31

    1604                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1605                      .dwattr $C$DW$143, DW_AT_name("GPIO17")
    1606                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO17")
    1607                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c)
    1608                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    1609                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612              $C$DW$144       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$144, DW_AT_name("GPIO18")
    1615                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO18")
    1616                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a)
    1617                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1618                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1620              
    1621              $C$DW$145       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$145, DW_AT_name("GPIO19")
    1624                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO19")
    1625                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08)
    1626                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    1627                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
