TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:26 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Ipc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("ReleaseFlashPump")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ReleaseFlashPump")

     962                      .dwcfi  cfa_offset, -2
     963                      .dwcfi  save_reg_to_mem, 26, 0
     964 0000009f FE02          ADDB      SP,#2                 ; [CPU_ARAU] 
     965                      .dwcfi  cfa_offset, -4
     966              $C$DW$68        .dwtag  DW_TAG_variable
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   19

     967                      .dwattr $C$DW$68, DW_AT_name("flag")
     968                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_flag")
     969                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$68, DW_AT_location[DW_OP_breg20 -1]
     971              
     972 000000a0 9641          MOV       *-SP[1],AL            ; [CPU_ALU] |178| 
     973                      .dwpsn  file "../F2837xD/F2837xD_Ipc.c",line 179,column 5,is_stmt,isa 0
     974              $C$DW$69        .dwtag  DW_TAG_TI_branch
     975                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
     976                      .dwattr $C$DW$69, DW_AT_name("_SendIpcFlag")
     977                      .dwattr $C$DW$69, DW_AT_TI_call
     978              
     979 000000a1 7640'         LCR       #_SendIpcFlag         ; [CPU_ALU] |179| 
         000000a2 0067 
     980                      ; call occurs [#_SendIpcFlag] ; [] |179| 
     981                      .dwpsn  file "../F2837xD/F2837xD_Ipc.c",line 180,column 5,is_stmt,isa 0
     982 000000a3 9241          MOV       AL,*-SP[1]            ; [CPU_ALU] |180| 
     983              $C$DW$70        .dwtag  DW_TAG_TI_branch
     984                      .dwattr $C$DW$70, DW_AT_low_pc(0x00)
     985                      .dwattr $C$DW$70, DW_AT_name("_WaitForIpcFlag")
     986                      .dwattr $C$DW$70, DW_AT_TI_call
     987              
     988 000000a4 7640'         LCR       #_WaitForIpcFlag      ; [CPU_ALU] |180| 
         000000a5 0085 
     989                      ; call occurs [#_WaitForIpcFlag] ; [] |180| 
     990                      .dwpsn  file "../F2837xD/F2837xD_Ipc.c",line 181,column 5,is_stmt,isa 0
     991 000000a6 9241          MOV       AL,*-SP[1]            ; [CPU_ALU] |181| 
     992              $C$DW$71        .dwtag  DW_TAG_TI_branch
     993                      .dwattr $C$DW$71, DW_AT_low_pc(0x00)
     994                      .dwattr $C$DW$71, DW_AT_name("_AckIpcFlag")
     995                      .dwattr $C$DW$71, DW_AT_TI_call
     996              
     997 000000a7 7640'         LCR       #_AckIpcFlag          ; [CPU_ALU] |181| 
         000000a8 0071 
     998                      ; call occurs [#_AckIpcFlag] ; [] |181| 
     999                      .dwpsn  file "../F2837xD/F2837xD_Ipc.c",line 182,column 5,is_stmt,isa 0
    1000 000000a9 9241          MOV       AL,*-SP[1]            ; [CPU_ALU] |182| 
    1001              $C$DW$72        .dwtag  DW_TAG_TI_branch
    1002                      .dwattr $C$DW$72, DW_AT_low_pc(0x00)
    1003                      .dwattr $C$DW$72, DW_AT_name("_WaitForIpcAck")
    1004                      .dwattr $C$DW$72, DW_AT_TI_call
    1005              
    1006 000000aa 7640'         LCR       #_WaitForIpcAck       ; [CPU_ALU] |182| 
         000000ab 0092 
    1007                      ; call occurs [#_WaitForIpcAck] ; [] |182| 
    1008                      .dwpsn  file "../F2837xD/F2837xD_Ipc.c",line 183,column 1,is_stmt,isa 0
    1009 000000ac FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    1010                      .dwcfi  cfa_offset, -2
    1011              $C$DW$73        .dwtag  DW_TAG_TI_branch
    1012                      .dwattr $C$DW$73, DW_AT_low_pc(0x00)
    1013                      .dwattr $C$DW$73, DW_AT_TI_return
    1014              
    1015 000000ad 0006          LRETR     ; [CPU_ALU] 
    1016                      ; return occurs ; [] 
    1017                      .dwattr $C$DW$66, DW_AT_TI_end_file("../F2837xD/F2837xD_Ipc.c")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   20

    1018                      .dwattr $C$DW$66, DW_AT_TI_end_line(0xb7)
    1019                      .dwattr $C$DW$66, DW_AT_TI_end_column(0x01)
    1020                      .dwendentry
    1021                      .dwendtag $C$DW$66
    1022              
    1023              ;**************************************************************
    1024              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1025              ;**************************************************************
    1026                      .global _ReleaseFlashPump
    1027                      .global _memset
    1028                      .global _IpcRegs
    1029                      .global LL$$OR
    1030                      .global _memcpy
    1031              
    1032              ;***************************************************************
    1033              ;* TYPE INFORMATION                                            *
    1034              ;***************************************************************
    1035              
    1036              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$20, DW_AT_name("IPCACK_BITS")
    1038                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1039              $C$DW$74        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$74, DW_AT_name("IPC0")
    1042                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_IPC0")
    1043                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0f)
    1044                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048              $C$DW$75        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$75, DW_AT_name("IPC1")
    1051                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IPC1")
    1052                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
    1053                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$76        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$76, DW_AT_name("IPC2")
    1060                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_IPC2")
    1061                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0d)
    1062                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$77        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$77, DW_AT_name("IPC3")
    1069                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_IPC3")
    1070                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
    1071                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1072                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   21

    1073                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$78        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$78, DW_AT_name("IPC4")
    1078                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_IPC4")
    1079                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0b)
    1080                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084              $C$DW$79        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$79, DW_AT_name("IPC5")
    1087                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_IPC5")
    1088                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0a)
    1089                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$80        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$80, DW_AT_name("IPC6")
    1096                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_IPC6")
    1097                      .dwattr $C$DW$80, DW_AT_bit_offset(0x09)
    1098                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1099                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$81        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$81, DW_AT_name("IPC7")
    1105                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_IPC7")
    1106                      .dwattr $C$DW$81, DW_AT_bit_offset(0x08)
    1107                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1108                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$82        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$82, DW_AT_name("IPC8")
    1114                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_IPC8")
    1115                      .dwattr $C$DW$82, DW_AT_bit_offset(0x07)
    1116                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$83        .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$83, DW_AT_name("IPC9")
    1123                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_IPC9")
    1124                      .dwattr $C$DW$83, DW_AT_bit_offset(0x06)
    1125                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   22

    1128              
    1129              $C$DW$84        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$84, DW_AT_name("IPC10")
    1132                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_IPC10")
    1133                      .dwattr $C$DW$84, DW_AT_bit_offset(0x05)
    1134                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1135                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$85        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$85, DW_AT_name("IPC11")
    1141                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_IPC11")
    1142                      .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
    1143                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1144                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147              $C$DW$86        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$86, DW_AT_name("IPC12")
    1150                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_IPC12")
    1151                      .dwattr $C$DW$86, DW_AT_bit_offset(0x03)
    1152                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156              $C$DW$87        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$87, DW_AT_name("IPC13")
    1159                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_IPC13")
    1160                      .dwattr $C$DW$87, DW_AT_bit_offset(0x02)
    1161                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1162                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$88        .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$88, DW_AT_name("IPC14")
    1168                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_IPC14")
    1169                      .dwattr $C$DW$88, DW_AT_bit_offset(0x01)
    1170                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1173              
    1174              $C$DW$89        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$89, DW_AT_name("IPC15")
    1177                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_IPC15")
    1178                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1179                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1182              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   23

    1183              $C$DW$90        .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$90, DW_AT_name("IPC16")
    1186                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IPC16")
    1187                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
    1188                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1190                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$91        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$91, DW_AT_name("IPC17")
    1195                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_IPC17")
    1196                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
    1197                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1198                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1199                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201              $C$DW$92        .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$92, DW_AT_name("IPC18")
    1204                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_IPC18")
    1205                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
    1206                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1207                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1208                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1209              
    1210              $C$DW$93        .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$93, DW_AT_name("IPC19")
    1213                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_IPC19")
    1214                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1215                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1216                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1217                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219              $C$DW$94        .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$94, DW_AT_name("IPC20")
    1222                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_IPC20")
    1223                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b)
    1224                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1225                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1226                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228              $C$DW$95        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$95, DW_AT_name("IPC21")
    1231                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_IPC21")
    1232                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1233                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1235                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1236              
    1237              $C$DW$96        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   24

    1238                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$96, DW_AT_name("IPC22")
    1240                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IPC22")
    1241                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09)
    1242                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1243                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1244                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246              $C$DW$97        .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1248                      .dwattr $C$DW$97, DW_AT_name("IPC23")
    1249                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_IPC23")
    1250                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    1251                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1253                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255              $C$DW$98        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$98, DW_AT_name("IPC24")
    1258                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_IPC24")
    1259                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
    1260                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1261                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1262                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$99        .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$99, DW_AT_name("IPC25")
    1267                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_IPC25")
    1268                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06)
    1269                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1270                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1271                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$100       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$100, DW_AT_name("IPC26")
    1276                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_IPC26")
    1277                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05)
    1278                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1279                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1280                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282              $C$DW$101       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$101, DW_AT_name("IPC27")
    1285                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_IPC27")
    1286                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1287                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1288                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1289                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$102       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   25

    1293                      .dwattr $C$DW$102, DW_AT_name("IPC28")
    1294                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_IPC28")
    1295                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1296                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1298                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1299              
    1300              $C$DW$103       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$103, DW_AT_name("IPC29")
    1303                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IPC29")
    1304                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
    1305                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1306                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1307                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1308              
    1309              $C$DW$104       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$104, DW_AT_name("IPC30")
    1312                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_IPC30")
    1313                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    1314                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1316                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$105       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$105, DW_AT_name("IPC31")
    1321                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_IPC31")
    1322                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1323                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1325                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327                      .dwendtag $C$DW$T$20
    1328              
    1329              
    1330              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1331                      .dwattr $C$DW$T$22, DW_AT_name("IPCACK_REG")
    1332                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1333              $C$DW$106       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1335                      .dwattr $C$DW$106, DW_AT_name("all")
    1336                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1337                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1339              
    1340              $C$DW$107       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1342                      .dwattr $C$DW$107, DW_AT_name("bit")
    1343                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1344                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347                      .dwendtag $C$DW$T$22
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   26

    1348              
    1349              
    1350              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1351                      .dwattr $C$DW$T$23, DW_AT_name("IPCCLR_BITS")
    1352                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1353              $C$DW$108       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$108, DW_AT_name("IPC0")
    1356                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_IPC0")
    1357                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1358                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$109       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$109, DW_AT_name("IPC1")
    1365                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_IPC1")
    1366                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1367                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$110       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$110, DW_AT_name("IPC2")
    1374                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IPC2")
    1375                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1376                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1377                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$111       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1382                      .dwattr $C$DW$111, DW_AT_name("IPC3")
    1383                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_IPC3")
    1384                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1385                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389              $C$DW$112       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$112, DW_AT_name("IPC4")
    1392                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_IPC4")
    1393                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    1394                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1395                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398              $C$DW$113       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1400                      .dwattr $C$DW$113, DW_AT_name("IPC5")
    1401                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IPC5")
    1402                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   27

    1403                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1404                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1406              
    1407              $C$DW$114       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$114, DW_AT_name("IPC6")
    1410                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_IPC6")
    1411                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    1412                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1413                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1415              
    1416              $C$DW$115       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$115, DW_AT_name("IPC7")
    1419                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_IPC7")
    1420                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1421                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1422                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425              $C$DW$116       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$116, DW_AT_name("IPC8")
    1428                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IPC8")
    1429                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07)
    1430                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1431                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$117       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$117, DW_AT_name("IPC9")
    1437                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IPC9")
    1438                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06)
    1439                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1440                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$118       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$118, DW_AT_name("IPC10")
    1446                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IPC10")
    1447                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05)
    1448                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1451              
    1452              $C$DW$119       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$119, DW_AT_name("IPC11")
    1455                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IPC11")
    1456                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1457                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   28

    1458                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$120       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$120, DW_AT_name("IPC12")
    1464                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IPC12")
    1465                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1466                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1467                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470              $C$DW$121       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$121, DW_AT_name("IPC13")
    1473                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IPC13")
    1474                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02)
    1475                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1476                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1478              
    1479              $C$DW$122       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$122, DW_AT_name("IPC14")
    1482                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IPC14")
    1483                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01)
    1484                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1485                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$123       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$123, DW_AT_name("IPC15")
    1491                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IPC15")
    1492                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1493                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497              $C$DW$124       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$124, DW_AT_name("IPC16")
    1500                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IPC16")
    1501                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1502                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1503                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1504                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$125       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$125, DW_AT_name("IPC17")
    1509                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IPC17")
    1510                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1511                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1512                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   29

    1513                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$126       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$126, DW_AT_name("IPC18")
    1518                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IPC18")
    1519                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1520                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1522                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$127       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$127, DW_AT_name("IPC19")
    1527                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IPC19")
    1528                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1529                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1531                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$128       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$128, DW_AT_name("IPC20")
    1536                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IPC20")
    1537                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    1538                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1540                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$129       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$129, DW_AT_name("IPC21")
    1545                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IPC21")
    1546                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    1547                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1549                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$130       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$130, DW_AT_name("IPC22")
    1554                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IPC22")
    1555                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09)
    1556                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1558                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560              $C$DW$131       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$131, DW_AT_name("IPC23")
    1563                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IPC23")
    1564                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1565                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1566                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1567                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   30

    1568              
    1569              $C$DW$132       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$132, DW_AT_name("IPC24")
    1572                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_IPC24")
    1573                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    1574                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1575                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1576                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578              $C$DW$133       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$133, DW_AT_name("IPC25")
    1581                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IPC25")
    1582                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06)
    1583                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1584                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1585                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$134       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$134, DW_AT_name("IPC26")
    1590                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IPC26")
    1591                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05)
    1592                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1593                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1594                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1595              
    1596              $C$DW$135       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1598                      .dwattr $C$DW$135, DW_AT_name("IPC27")
    1599                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_IPC27")
    1600                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    1601                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1603                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1604              
    1605              $C$DW$136       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$136, DW_AT_name("IPC28")
    1608                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_IPC28")
    1609                      .dwattr $C$DW$136, DW_AT_bit_offset(0x03)
    1610                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1611                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1612                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$137       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$137, DW_AT_name("IPC29")
    1617                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IPC29")
    1618                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02)
    1619                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1621                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1622              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   31

    1623              $C$DW$138       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$138, DW_AT_name("IPC30")
    1626                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_IPC30")
    1627                      .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    1628                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1629                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1630                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$139       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$139, DW_AT_name("IPC31")
    1635                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_IPC31")
    1636                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1637                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1638                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1639                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641                      .dwendtag $C$DW$T$23
    1642              
    1643              
    1644              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1645                      .dwattr $C$DW$T$24, DW_AT_name("IPCCLR_REG")
    1646                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1647              $C$DW$140       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1649                      .dwattr $C$DW$140, DW_AT_name("all")
    1650                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1651                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$141       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    1656                      .dwattr $C$DW$141, DW_AT_name("bit")
    1657                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1658                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661                      .dwendtag $C$DW$T$24
    1662              
    1663              
    1664              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1665                      .dwattr $C$DW$T$25, DW_AT_name("IPCFLG_BITS")
    1666                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1667              $C$DW$142       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$142, DW_AT_name("IPC0")
    1670                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IPC0")
    1671                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f)
    1672                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1673                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$143       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   32

    1678                      .dwattr $C$DW$143, DW_AT_name("IPC1")
    1679                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IPC1")
    1680                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    1681                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$144       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$144, DW_AT_name("IPC2")
    1688                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_IPC2")
    1689                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    1690                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1691                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694              $C$DW$145       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1696                      .dwattr $C$DW$145, DW_AT_name("IPC3")
    1697                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_IPC3")
    1698                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    1699                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1700                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$146       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$146, DW_AT_name("IPC4")
    1706                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_IPC4")
    1707                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b)
    1708                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$147       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$147, DW_AT_name("IPC5")
    1715                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_IPC5")
    1716                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a)
    1717                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$148       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$148, DW_AT_name("IPC6")
    1724                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_IPC6")
    1725                      .dwattr $C$DW$148, DW_AT_bit_offset(0x09)
    1726                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$149       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$149, DW_AT_name("IPC7")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   33

    1733                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_IPC7")
    1734                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    1735                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$150       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$150, DW_AT_name("IPC8")
    1742                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_IPC8")
    1743                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07)
    1744                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1747              
    1748              $C$DW$151       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$151, DW_AT_name("IPC9")
    1751                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_IPC9")
    1752                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06)
    1753                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1756              
    1757              $C$DW$152       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$152, DW_AT_name("IPC10")
    1760                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_IPC10")
    1761                      .dwattr $C$DW$152, DW_AT_bit_offset(0x05)
    1762                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$153       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$153, DW_AT_name("IPC11")
    1769                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_IPC11")
    1770                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04)
    1771                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1772                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1774              
    1775              $C$DW$154       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$154, DW_AT_name("IPC12")
    1778                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_IPC12")
    1779                      .dwattr $C$DW$154, DW_AT_bit_offset(0x03)
    1780                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1781                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784              $C$DW$155       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$155, DW_AT_name("IPC13")
    1787                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_IPC13")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   34

    1788                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02)
    1789                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$156       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$156, DW_AT_name("IPC14")
    1796                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_IPC14")
    1797                      .dwattr $C$DW$156, DW_AT_bit_offset(0x01)
    1798                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$157       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$157, DW_AT_name("IPC15")
    1805                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_IPC15")
    1806                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1807                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1808                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1809                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1810              
    1811              $C$DW$158       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1813                      .dwattr $C$DW$158, DW_AT_name("IPC16")
    1814                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_IPC16")
    1815                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0f)
    1816                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1817                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1818                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1819              
    1820              $C$DW$159       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1822                      .dwattr $C$DW$159, DW_AT_name("IPC17")
    1823                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_IPC17")
    1824                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e)
    1825                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1827                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$160       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$160, DW_AT_name("IPC18")
    1832                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_IPC18")
    1833                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d)
    1834                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1836                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$161       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$161, DW_AT_name("IPC19")
    1841                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IPC19")
    1842                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   35

    1843                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1844                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1845                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847              $C$DW$162       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$162, DW_AT_name("IPC20")
    1850                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_IPC20")
    1851                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b)
    1852                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1853                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1854                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$163       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$163, DW_AT_name("IPC21")
    1859                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_IPC21")
    1860                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a)
    1861                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1863                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$164       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$164, DW_AT_name("IPC22")
    1868                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_IPC22")
    1869                      .dwattr $C$DW$164, DW_AT_bit_offset(0x09)
    1870                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1872                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874              $C$DW$165       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$165, DW_AT_name("IPC23")
    1877                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_IPC23")
    1878                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08)
    1879                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1881                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$166       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1885                      .dwattr $C$DW$166, DW_AT_name("IPC24")
    1886                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_IPC24")
    1887                      .dwattr $C$DW$166, DW_AT_bit_offset(0x07)
    1888                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1890                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$167       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$167, DW_AT_name("IPC25")
    1895                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_IPC25")
    1896                      .dwattr $C$DW$167, DW_AT_bit_offset(0x06)
    1897                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   36

    1898                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1899                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$168       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$168, DW_AT_name("IPC26")
    1904                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_IPC26")
    1905                      .dwattr $C$DW$168, DW_AT_bit_offset(0x05)
    1906                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1908                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$169       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$169, DW_AT_name("IPC27")
    1913                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_IPC27")
    1914                      .dwattr $C$DW$169, DW_AT_bit_offset(0x04)
    1915                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1916                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1917                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$170       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$170, DW_AT_name("IPC28")
    1922                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_IPC28")
    1923                      .dwattr $C$DW$170, DW_AT_bit_offset(0x03)
    1924                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1926                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$171       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$171, DW_AT_name("IPC29")
    1931                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_IPC29")
    1932                      .dwattr $C$DW$171, DW_AT_bit_offset(0x02)
    1933                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1934                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1935                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$172       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$172, DW_AT_name("IPC30")
    1940                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_IPC30")
    1941                      .dwattr $C$DW$172, DW_AT_bit_offset(0x01)
    1942                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1944                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$173       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$173, DW_AT_name("IPC31")
    1949                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_IPC31")
    1950                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00)
    1951                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1952                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   37

    1953                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955                      .dwendtag $C$DW$T$25
    1956              
    1957              
    1958              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1959                      .dwattr $C$DW$T$26, DW_AT_name("IPCFLG_REG")
    1960                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1961              $C$DW$174       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1963                      .dwattr $C$DW$174, DW_AT_name("all")
    1964                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_all")
    1965                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1967              
    1968              $C$DW$175       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    1970                      .dwattr $C$DW$175, DW_AT_name("bit")
    1971                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bit")
    1972                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1974              
    1975                      .dwendtag $C$DW$T$26
    1976              
    1977              
    1978              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1979                      .dwattr $C$DW$T$27, DW_AT_name("IPCSET_BITS")
    1980                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1981              $C$DW$176       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$176, DW_AT_name("IPC0")
    1984                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_IPC0")
    1985                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0f)
    1986                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1987                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1989              
    1990              $C$DW$177       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1992                      .dwattr $C$DW$177, DW_AT_name("IPC1")
    1993                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_IPC1")
    1994                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0e)
    1995                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1996                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$178       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$178, DW_AT_name("IPC2")
    2002                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_IPC2")
    2003                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0d)
    2004                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2005                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2007              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   38

    2008              $C$DW$179       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2010                      .dwattr $C$DW$179, DW_AT_name("IPC3")
    2011                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_IPC3")
    2012                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0c)
    2013                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2014                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2015                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2016              
    2017              $C$DW$180       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$180, DW_AT_name("IPC4")
    2020                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_IPC4")
    2021                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0b)
    2022                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2023                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$181       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2028                      .dwattr $C$DW$181, DW_AT_name("IPC5")
    2029                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_IPC5")
    2030                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    2031                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2032                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035              $C$DW$182       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2037                      .dwattr $C$DW$182, DW_AT_name("IPC6")
    2038                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_IPC6")
    2039                      .dwattr $C$DW$182, DW_AT_bit_offset(0x09)
    2040                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2041                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2043              
    2044              $C$DW$183       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2046                      .dwattr $C$DW$183, DW_AT_name("IPC7")
    2047                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_IPC7")
    2048                      .dwattr $C$DW$183, DW_AT_bit_offset(0x08)
    2049                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2050                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2052              
    2053              $C$DW$184       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2055                      .dwattr $C$DW$184, DW_AT_name("IPC8")
    2056                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_IPC8")
    2057                      .dwattr $C$DW$184, DW_AT_bit_offset(0x07)
    2058                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2059                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$185       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   39

    2063                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$185, DW_AT_name("IPC9")
    2065                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_IPC9")
    2066                      .dwattr $C$DW$185, DW_AT_bit_offset(0x06)
    2067                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2068                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071              $C$DW$186       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2073                      .dwattr $C$DW$186, DW_AT_name("IPC10")
    2074                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IPC10")
    2075                      .dwattr $C$DW$186, DW_AT_bit_offset(0x05)
    2076                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2077                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080              $C$DW$187       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$187, DW_AT_name("IPC11")
    2083                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_IPC11")
    2084                      .dwattr $C$DW$187, DW_AT_bit_offset(0x04)
    2085                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2086                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$188       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$188, DW_AT_name("IPC12")
    2092                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_IPC12")
    2093                      .dwattr $C$DW$188, DW_AT_bit_offset(0x03)
    2094                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2095                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$189       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$189, DW_AT_name("IPC13")
    2101                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_IPC13")
    2102                      .dwattr $C$DW$189, DW_AT_bit_offset(0x02)
    2103                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2104                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2105                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2106              
    2107              $C$DW$190       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$190, DW_AT_name("IPC14")
    2110                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_IPC14")
    2111                      .dwattr $C$DW$190, DW_AT_bit_offset(0x01)
    2112                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2115              
    2116              $C$DW$191       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   40

    2118                      .dwattr $C$DW$191, DW_AT_name("IPC15")
    2119                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_IPC15")
    2120                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00)
    2121                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2122                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$192       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$192, DW_AT_name("IPC16")
    2128                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IPC16")
    2129                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0f)
    2130                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2131                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2132                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$193       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$193, DW_AT_name("IPC17")
    2137                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IPC17")
    2138                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0e)
    2139                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2140                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2141                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$194       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$194, DW_AT_name("IPC18")
    2146                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_IPC18")
    2147                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0d)
    2148                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2149                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2150                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2151              
    2152              $C$DW$195       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$195, DW_AT_name("IPC19")
    2155                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_IPC19")
    2156                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0c)
    2157                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2158                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2159                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2160              
    2161              $C$DW$196       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$196, DW_AT_name("IPC20")
    2164                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_IPC20")
    2165                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0b)
    2166                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2167                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2168                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2169              
    2170              $C$DW$197       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$197, DW_AT_name("IPC21")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   41

    2173                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_IPC21")
    2174                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a)
    2175                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2177                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$198       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$198, DW_AT_name("IPC22")
    2182                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_IPC22")
    2183                      .dwattr $C$DW$198, DW_AT_bit_offset(0x09)
    2184                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2186                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188              $C$DW$199       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$199, DW_AT_name("IPC23")
    2191                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_IPC23")
    2192                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08)
    2193                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2194                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2195                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$200       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$200, DW_AT_name("IPC24")
    2200                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_IPC24")
    2201                      .dwattr $C$DW$200, DW_AT_bit_offset(0x07)
    2202                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2203                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2204                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$201       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$201, DW_AT_name("IPC25")
    2209                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_IPC25")
    2210                      .dwattr $C$DW$201, DW_AT_bit_offset(0x06)
    2211                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2213                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$202       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$202, DW_AT_name("IPC26")
    2218                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_IPC26")
    2219                      .dwattr $C$DW$202, DW_AT_bit_offset(0x05)
    2220                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2222                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$203       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$203, DW_AT_name("IPC27")
    2227                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_IPC27")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   42

    2228                      .dwattr $C$DW$203, DW_AT_bit_offset(0x04)
    2229                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2230                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2231                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233              $C$DW$204       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$204, DW_AT_name("IPC28")
    2236                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_IPC28")
    2237                      .dwattr $C$DW$204, DW_AT_bit_offset(0x03)
    2238                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2239                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2240                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$205       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$205, DW_AT_name("IPC29")
    2245                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_IPC29")
    2246                      .dwattr $C$DW$205, DW_AT_bit_offset(0x02)
    2247                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2249                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251              $C$DW$206       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$206, DW_AT_name("IPC30")
    2254                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_IPC30")
    2255                      .dwattr $C$DW$206, DW_AT_bit_offset(0x01)
    2256                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2257                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2258                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2259              
    2260              $C$DW$207       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$207, DW_AT_name("IPC31")
    2263                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_IPC31")
    2264                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00)
    2265                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2266                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2267                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2268              
    2269                      .dwendtag $C$DW$T$27
    2270              
    2271              
    2272              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2273                      .dwattr $C$DW$T$28, DW_AT_name("IPCSET_REG")
    2274                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2275              $C$DW$208       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2277                      .dwattr $C$DW$208, DW_AT_name("all")
    2278                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    2279                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2281              
    2282              $C$DW$209       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:27 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc.asm                                                      PAGE   43

    2283                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$27)
    2284                      .dwattr $C$DW$209, DW_AT_name("bit")
    2285                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    2286                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289                      .dwendtag $C$DW$T$28
    2290              
    2291              
    2292              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2293                      .dwattr $C$DW$T$29, DW_AT_name("IPCSTS_BITS")
    2294                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2295              $C$DW$210       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$210, DW_AT_name("IPC0")
    2298                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_IPC0")
    2299                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f)
    2300                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2301                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2303              
    2304              $C$DW$211       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$211, DW_AT_name("IPC1")
    2307                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_IPC1")
    2308                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e)
    2309                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2310                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
