TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:30 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_Ipc_Driver_Util.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinOptions")

    1011 00000147 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |258| 
    1012 00000148 FFE1          B         $C$L8,EQ              ; [CPU_ALU] |258| 
         00000149 FF43 
    1013                      ; branchcc occurs ; [] |258| 
    1014 0000014a 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] 
    1015 0000014b 619B          B         $C$L10,EQ             ; [CPU_ALU] |258| 
    1016                      ; branchcc occurs ; [] |258| 
    1017 0000014c 0201          MOVB      ACC,#1                ; [CPU_ALU] |258| 
    1018 0000014d 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |258| 
    1019 0000014e FFE1          B         $C$L7,EQ              ; [CPU_ALU] |258| 
         0000014f FF18 
    1020                      ; branchcc occurs ; [] |258| 
    1021 00000150 6F08          B         $C$L16,UNC            ; [CPU_ALU] |258| 
    1022                      ; branch occurs ; [] |258| 
    1023 00000151       $C$L15:    
    1024 00000151 0205          MOVB      ACC,#5                ; [CPU_ALU] |258| 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   21

    1025 00000152 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |258| 
    1026 00000153 FFE1          B         $C$L9,EQ              ; [CPU_ALU] |258| 
         00000154 FF6F 
    1027                      ; branchcc occurs ; [] |258| 
    1028 00000155 0207          MOVB      ACC,#7                ; [CPU_ALU] |258| 
    1029 00000156 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |258| 
    1030 00000157 61B6          B         $C$L13,EQ             ; [CPU_ALU] |258| 
    1031                      ; branchcc occurs ; [] |258| 
    1032 00000158       $C$L16:    
    1033                      .dwpsn  file "../F2837xD/F2837xD_Ipc_Driver_Util.c",line 406,column 9,is_stmt,isa 0
    1034 00000158 0642          MOVL      ACC,*-SP[2]           ; [CPU_ALU] |406| 
    1035 00000159 761F!         MOVW      DP,#_IpcRegs+34       ; [CPU_ARAU] 
         0000015a 0000 
    1036 0000015b 1E22!         MOVL      @_IpcRegs+34,ACC      ; [CPU_ALU] |406| 
    1037                      .dwpsn  file "../F2837xD/F2837xD_Ipc_Driver_Util.c",line 411,column 9,is_stmt,isa 0
    1038 0000015c 0213          MOVB      ACC,#19               ; [CPU_ALU] |411| 
    1039 0000015d 1E10!         MOVL      @_IpcRegs+16,ACC      ; [CPU_ALU] |411| 
    1040                      .dwpsn  file "../F2837xD/F2837xD_Ipc_Driver_Util.c",line 416,column 9,is_stmt,isa 0
    1041 0000015e 9A01          MOV       AL,#1                 ; [CPU_ALU] |416| 
    1042 0000015f 28A8          MOV       AH,#32768             ; [CPU_ALU] |416| 
         00000160 8000 
    1043 00000161 1E04!         MOVL      @_IpcRegs+4,ACC       ; [CPU_ALU] |416| 
    1044 00000162       $C$L17:    
    1045                      .dwpsn  file "../F2837xD/F2837xD_Ipc_Driver_Util.c",line 422,column 5,is_stmt,isa 0
    1046 00000162 9246          MOV       AL,*-SP[6]            ; [CPU_ALU] |422| 
    1047 00000163       $C$L18:    
    1048                      .dwpsn  file "../F2837xD/F2837xD_Ipc_Driver_Util.c",line 423,column 1,is_stmt,isa 0
    1049 00000163 FE86          SUBB      SP,#6                 ; [CPU_ARAU] 
    1050                      .dwcfi  cfa_offset, -2
    1051 00000164 FF69          SPM       #0                    ; [CPU_ALU] 
    1052              $C$DW$70        .dwtag  DW_TAG_TI_branch
    1053                      .dwattr $C$DW$70, DW_AT_low_pc(0x00)
    1054                      .dwattr $C$DW$70, DW_AT_TI_return
    1055              
    1056 00000165 0006          LRETR     ; [CPU_ALU] 
    1057                      ; return occurs ; [] 
    1058                      .dwattr $C$DW$38, DW_AT_TI_end_file("../F2837xD/F2837xD_Ipc_Driver_Util.c")
    1059                      .dwattr $C$DW$38, DW_AT_TI_end_line(0x1a7)
    1060                      .dwattr $C$DW$38, DW_AT_TI_end_column(0x01)
    1061                      .dwendentry
    1062                      .dwendtag $C$DW$38
    1063              
    1064              ;**************************************************************
    1065              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1066              ;**************************************************************
    1067                      .global _GPIO_SetupPinOptions
    1068                      .global _GPIO_SetupPinMux
    1069                      .global _IpcRegs
    1070                      .global _ClkCfgRegs
    1071                      .global _CpuSysRegs
    1072                      .global _DevCfgRegs
    1073                      .global _GpioCtrlRegs
    1074              
    1075              ;***************************************************************
    1076              ;* TYPE INFORMATION                                            *
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   22

    1077              ;***************************************************************
    1078              
    1079              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1080                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
    1081                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1082              $C$DW$71        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$71, DW_AT_name("AUXPLLDIV")
    1085                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_AUXPLLDIV")
    1086                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e)
    1087                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1088                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$72        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
    1094                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
    1095                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1096                      .dwattr $C$DW$72, DW_AT_bit_size(0x0e)
    1097                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$73        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$73, DW_AT_name("rsvd2")
    1103                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd2")
    1104                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
    1105                      .dwattr $C$DW$73, DW_AT_bit_size(0x10)
    1106                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1107                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109                      .dwendtag $C$DW$T$20
    1110              
    1111              
    1112              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1113                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
    1114                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1115              $C$DW$74        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1117                      .dwattr $C$DW$74, DW_AT_name("all")
    1118                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
    1119                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1121              
    1122              $C$DW$75        .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1124                      .dwattr $C$DW$75, DW_AT_name("bit")
    1125                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
    1126                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129                      .dwendtag $C$DW$T$22
    1130              
    1131              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   23

    1132              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1133                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
    1134                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1135              $C$DW$76        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$76, DW_AT_name("PLLEN")
    1138                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PLLEN")
    1139                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0f)
    1140                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$77        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$77, DW_AT_name("PLLCLKEN")
    1147                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PLLCLKEN")
    1148                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e)
    1149                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$78        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$78, DW_AT_name("rsvd1")
    1156                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd1")
    1157                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00)
    1158                      .dwattr $C$DW$78, DW_AT_bit_size(0x0e)
    1159                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$79        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$79, DW_AT_name("rsvd2")
    1165                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd2")
    1166                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1167                      .dwattr $C$DW$79, DW_AT_bit_size(0x10)
    1168                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1169                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171                      .dwendtag $C$DW$T$23
    1172              
    1173              
    1174              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1175                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
    1176                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1177              $C$DW$80        .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1179                      .dwattr $C$DW$80, DW_AT_name("all")
    1180                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
    1181                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1183              
    1184              $C$DW$81        .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
    1186                      .dwattr $C$DW$81, DW_AT_name("bit")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   24

    1187                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
    1188                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191                      .dwendtag $C$DW$T$24
    1192              
    1193              
    1194              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1195                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
    1196                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1197              $C$DW$82        .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$82, DW_AT_name("IMULT")
    1200                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_IMULT")
    1201                      .dwattr $C$DW$82, DW_AT_bit_offset(0x09)
    1202                      .dwattr $C$DW$82, DW_AT_bit_size(0x07)
    1203                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$83        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
    1209                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
    1210                      .dwattr $C$DW$83, DW_AT_bit_offset(0x08)
    1211                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1214              
    1215              $C$DW$84        .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$84, DW_AT_name("FMULT")
    1218                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_FMULT")
    1219                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06)
    1220                      .dwattr $C$DW$84, DW_AT_bit_size(0x02)
    1221                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$85        .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$85, DW_AT_name("rsvd2")
    1227                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd2")
    1228                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1229                      .dwattr $C$DW$85, DW_AT_bit_size(0x06)
    1230                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$86        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$86, DW_AT_name("rsvd3")
    1236                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd3")
    1237                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1238                      .dwattr $C$DW$86, DW_AT_bit_size(0x10)
    1239                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1240                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1241              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   25

    1242                      .dwendtag $C$DW$T$25
    1243              
    1244              
    1245              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1246                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
    1247                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1248              $C$DW$87        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1250                      .dwattr $C$DW$87, DW_AT_name("all")
    1251                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
    1252                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255              $C$DW$88        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1257                      .dwattr $C$DW$88, DW_AT_name("bit")
    1258                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
    1259                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262                      .dwendtag $C$DW$T$26
    1263              
    1264              
    1265              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1266                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
    1267                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1268              $C$DW$89        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$89, DW_AT_name("LOCKS")
    1271                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LOCKS")
    1272                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
    1273                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1274                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$90        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$90, DW_AT_name("SLIPS")
    1280                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SLIPS")
    1281                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1282                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1283                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1285              
    1286              $C$DW$91        .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1289                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1290                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00)
    1291                      .dwattr $C$DW$91, DW_AT_bit_size(0x0e)
    1292                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295              $C$DW$92        .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   26

    1297                      .dwattr $C$DW$92, DW_AT_name("rsvd2")
    1298                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd2")
    1299                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1300                      .dwattr $C$DW$92, DW_AT_bit_size(0x10)
    1301                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1302                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304                      .dwendtag $C$DW$T$27
    1305              
    1306              
    1307              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1308                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
    1309                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1310              $C$DW$93        .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1312                      .dwattr $C$DW$93, DW_AT_name("all")
    1313                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1314                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$94        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$27)
    1319                      .dwattr $C$DW$94, DW_AT_name("bit")
    1320                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1321                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324                      .dwendtag $C$DW$T$28
    1325              
    1326              
    1327              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1328                      .dwattr $C$DW$T$29, DW_AT_name("CLKCFGLOCK1_BITS")
    1329                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1330              $C$DW$95        .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$95, DW_AT_name("CLKSRCCTL1")
    1333                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1334                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
    1335                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$96        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$96, DW_AT_name("CLKSRCCTL2")
    1342                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1343                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e)
    1344                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$97        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$97, DW_AT_name("CLKSRCCTL3")
    1351                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CLKSRCCTL3")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   27

    1352                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d)
    1353                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$98        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$98, DW_AT_name("SYSPLLCTL1")
    1360                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1361                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1362                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1363                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$99        .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$99, DW_AT_name("SYSPLLCTL2")
    1369                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1370                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b)
    1371                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$100       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$100, DW_AT_name("SYSPLLCTL3")
    1378                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1379                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a)
    1380                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$101       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$101, DW_AT_name("SYSPLLMULT")
    1387                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1388                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09)
    1389                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$102       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$102, DW_AT_name("AUXPLLCTL1")
    1396                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1397                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    1398                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$103       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
    1405                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
    1406                      .dwattr $C$DW$103, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   28

    1407                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$104       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$104, DW_AT_name("rsvd2")
    1414                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd2")
    1415                      .dwattr $C$DW$104, DW_AT_bit_offset(0x06)
    1416                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$105       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$105, DW_AT_name("AUXPLLMULT")
    1423                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1424                      .dwattr $C$DW$105, DW_AT_bit_offset(0x05)
    1425                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$106       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$106, DW_AT_name("SYSCLKDIVSEL")
    1432                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1433                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1434                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$107       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$107, DW_AT_name("AUXCLKDIVSEL")
    1441                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1442                      .dwattr $C$DW$107, DW_AT_bit_offset(0x03)
    1443                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1444                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$108       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$108, DW_AT_name("PERCLKDIVSEL")
    1450                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1451                      .dwattr $C$DW$108, DW_AT_bit_offset(0x02)
    1452                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1453                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456              $C$DW$109       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$109, DW_AT_name("rsvd3")
    1459                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd3")
    1460                      .dwattr $C$DW$109, DW_AT_bit_offset(0x01)
    1461                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   29

    1462                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$110       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$110, DW_AT_name("LOSPCP")
    1468                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_LOSPCP")
    1469                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1470                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1471                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$111       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1476                      .dwattr $C$DW$111, DW_AT_name("rsvd4")
    1477                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd4")
    1478                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1479                      .dwattr $C$DW$111, DW_AT_bit_size(0x10)
    1480                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1481                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483                      .dwendtag $C$DW$T$29
    1484              
    1485              
    1486              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1487                      .dwattr $C$DW$T$30, DW_AT_name("CLKCFGLOCK1_REG")
    1488                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1489              $C$DW$112       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1491                      .dwattr $C$DW$112, DW_AT_name("all")
    1492                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1493                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$113       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1498                      .dwattr $C$DW$113, DW_AT_name("bit")
    1499                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1500                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503                      .dwendtag $C$DW$T$30
    1504              
    1505              
    1506              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1507                      .dwattr $C$DW$T$31, DW_AT_name("CLKSEM_BITS")
    1508                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1509              $C$DW$114       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$114, DW_AT_name("SEM")
    1512                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SEM")
    1513                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    1514                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1515                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   30

    1517              
    1518              $C$DW$115       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$115, DW_AT_name("rsvd1")
    1521                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd1")
    1522                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1523                      .dwattr $C$DW$115, DW_AT_bit_size(0x0e)
    1524                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527              $C$DW$116       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$116, DW_AT_name("KEY")
    1530                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_KEY")
    1531                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1532                      .dwattr $C$DW$116, DW_AT_bit_size(0x10)
    1533                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1534                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536                      .dwendtag $C$DW$T$31
    1537              
    1538              
    1539              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1540                      .dwattr $C$DW$T$32, DW_AT_name("CLKSEM_REG")
    1541                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1542              $C$DW$117       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1544                      .dwattr $C$DW$117, DW_AT_name("all")
    1545                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1546                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$118       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$31)
    1551                      .dwattr $C$DW$118, DW_AT_name("bit")
    1552                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1553                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556                      .dwendtag $C$DW$T$32
    1557              
    1558              
    1559              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1560                      .dwattr $C$DW$T$33, DW_AT_name("CLKSRCCTL1_BITS")
    1561                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1562              $C$DW$119       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$119, DW_AT_name("OSCCLKSRCSEL")
    1565                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1566                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    1567                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    1568                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571              $C$DW$120       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   31

    1572                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1574                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1575                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0d)
    1576                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1577                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$121       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$121, DW_AT_name("INTOSC2OFF")
    1583                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1584                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1585                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1586                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1588              
    1589              $C$DW$122       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1591                      .dwattr $C$DW$122, DW_AT_name("XTALOFF")
    1592                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_XTALOFF")
    1593                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0b)
    1594                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1595                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1597              
    1598              $C$DW$123       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1600                      .dwattr $C$DW$123, DW_AT_name("WDHALTI")
    1601                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_WDHALTI")
    1602                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    1603                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1604                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1606              
    1607              $C$DW$124       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1609                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    1610                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    1611                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1612                      .dwattr $C$DW$124, DW_AT_bit_size(0x0a)
    1613                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1615              
    1616              $C$DW$125       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$125, DW_AT_name("rsvd3")
    1619                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd3")
    1620                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1621                      .dwattr $C$DW$125, DW_AT_bit_size(0x10)
    1622                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1623                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625                      .dwendtag $C$DW$T$33
    1626              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   32

    1627              
    1628              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1629                      .dwattr $C$DW$T$34, DW_AT_name("CLKSRCCTL1_REG")
    1630                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1631              $C$DW$126       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    1633                      .dwattr $C$DW$126, DW_AT_name("all")
    1634                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1635                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1637              
    1638              $C$DW$127       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$33)
    1640                      .dwattr $C$DW$127, DW_AT_name("bit")
    1641                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1642                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645                      .dwendtag $C$DW$T$34
    1646              
    1647              
    1648              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1649                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL2_BITS")
    1650                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1651              $C$DW$128       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$128, DW_AT_name("AUXOSCCLKSRCSEL")
    1654                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1655                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e)
    1656                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1657                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$129       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$129, DW_AT_name("CANABCLKSEL")
    1663                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1664                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    1665                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1666                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$130       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$130, DW_AT_name("CANBBCLKSEL")
    1672                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1673                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1674                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1675                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$131       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    1681                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   33

    1682                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1683                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1684                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$132       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1690                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    1691                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    1692                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1693                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$133       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    1699                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    1700                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1701                      .dwattr $C$DW$133, DW_AT_bit_size(0x06)
    1702                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$134       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$134, DW_AT_name("rsvd4")
    1708                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd4")
    1709                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    1710                      .dwattr $C$DW$134, DW_AT_bit_size(0x10)
    1711                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1712                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714                      .dwendtag $C$DW$T$35
    1715              
    1716              
    1717              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1718                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL2_REG")
    1719                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1720              $C$DW$135       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    1722                      .dwattr $C$DW$135, DW_AT_name("all")
    1723                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1724                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$136       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$35)
    1729                      .dwattr $C$DW$136, DW_AT_name("bit")
    1730                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1731                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734                      .dwendtag $C$DW$T$36
    1735              
    1736              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   34

    1737              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1738                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL3_BITS")
    1739                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1740              $C$DW$137       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$137, DW_AT_name("XCLKOUTSEL")
    1743                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1744                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0d)
    1745                      .dwattr $C$DW$137, DW_AT_bit_size(0x03)
    1746                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1748              
    1749              $C$DW$138       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    1752                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    1753                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    1754                      .dwattr $C$DW$138, DW_AT_bit_size(0x0d)
    1755                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$139       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    1761                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    1762                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1763                      .dwattr $C$DW$139, DW_AT_bit_size(0x10)
    1764                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1765                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767                      .dwendtag $C$DW$T$37
    1768              
    1769              
    1770              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1771                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL3_REG")
    1772                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1773              $C$DW$140       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1775                      .dwattr $C$DW$140, DW_AT_name("all")
    1776                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1777                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$141       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$37)
    1782                      .dwattr $C$DW$141, DW_AT_name("bit")
    1783                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1784                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787                      .dwendtag $C$DW$T$38
    1788              
    1789              
    1790              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1791                      .dwattr $C$DW$T$41, DW_AT_name("CLK_CFG_REGS")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   35

    1792                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x32)
    1793              $C$DW$142       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
    1795                      .dwattr $C$DW$142, DW_AT_name("CLKSEM")
    1796                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CLKSEM")
    1797                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$143       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$30)
    1802                      .dwattr $C$DW$143, DW_AT_name("CLKCFGLOCK1")
    1803                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1804                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1805                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807              $C$DW$144       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$39)
    1809                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1810                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1811                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1812                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$145       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$34)
    1816                      .dwattr $C$DW$145, DW_AT_name("CLKSRCCTL1")
    1817                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1818                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1819                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821              $C$DW$146       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$36)
    1823                      .dwattr $C$DW$146, DW_AT_name("CLKSRCCTL2")
    1824                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1825                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1826                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1827              
    1828              $C$DW$147       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
    1830                      .dwattr $C$DW$147, DW_AT_name("CLKSRCCTL3")
    1831                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1832                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1833                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1834              
    1835              $C$DW$148       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$423)
    1837                      .dwattr $C$DW$148, DW_AT_name("SYSPLLCTL1")
    1838                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1839                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1840                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$149       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$39)
    1844                      .dwattr $C$DW$149, DW_AT_name("rsvd2")
    1845                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd2")
    1846                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   36

    1847                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1848              
    1849              $C$DW$150       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$425)
    1851                      .dwattr $C$DW$150, DW_AT_name("SYSPLLMULT")
    1852                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1853                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1854                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$151       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$427)
    1858                      .dwattr $C$DW$151, DW_AT_name("SYSPLLSTS")
    1859                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1860                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1861                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1862              
    1863              $C$DW$152       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$24)
    1865                      .dwattr $C$DW$152, DW_AT_name("AUXPLLCTL1")
    1866                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1867                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1868                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1869              
    1870              $C$DW$153       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$39)
    1872                      .dwattr $C$DW$153, DW_AT_name("rsvd3")
    1873                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd3")
    1874                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1875                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1876              
    1877              $C$DW$154       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$26)
    1879                      .dwattr $C$DW$154, DW_AT_name("AUXPLLMULT")
    1880                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1881                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1882                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1883              
    1884              $C$DW$155       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$28)
    1886                      .dwattr $C$DW$155, DW_AT_name("AUXPLLSTS")
    1887                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1888                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1889                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$156       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$419)
    1893                      .dwattr $C$DW$156, DW_AT_name("SYSCLKDIVSEL")
    1894                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1895                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1896                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1897              
    1898              $C$DW$157       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    1900                      .dwattr $C$DW$157, DW_AT_name("AUXCLKDIVSEL")
    1901                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   37

    1902                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1903                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$158       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$381)
    1907                      .dwattr $C$DW$158, DW_AT_name("PERCLKDIVSEL")
    1908                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1909                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1910                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912              $C$DW$159       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$433)
    1914                      .dwattr $C$DW$159, DW_AT_name("XCLKOUTDIVSEL")
    1915                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1916                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1917                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$160       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    1921                      .dwattr $C$DW$160, DW_AT_name("rsvd4")
    1922                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd4")
    1923                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1924                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1925              
    1926              $C$DW$161       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$339)
    1928                      .dwattr $C$DW$161, DW_AT_name("LOSPCP")
    1929                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOSPCP")
    1930                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1931                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1932              
    1933              $C$DW$162       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$345)
    1935                      .dwattr $C$DW$162, DW_AT_name("MCDCR")
    1936                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_MCDCR")
    1937                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1938                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$163       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$431)
    1942                      .dwattr $C$DW$163, DW_AT_name("X1CNT")
    1943                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_X1CNT")
    1944                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1945                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947                      .dwendtag $C$DW$T$41
    1948              
    1949              $C$DW$164       .dwtag  DW_TAG_TI_far_type
    1950                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$41)
    1951              
    1952              $C$DW$T$437     .dwtag  DW_TAG_volatile_type
    1953                      .dwattr $C$DW$T$437, DW_AT_type(*$C$DW$164)
    1954              
    1955              
    1956              $C$DW$T$42      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   38

    1957                      .dwattr $C$DW$T$42, DW_AT_name("CPU2RESCTL_BITS")
    1958                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1959              $C$DW$165       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$165, DW_AT_name("RESET")
    1962                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RESET")
    1963                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0f)
    1964                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1967              
    1968              $C$DW$166       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1970                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    1971                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    1972                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    1973                      .dwattr $C$DW$166, DW_AT_bit_size(0x0f)
    1974                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1976              
    1977              $C$DW$167       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1979                      .dwattr $C$DW$167, DW_AT_name("KEY")
    1980                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_KEY")
    1981                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    1982                      .dwattr $C$DW$167, DW_AT_bit_size(0x10)
    1983                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1984                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986                      .dwendtag $C$DW$T$42
    1987              
    1988              
    1989              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1990                      .dwattr $C$DW$T$43, DW_AT_name("CPU2RESCTL_REG")
    1991                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1992              $C$DW$168       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1994                      .dwattr $C$DW$168, DW_AT_name("all")
    1995                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    1996                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$169       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$42)
    2001                      .dwattr $C$DW$169, DW_AT_name("bit")
    2002                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2003                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2005              
    2006                      .dwendtag $C$DW$T$43
    2007              
    2008              
    2009              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2010                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL0_BITS")
    2011                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   39

    2012              $C$DW$170       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$170, DW_AT_name("EPWM1")
    2015                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_EPWM1")
    2016                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0f)
    2017                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$171       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$171, DW_AT_name("EPWM2")
    2024                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_EPWM2")
    2025                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0e)
    2026                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$172       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$172, DW_AT_name("EPWM3")
    2033                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_EPWM3")
    2034                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0d)
    2035                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$173       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$173, DW_AT_name("EPWM4")
    2042                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_EPWM4")
    2043                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2044                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2045                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$174       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$174, DW_AT_name("EPWM5")
    2051                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_EPWM5")
    2052                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0b)
    2053                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2056              
    2057              $C$DW$175       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2059                      .dwattr $C$DW$175, DW_AT_name("EPWM6")
    2060                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_EPWM6")
    2061                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0a)
    2062                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2063                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2065              
    2066              $C$DW$176       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   40

    2067                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$176, DW_AT_name("EPWM7")
    2069                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_EPWM7")
    2070                      .dwattr $C$DW$176, DW_AT_bit_offset(0x09)
    2071                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2072                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$177       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$177, DW_AT_name("EPWM8")
    2078                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_EPWM8")
    2079                      .dwattr $C$DW$177, DW_AT_bit_offset(0x08)
    2080                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2081                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$178       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$178, DW_AT_name("EPWM9")
    2087                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_EPWM9")
    2088                      .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
    2089                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2090                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$179       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$179, DW_AT_name("EPWM10")
    2096                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_EPWM10")
    2097                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06)
    2098                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2101              
    2102              $C$DW$180       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$180, DW_AT_name("EPWM11")
    2105                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_EPWM11")
    2106                      .dwattr $C$DW$180, DW_AT_bit_offset(0x05)
    2107                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$181       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$181, DW_AT_name("EPWM12")
    2114                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_EPWM12")
    2115                      .dwattr $C$DW$181, DW_AT_bit_offset(0x04)
    2116                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2117                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$182       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   41

    2122                      .dwattr $C$DW$182, DW_AT_name("rsvd1")
    2123                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd1")
    2124                      .dwattr $C$DW$182, DW_AT_bit_offset(0x03)
    2125                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2126                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$183       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$183, DW_AT_name("rsvd2")
    2132                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd2")
    2133                      .dwattr $C$DW$183, DW_AT_bit_offset(0x02)
    2134                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2135                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$184       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$184, DW_AT_name("rsvd3")
    2141                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd3")
    2142                      .dwattr $C$DW$184, DW_AT_bit_offset(0x01)
    2143                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2144                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$185       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$185, DW_AT_name("rsvd4")
    2150                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd4")
    2151                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    2152                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2153                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$186       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$186, DW_AT_name("rsvd5")
    2159                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd5")
    2160                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    2161                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    2162                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165                      .dwendtag $C$DW$T$44
    2166              
    2167              
    2168              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2169                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL0_REG")
    2170                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2171              $C$DW$187       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    2173                      .dwattr $C$DW$187, DW_AT_name("all")
    2174                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    2175                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   42

    2177              
    2178              $C$DW$188       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$44)
    2180                      .dwattr $C$DW$188, DW_AT_name("bit")
    2181                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
    2182                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185                      .dwendtag $C$DW$T$45
    2186              
    2187              
    2188              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2189                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL11_BITS")
    2190                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2191              $C$DW$189       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$189, DW_AT_name("ADC_A")
    2194                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ADC_A")
    2195                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0f)
    2196                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$190       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$190, DW_AT_name("ADC_B")
    2203                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ADC_B")
    2204                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    2205                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$191       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$191, DW_AT_name("ADC_C")
    2212                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ADC_C")
    2213                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    2214                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2215                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$192       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$192, DW_AT_name("ADC_D")
    2221                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ADC_D")
    2222                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
    2223                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2224                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227              $C$DW$193       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    2230                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    2231                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   43

    2232                      .dwattr $C$DW$193, DW_AT_bit_size(0x0c)
    2233                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$194       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$194, DW_AT_name("rsvd2")
    2239                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd2")
    2240                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    2241                      .dwattr $C$DW$194, DW_AT_bit_size(0x10)
    2242                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2243                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245                      .dwendtag $C$DW$T$46
    2246              
    2247              
    2248              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2249                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL11_REG")
    2250                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2251              $C$DW$195       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2253                      .dwattr $C$DW$195, DW_AT_name("all")
    2254                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_all")
    2255                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$196       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$46)
    2260                      .dwattr $C$DW$196, DW_AT_name("bit")
    2261                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_bit")
    2262                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265                      .dwendtag $C$DW$T$47
    2266              
    2267              
    2268              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2269                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL12_BITS")
    2270                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2271              $C$DW$197       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$197, DW_AT_name("CMPSS1")
    2274                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CMPSS1")
    2275                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0f)
    2276                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$198       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$198, DW_AT_name("CMPSS2")
    2283                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CMPSS2")
    2284                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0e)
    2285                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   44

    2287                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$199       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$199, DW_AT_name("CMPSS3")
    2292                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CMPSS3")
    2293                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0d)
    2294                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$200       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$200, DW_AT_name("CMPSS4")
    2301                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CMPSS4")
    2302                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0c)
    2303                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$201       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$201, DW_AT_name("CMPSS5")
    2310                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CMPSS5")
    2311                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0b)
    2312                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$202       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$202, DW_AT_name("CMPSS6")
    2319                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_CMPSS6")
    2320                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0a)
    2321                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$203       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$203, DW_AT_name("CMPSS7")
    2328                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_CMPSS7")
    2329                      .dwattr $C$DW$203, DW_AT_bit_offset(0x09)
    2330                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$204       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$204, DW_AT_name("CMPSS8")
    2337                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_CMPSS8")
    2338                      .dwattr $C$DW$204, DW_AT_bit_offset(0x08)
    2339                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:30 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_Ipc_Driver_Util.asm                                          PAGE   45

    2342              
    2343              $C$DW$205       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$205, DW_AT_name("rsvd1")
    2346                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd1")
    2347                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00)
    2348                      .dwattr $C$DW$205, DW_AT_bit_size(0x08)
    2349                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$206       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2354                      .dwattr $C$DW$206, DW_AT_name("rsvd2")
    2355                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd2")
    2356                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    2357                      .dwattr $C$DW$206, DW_AT_bit_size(0x10)
    2358                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2359                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361                      .dwendtag $C$DW$T$48
    2362              
    2363              
    2364              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2365                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL12_REG")
    2366                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2367              $C$DW$207       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    2369                      .dwattr $C$DW$207, DW_AT_name("all")
    2370                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_all")
    2371                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$208       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$48)
    2376                      .dwattr $C$DW$208, DW_AT_name("bit")
    2377                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_bit")
