TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v18.1.2.LTS *
       3              ;* Date/Time created: Fri Dec 14 17:55:18 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD/F2837xD_CpuTimers.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\WorkSpace\CCS_WorkSpace\CanTest\Debug")
      13                      .global _CpuTimer1
      14 00000000       _CpuTimer1:     .usect  ".ebss",8,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("CpuTimer1")

     259 00000055 7700          NOP       ; [CPU_ALU] 
     260 00000056 E203          MOV32     *-SP[8],R0H           ; [CPU_FPU] |119| 
         00000057 0048 
     261                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 124,column 5,is_stmt,isa 0
     262 00000058 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |124| 
     263 00000059 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |124| 
     264 0000005a 0648          MOVL      ACC,*-SP[8]           ; [CPU_ALU] |124| 
     265 0000005b 1901          SUBB      ACC,#1                ; [CPU_ALU] |124| 
     266 0000005c 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |124| 
     267                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 129,column 5,is_stmt,isa 0
     268 0000005d 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |129| 
     269 0000005e 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |129| 
     270 0000005f 2BF4          MOV       *+XAR4[6],#0          ; [CPU_ALU] |129| 
     271                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 130,column 5,is_stmt,isa 0
     272 00000060 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |130| 
     273 00000061 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |130| 
     274 00000062 2BFC          MOV       *+XAR4[7],#0          ; [CPU_ALU] |130| 
     275                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 135,column 5,is_stmt,isa 0
     276 00000063 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |135| 
     277 00000064 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |135| 
     278 00000065 1AE4          OR        *+XAR4[4],#0x0010     ; [CPU_ALU] |135| 
         00000066 0010 
     279                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 137,column 5,is_stmt,isa 0
     280 00000067 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |137| 
     281 00000068 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |137| 
     282 00000069 1AE4          OR        *+XAR4[4],#0x0020     ; [CPU_ALU] |137| 
         0000006a 0020 
     283                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 138,column 5,is_stmt,isa 0
     284 0000006b 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |138| 
     285 0000006c 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |138| 
     286 0000006d 18E4          AND       *+XAR4[4],#0xfbff     ; [CPU_ALU] |138| 
         0000006e FBFF 
     287                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 139,column 5,is_stmt,isa 0
     288 0000006f 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |139| 
     289 00000070 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |139| 
     290 00000071 18E4          AND       *+XAR4[4],#0xf7ff     ; [CPU_ALU] |139| 
         00000072 F7FF 
     291                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 140,column 5,is_stmt,isa 0
     292 00000073 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |140| 
     293 00000074 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |140| 
     294 00000075 1AE4          OR        *+XAR4[4],#0x4000     ; [CPU_ALU] |140| 
         00000076 4000 
     295                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 146,column 5,is_stmt,isa 0
     296 00000077 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |146| 
     297 00000078 0200          MOVB      ACC,#0                ; [CPU_ALU] |146| 
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE    7

     298 00000079 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |146| 
     299                      .dwpsn  file "../F2837xD/F2837xD_CpuTimers.c",line 147,column 1,is_stmt,isa 0
     300 0000007a FE88          SUBB      SP,#8                 ; [CPU_ARAU] 
     301                      .dwcfi  cfa_offset, -2
     302              $C$DW$17        .dwtag  DW_TAG_TI_branch
     303                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     304                      .dwattr $C$DW$17, DW_AT_TI_return
     305              
     306 0000007b 0006          LRETR     ; [CPU_ALU] 
     307                      ; return occurs ; [] 
     308                      .dwattr $C$DW$9, DW_AT_TI_end_file("../F2837xD/F2837xD_CpuTimers.c")
     309                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x93)
     310                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     311                      .dwendentry
     312                      .dwendtag $C$DW$9
     313              
     314              ;**************************************************************
     315              ;* UNDEFINED EXTERNAL REFERENCES                              *
     316              ;**************************************************************
     317                      .global _CpuTimer1Regs
     318                      .global _CpuTimer2Regs
     319                      .global _CpuTimer0Regs
     320              
     321              ;***************************************************************
     322              ;* TYPE INFORMATION                                            *
     323              ;***************************************************************
     324              
     325              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     326                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     327                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     328              $C$DW$18        .dwtag  DW_TAG_member
     329                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$30)
     330                      .dwattr $C$DW$18, DW_AT_name("TIM")
     331                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_TIM")
     332                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     334              
     335              $C$DW$19        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$26)
     337                      .dwattr $C$DW$19, DW_AT_name("PRD")
     338                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_PRD")
     339                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     340                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$20        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$28)
     344                      .dwattr $C$DW$20, DW_AT_name("TCR")
     345                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_TCR")
     346                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     347                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     348              
     349              $C$DW$21        .dwtag  DW_TAG_member
     350                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     351                      .dwattr $C$DW$21, DW_AT_name("rsvd1")
     352                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE    8

     353                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     354                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     355              
     356              $C$DW$22        .dwtag  DW_TAG_member
     357                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$34)
     358                      .dwattr $C$DW$22, DW_AT_name("TPR")
     359                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TPR")
     360                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     361                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     362              
     363              $C$DW$23        .dwtag  DW_TAG_member
     364                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$32)
     365                      .dwattr $C$DW$23, DW_AT_name("TPRH")
     366                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_TPRH")
     367                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     368                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     369              
     370                      .dwendtag $C$DW$T$20
     371              
     372              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     373                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     374              
     375              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     376                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$24)
     377              
     378              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     379                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     380                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     381              
     382              
     383              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     384                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_VARS")
     385                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     386              $C$DW$25        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     388                      .dwattr $C$DW$25, DW_AT_name("RegsAddr")
     389                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_RegsAddr")
     390                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     391                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     392              
     393              $C$DW$26        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     395                      .dwattr $C$DW$26, DW_AT_name("InterruptCount")
     396                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_InterruptCount")
     397                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     398                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     399              
     400              $C$DW$27        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$16)
     402                      .dwattr $C$DW$27, DW_AT_name("CPUFreqInMHz")
     403                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CPUFreqInMHz")
     404                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     405                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     406              
     407              $C$DW$28        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE    9

     408                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$16)
     409                      .dwattr $C$DW$28, DW_AT_name("PeriodInUSec")
     410                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_PeriodInUSec")
     411                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     412                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     413              
     414                      .dwendtag $C$DW$T$24
     415              
     416              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     417                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
     418                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     419              
     420              
     421              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     422                      .dwattr $C$DW$T$25, DW_AT_name("PRD_BITS")
     423                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     424              $C$DW$29        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$29, DW_AT_name("LSW")
     427                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_LSW")
     428                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00)
     429                      .dwattr $C$DW$29, DW_AT_bit_size(0x10)
     430                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     432              
     433              $C$DW$30        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$30, DW_AT_name("MSW")
     436                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_MSW")
     437                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00)
     438                      .dwattr $C$DW$30, DW_AT_bit_size(0x10)
     439                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     440                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     441              
     442                      .dwendtag $C$DW$T$25
     443              
     444              
     445              $C$DW$T$26      .dwtag  DW_TAG_union_type
     446                      .dwattr $C$DW$T$26, DW_AT_name("PRD_REG")
     447                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     448              $C$DW$31        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     450                      .dwattr $C$DW$31, DW_AT_name("all")
     451                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
     452                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     454              
     455              $C$DW$32        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     457                      .dwattr $C$DW$32, DW_AT_name("bit")
     458                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bit")
     459                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462                      .dwendtag $C$DW$T$26
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   10

     463              
     464              
     465              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     466                      .dwattr $C$DW$T$27, DW_AT_name("TCR_BITS")
     467                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     468              $C$DW$33        .dwtag  DW_TAG_member
     469                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     470                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     471                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     472                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
     473                      .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     474                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     475                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     476              
     477              $C$DW$34        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$34, DW_AT_name("TSS")
     480                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_TSS")
     481                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b)
     482                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     483                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     485              
     486              $C$DW$35        .dwtag  DW_TAG_member
     487                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     488                      .dwattr $C$DW$35, DW_AT_name("TRB")
     489                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TRB")
     490                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     491                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     492                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495              $C$DW$36        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     498                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     499                      .dwattr $C$DW$36, DW_AT_bit_offset(0x06)
     500                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     501                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     502                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     503              
     504              $C$DW$37        .dwtag  DW_TAG_member
     505                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     506                      .dwattr $C$DW$37, DW_AT_name("SOFT")
     507                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SOFT")
     508                      .dwattr $C$DW$37, DW_AT_bit_offset(0x05)
     509                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     510                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     512              
     513              $C$DW$38        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$38, DW_AT_name("FREE")
     516                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_FREE")
     517                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   11

     518                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     519                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522              $C$DW$39        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     524                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     525                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     526                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     527                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     528                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     530              
     531              $C$DW$40        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     533                      .dwattr $C$DW$40, DW_AT_name("TIE")
     534                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_TIE")
     535                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     536                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     537                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     538                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     539              
     540              $C$DW$41        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$41, DW_AT_name("TIF")
     543                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_TIF")
     544                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     545                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     546                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549                      .dwendtag $C$DW$T$27
     550              
     551              
     552              $C$DW$T$28      .dwtag  DW_TAG_union_type
     553                      .dwattr $C$DW$T$28, DW_AT_name("TCR_REG")
     554                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     555              $C$DW$42        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$42, DW_AT_name("all")
     558                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     559                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562              $C$DW$43        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$27)
     564                      .dwattr $C$DW$43, DW_AT_name("bit")
     565                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     566                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     567                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     568              
     569                      .dwendtag $C$DW$T$28
     570              
     571              
     572              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   12

     573                      .dwattr $C$DW$T$29, DW_AT_name("TIM_BITS")
     574                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     575              $C$DW$44        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$44, DW_AT_name("LSW")
     578                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_LSW")
     579                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     580                      .dwattr $C$DW$44, DW_AT_bit_size(0x10)
     581                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     583              
     584              $C$DW$45        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$45, DW_AT_name("MSW")
     587                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_MSW")
     588                      .dwattr $C$DW$45, DW_AT_bit_offset(0x00)
     589                      .dwattr $C$DW$45, DW_AT_bit_size(0x10)
     590                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     591                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     592              
     593                      .dwendtag $C$DW$T$29
     594              
     595              
     596              $C$DW$T$30      .dwtag  DW_TAG_union_type
     597                      .dwattr $C$DW$T$30, DW_AT_name("TIM_REG")
     598                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     599              $C$DW$46        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     601                      .dwattr $C$DW$46, DW_AT_name("all")
     602                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_all")
     603                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     605              
     606              $C$DW$47        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     608                      .dwattr $C$DW$47, DW_AT_name("bit")
     609                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_bit")
     610                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613                      .dwendtag $C$DW$T$30
     614              
     615              
     616              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     617                      .dwattr $C$DW$T$31, DW_AT_name("TPRH_BITS")
     618                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     619              $C$DW$48        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$48, DW_AT_name("TDDRH")
     622                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_TDDRH")
     623                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08)
     624                      .dwattr $C$DW$48, DW_AT_bit_size(0x08)
     625                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     627              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   13

     628              $C$DW$49        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$49, DW_AT_name("PSCH")
     631                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PSCH")
     632                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     633                      .dwattr $C$DW$49, DW_AT_bit_size(0x08)
     634                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     635                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     636              
     637                      .dwendtag $C$DW$T$31
     638              
     639              
     640              $C$DW$T$32      .dwtag  DW_TAG_union_type
     641                      .dwattr $C$DW$T$32, DW_AT_name("TPRH_REG")
     642                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     643              $C$DW$50        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     645                      .dwattr $C$DW$50, DW_AT_name("all")
     646                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     647                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650              $C$DW$51        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     652                      .dwattr $C$DW$51, DW_AT_name("bit")
     653                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     654                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657                      .dwendtag $C$DW$T$32
     658              
     659              
     660              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     661                      .dwattr $C$DW$T$33, DW_AT_name("TPR_BITS")
     662                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     663              $C$DW$52        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$52, DW_AT_name("TDDR")
     666                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_TDDR")
     667                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     668                      .dwattr $C$DW$52, DW_AT_bit_size(0x08)
     669                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$53        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$53, DW_AT_name("PSC")
     675                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PSC")
     676                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00)
     677                      .dwattr $C$DW$53, DW_AT_bit_size(0x08)
     678                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     680              
     681                      .dwendtag $C$DW$T$33
     682              
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   14

     683              
     684              $C$DW$T$34      .dwtag  DW_TAG_union_type
     685                      .dwattr $C$DW$T$34, DW_AT_name("TPR_REG")
     686                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     687              $C$DW$54        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     689                      .dwattr $C$DW$54, DW_AT_name("all")
     690                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_all")
     691                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$55        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$33)
     696                      .dwattr $C$DW$55, DW_AT_name("bit")
     697                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_bit")
     698                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701                      .dwendtag $C$DW$T$34
     702              
     703              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     704                      .dwattr $C$DW$T$2, DW_AT_name("void")
     705              
     706              $C$DW$T$4       .dwtag  DW_TAG_base_type
     707                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     708                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     709                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     710              
     711              $C$DW$T$5       .dwtag  DW_TAG_base_type
     712                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     713                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     714                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     715              
     716              $C$DW$T$6       .dwtag  DW_TAG_base_type
     717                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     718                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     719                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     720              
     721              $C$DW$T$7       .dwtag  DW_TAG_base_type
     722                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     723                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     724                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     725              
     726              $C$DW$T$8       .dwtag  DW_TAG_base_type
     727                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     728                      .dwattr $C$DW$T$8, DW_AT_name("short")
     729                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     730              
     731              $C$DW$T$9       .dwtag  DW_TAG_base_type
     732                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     733                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     734                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     735              
     736              $C$DW$T$10      .dwtag  DW_TAG_base_type
     737                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
TMS320C2000 Assembler PC v18.1.2 Fri Dec 14 17:55:18 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2837xD_CpuTimers.asm                                                PAGE   15

     738                      .dwattr $C$DW$T$10, DW_AT_name("int")
     739                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     740              
     741              $C$DW$T$11      .dwtag  DW_TAG_base_type
     742                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     743                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     744                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     745              
     746              $C$DW$T$19      .dwtag  DW_TAG_typedef
     747                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     748                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     749                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     750              
     751              $C$DW$T$12      .dwtag  DW_TAG_base_type
     752                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     753                      .dwattr $C$DW$T$12, DW_AT_name("long")
     754                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     755              
     756              $C$DW$T$13      .dwtag  DW_TAG_base_type
     757                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     758                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     759                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
